[
    {
        "name": "සංඛ දිනෙත්",
        "info": "සංගීතඥයෙක්, ගායකයෙක්-ගීත රචකයෙක්",
        "Intro": "සංගීතඥයෙක්, ගායකයෙක්-ගීත රචකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1986 නොවැම්බර් 12, කළුතර",
        "Age": "අවුරුදු 35 යි",
        "description": "සංඛ දිනෙත් ද සිල්වා (සිංහල: සංඛ දිනෙත්) (උපත නොවැම්බර් 12, 1986), සංඛ දිනෙත් ලෙස වඩාත් ප්‍රකට, ශ්‍රී ලාංකේය පොප් සංගීත ගායකයෙක්-ගීත රචකයෙක් සහ නිර්මාපකයෙකි.\n\nසංඛ දිනෙත් තම පාසල් ජීවිතයේ වැඩි කාලයක් ගත කළේ පානදුර ශ්‍රී සුමංගල විද්‍යාලයේ ය\n\nසංඛ ඉස්කෝලේ බටහිර තූර්ය වාදක කණ්ඩායමේත් හිටියා. ඔහු ගිටාරය, පියානෝව, වයලීනය සහ නළාව වාදනය කළේය. ඔහුට ගායන සම්භාව්‍ය භාත්කන්දේ සංගීතය (ඉන්දියානු සම්භාව්‍ය) පිළිබඳ ඩිප්ලෝමාවක් ඇත. ඔහුගේ පාසල් කාලය පුරාම ඔහු දක්ෂතා සංදර්ශන රාශියකට සහභාගී විය.\n\nසංඛට පාසල් වාද්‍ය වෘන්දයට සම්බන්ධ වෙන්න පුළුවන් වුණේ තනු නිර්මාණය කිරීමේ හැකියාව නිසයි.\n\n සංගීත වෘත්තිය\n\n2007:සිරස සුපර්ස්ටාර්\n\n2008 සිරස සුපර්ස්ටාර් සීසන් 2 හි හයවැනි ස්ථානය සංඛට හිමිවිය.\n\n2008 - වර්තමානය\n\nසුපර්ස්ටාර් හරහා ඔහු ලබා ගත් ජනප්‍රියත්වයේ ප්‍රතිඵලයක් ලෙස, ලංකා බෙල්, එලිෆන්ට් ක්‍රීම් සෝඩා සහ මැලිබන් බිස්කට් ඇතුළු ශ්‍රී ලංකාවේ ප්‍රමුඛ පෙළේ සන්නාම කිහිපයක් ප්‍රවර්ධනය කිරීමට ඔහු තෝරා ගන්නා ලදී. ඔහුගේ පළමු ඇල්බමය \"සංක්‍රාන්ති\" සඳහා 2009 දී නිකුත් කර ඇත.\n\n2010 සිංහල චිත්‍රපටිය නිනෝ ලයිව් සහ 2011 සිංහල චිත්‍රපටිය \"කලර්ස්\" සඳහා සංඛ සංගීතය කළේය.\n\n2010 ජූලි මාසයේදී, ඔහු දේශීය ගුවන් විදුලි නාලිකාව වන හිරු එෆ්.එම් සමඟ එක්ව \"විවිධ ආකාරයේ ගීත\" මාලාවක් එළිදැක්වීමට සැලසුම් කරන බව\n\n ඩිස්කෝග්‍රැෆි"
    },
    {
        "name": "වොලී බැස්ටියන්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Death": "1985 ජනවාරි 10",
        "description": "වොලී බැස්ටියන්ස් (සිංහල: වොලී බැස්ටියන්) (1985 ජනවාරි 16 වැනි දින මිය ගියේය) ලෙසින් වඩාත් ප්‍රකට Ogustus Martheneus Bastiansz යනු 1940 ගණන්වල ගායන බයිලා ශෛලිය දියුණු කළ ශ්‍රී ලාංකික ගායකයෙකි.\n\nබැස්ටියන්ස් රථවාහන අංශයට අනුයුක්තව සේවය කළ පොලිස් නිලධාරියෙකු වූ අතර, ඔහු සිය සංගීත දිවිය ආරම්භ කරන විට පාගමන සංගීත කණ්ඩායමේද වාදනය කළේය. ඔහු පළපුරුදු ගිටාර් වාදකයෙක්, බැන්ජෝ වාදකයෙක් සහ වයලීන වාදකයෙක් ද විය. ඔහුගේ වාද්‍ය වෘන්ද මූලයන්ගෙන් අඳිමින්, ඔහු \"ජනරජයේ සටන ගීතිකාව\" සහ \"ඉන්කි පිංකි පාර්ලෙස් වවුස්\" වැනි ප්‍රමිතිවල තනු සම්භාව්‍ය බයිලා ගීත බවට පරිවර්තනය කළේය.\n\nඔහුගේ නම \"Wally\" සම්බන්ධයෙන් සෑම විටම යම් මතභේදයක් ඇති විය. අදටත් ළමයින්ට අන්වර්ථ නම් තැබීම ලංකාවේ සිරිතකි. ඔහුගේ සීයා වන විල්හෙල්මස් මාර්තේනියස්ගෙන් පසුව ඔහු බව්තීස්ම වූ නමුත්, පවුල තුළ, සමීප ඥාතීන් අතර සහ ඔහුගේ පැරණි අසල්වැසියන් අතර පවා, ඔගුස්ටස් හැඳින්වූයේ \"ඔලී හෝ ඔලින්ටන්\" ලෙස පමණි. තරුණ ඔගුස්ටස් ඔහුගේ නම සමඟ එතරම් පහසු නොවූ අතර බොහෝ විට ඔහුගේ මුලකුරු O.M. Ogustus හෝ Martheneus වලට වඩා Bastiansz. ඔහුගේ සංගීත වික්‍රමය ආරම්භ කිරීමෙන් පසු ඔහු ඔහුගේ \"ඔලී\" යන අන්වර්ථ නාමය ඔහුගේ සුප්‍රසිද්ධ වේදිකා නාමය \"වොලී\" ලෙසට අනුවර්තනය කළ අතර, සියලු නිල අරමුණු සඳහා ඔලින්ටන් මර්වින් බැස්ටියන්ස් ලෙස පෙනී සිටියේ ඔහුගේ මුල් මුලකුරු O.M.\n\nඔහුගේ ගීත එදිනෙදා ජීවිතය හා සරල මිනිසුන් සමඟ කටයුතු කළේය. ඔහුගේ එක් ජනප්‍රිය ගීතයක් ('නර්ස් නෝනා') රෝහලක හෙදියක් සඳහා වූ ගීතයක් වන අතර තවත් එකක් ජිල්ඩ් පෙම්වතා වන එරික් බැචෝගේ නඩු විභාගය ආවරණය කළේය. ඔහු ඉංග්‍රීසියෙන් ගීත කිහිපයක්ම ගායනා කළේය. ඔහු විසින් රචනා කරන ලද නමුත් පසුකාලීනව අනෙකුත් ජනප්‍රිය කලාකරුවන් වෙත ආරෝපණය කරන ලද අනෙකුත් ගීත වන්නේ Hai Hooi Babi Achige, Yaman Bando Vesak බලන්න, Ratak Watinawa, Le Kiri Karala, Irene Josephine, Kussi Amma Sera, Muhudey Yamu Masun Genena, Weeriyen Soya, Nondi Simaiyya, Wada කහ සුදිය, සහ තවත් බොහෝ අය. බබී ආච්චිගේ බයිසිකලේ ගීතය මොරටුව වේල්ස් කුමර විද්‍යාලය අසලදී බබී ආච්චිට සිදුවූ සත්‍ය සිදුවීමකි.\n\nඔහුගේ සර්වකාලීන ප්‍රියතම ගීතය වන \"නර්ස් නෝනා\" හි හෙදිය අන් කිසිවකු නොව 1940 ගණන්වල මුල් භාගයේ හෙදියක් ලෙස සේවය කළ ඔහුගේම නැසීගිය සොහොයුරිය වන ෆෙලීෂියා ෆ්ලෝරන්ස් ජයසේකර (නී බැස්ටියන්ස් මිය ගියේය 1996) බව නොදන්නා කරුණකි. ෆ්ලෝරන්ස් 1944 දී ඇගේ පළමු දරුවා ඉපදීමෙන් පසු හෙදියක් ලෙස ඇයගේ රැකියාව අත්හැරියාය. 1969 දී ෆ්ලෝරන්ස් සහ ඇගේ පවුලේ අය ඔවුන්ගේ රෝගී පියා වන හින්ටන් විල්මට් බැස්ටියන්ස් රැකබලා ගැනීම සඳහා ගාල්ල සහ ගිංතොට අතර වෙරළට කිලෝමීටර් 2 ක් පමණ උතුරින් පිහිටි කුඩා ගම්මානයක් වන පයියදිගම පිහිටි බැස්ටියන්ස් පවුලේ පාරම්පරික නිවස වෙත පදිංචියට ගියහ.\n\nවොලී බැස්ටියන්ස් සහ ඔහුගේ සහෝදර සහෝදරියන් අට දෙනාම උපන් පියදිගම පිහිටි පැරණි බැස්ටියන්ස් නිවස දැන් ෆ්ලෝරන්ස්ගේ පුතෙකු විසින් වාසය කරයි.\n\nවොලී බැස්ටියන්ස් ශ්‍රී ලාංකේය ජනප්‍රිය කලාකරුවෙකු වන ජූඩි ද සිල්වා සමඟ සමීපව සම්බන්ධ වේ. වොලී ජූඩිගේ මවගේ සීයා වන එඩ්ගා ද සිල්වාගේ පළමු ඥාති සහෝදරයා වේ. වොලීගේ පියා හින්ටන් සහ එඩ්ගර්ගේ මව විනිෆ්‍රඩ් සහෝදරයා සහ සහෝදරිය විය."
    },
    {
        "name": "ගුණදාස කපුගේ",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1945 අගෝස්තු 7, ශ්‍රී ලංකාව",
        "Death": "3 අප්රේල් 2003\n\n(වයස අවුරුදු 57)",
        "Star sign": "ලියෝ",
        "description": "ඇල්ලමුල්ල කපුගේ ගුණදාස\n\n (සිංහල: ඇල්ලමුල්ල කපුගේ ගුණදාස , අගෝස්තු 7, 1945 - අප්‍රේල් 3, 2003), ඔහුගේ වේදිකා නාමයෙන් වඩාත් ප්‍රකට\n\nගුණදාස කපුගේ\n\n, ශ්‍රී ලාංකික සංගීතඥයෙක් විය. ඔහු ශ්‍රී ලාංකිකයන් අතර ප්‍රසිද්ධියට පත් වූයේ ඔහුගේ සංගීත ප්‍රකාශනවල දාර්ශනික පසුබිම සහ ඔහුගේ කෘති සඳහා තෝරා ගත් පද රචනය හේතුවෙනි. කපුගේගේ ඒක පුද්ගල ප්‍රසංගය කැදෙව්වා\n\nකම්පන\n\n එය සිංහල සංගීත ක්‍ෂේත්‍රයේ ඓතිහාසික ආගමනයකි. මුල් ජීවිතය කපුගේ උපත ලැබුවේ 1945 අගෝස්තු 7 වැනිදා ඇල්පිටියේ තණබද්දේගම නම් කුඩා ගම්මානයේය. සහෝදර සහෝදරියන් අට දෙනාගෙන් දෙවැන්නා වූ ඔහු, පහ ශ්‍රේණිය දක්වා කරන්දෙණිය මධ්‍ය මහා විද්‍යාලයටත්, අවසාන කොටස අම්බලන්ගොඩ ධර්මාශෝක විද්‍යාලයටත් ඇතුළත් වූ අතර එහිදී ඔහු සංගීතයට මාරුවීමට පෙර විද්‍යාව හැදෑරීය. 1963 දී ඔහු ඉන්දියාවේ උපාධි පාඨමාලාවක් හැදෑරීමට එවකට ඔහු ඉගෙනුම ලබමින් සිටි හේවුඩ් සංගීත විද්‍යාලයෙන් ඉවත් විය. 1960 අගභාගයේදී ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවට බැඳුණු කපුගේ 1969 දී මෙහෙයුම් සහායකයකු ලෙස සේවය කළ අතර 1975 දී වැඩසටහන් නිෂ්පාදකවරයකු ලෙස කටයුතු ආරම්භ කළේය. 1981 දී රජරට සේවයේ සංගීත අංශය භාරව පත්වීම් ලැබූ ඔහු පසුව දුම්රිය ස්ථානයේ පාලක තනතුරට උසස් විය. රජරට සේවය ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවේ පළාත් ගුවන් විදුලි මධ්‍යස්ථානයකි. පසුව ඔහු 1978 දී ප්‍රේමා විතානගේ සමඟ විවාහ විය. සංගීත දිවිය කපුගේගේ මුල් නිකුතුව 1973 දී \"දෑස නිලුපුල් තේමා\" ලෙස නම් කරන ලද අතර එය ක්ෂණික ජනප්‍රියත්වයක් විය. ඉන් පසුව, කපුගේ 'ඒ ශ්‍රේණියේ' ගායන ශිල්පියෙකු ලෙස රේඩියෝ සිලෝන් විසින් උපුටා දක්වන ලදී. විශාරද කපුගේගේ දශක තුනක සංගීත දිවිය ආරම්භ වූයේ එලෙසිනි. ඔහු පසුබිම් සංගීතය සැපයූ පළමු වේදිකා නාට්‍යය වූයේ සුගතපාල ද සිල්වාගේ \"තුරංග සන්නිය\" ය. එතැන් පටන් ඔහු ලූෂන් බුලත්සිංහලගේ සහ තවත් කිහිප දෙනෙකුගේ අතිශය ජනප්‍රිය සංගීතමය \"තාරාවෝ ඉගිලෙති\" සඳහා පසුබිම් සංගීතය සැපයීය. ඔහුගේ පළමු චිත්‍රපට පසුබිම් සංගීත ප්‍රසංගය වූයේ ස්ටැන්ලි පෙරේරාගේ \"සඳ\" සඳහාය. 1980 දී, කපුගේ විසින් මාලිනී බුලත්සිංහලගේ සහභාගීත්වයෙන් \"දම්පටින් ලා සඳ\" නමින් ඔහුගේ ප්‍රථම සංගීත සංයුක්ත කැසට් පටය නිකුත් කරන ලදී. සංගීත කැසට් වේදිකා නාට්‍ය ටෙලි නාට්‍ය චිත්‍රපට කපුගේ \"කම්පන\" නමින් ඒකපුද්ගල සංගීත සංදර්ශනයක් 1990 දශකයේ වේදිකා ගත කළ අතර එම මාතෘකා සහිත සීඩී පටයක් ද නිකුත් කරන ලදී. Death එක්සත් අරාබි එමීර් රාජ්‍යයේ ඩුබායි හි සංචාරයකට ගොස් ආපසු එන අතරවාරයේදී බණ්ඩාරනායක ජාත්‍යන්තර ගුවන් තොටුපළේදී ෂටල බසයක් බසිමින් සිටියදී කපුගේ වැටී ඇත. ඔහුගේ හිස පිටුපසට තුවාල සිදුවී ඇත. අලුයම 4.30 ට පමණ ඔහු ගුවන් තොටුපළේ වෛද්‍ය මධ්‍යස්ථානය වෙත ගෙන ගිය අතර එහිදී ඔහුට සේලයින් ලබා දී ඇත. මූලික ප්‍රතිකාරවලින් පසු ඔහු කොළඹ ජාතික රෝහලට රැගෙන යාමට නියමිතව තිබිණි. කෙසේ වෙතත්, සහායට පිරිමි හෙදියක් සිටියේ නැත. කපුගේ පසුව කොළඹ ජාතික රෝහලේදී මිය ගියේය.ඔහුගේ පුත් මිත්‍ර කපුගේ ඔහුගේ පියාගේ ගීත දිගටම ගායනා කරයි.සම්මාන1996199719981999"
    },
    {
        "name": "අමරසිරි පීරිස්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "සංගීතඥයෙක්\n\nගායකයා\n\nවයලින් වාදකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Profiles": "",
        "description": "අමරසිරි පීරිස් යනු වයලීන් වාදකයෙකු සහ ගායන ශිල්පියෙකු ලෙස ප්‍රසිද්ධ ශ්‍රී ලාංකේය සංගීත කලාකරුවෙකි. ජීවිතය සහ වාහකයා ඔහු නැසීගිය පුත්‍රයාය.\n\nඇල්බට් පීරිස්\n\n 1940 ගණන්වල ලංකා ගුවන්විදුලි ශිල්පියෙක්. ඔහු ඉගෙනුම ලැබුවේ මහරගම බුවනෙකබා විද්‍යාලයෙනි\n\nදෘශ්‍ය සහ රංග කලා විශ්වවිද්‍යාලය\n\n (හිටපු\n\nහේවුඩ් ආයතනය\n\n) ඔහු A-ශ්‍රේණියේ වයලීන වාදකයෙකු ලෙස SLBC හා සම්බන්ධ වූ අතර, අවසානයේ සංගීත කොන්දොස්තරවරයෙකු, සංගීත පාලකයෙකු බවට පත් වූ අතර, මා විශ්‍රාම යන විට ඔහු SLBC හි සංගීත අධ්‍යක්ෂක ලෙස කටයුතු කළේය. පීරිස් ශ්‍රී ලංකාවේ සම්මානනීය ගායකයෙක් වන අතර ඔහු තවමත් වේදිකාවේ දස්කම් දක්වයි. ඔහුගේ පළමු ජනප්‍රිය ගීතය\n\nලන්ඩුනේ\n\n එය රචනා කළේ ප්‍රේමසිරි කේමදාස විශාරද විසිනි. ඊට පස්සේ වගේ ජනප්‍රිය ගීත රැසක් ගායනා කළා"
    },
    {
        "name": "ඩෙස්මන්ඩ් ද සිල්වා",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "description": "ඩෙස්මන්ඩ් ද සිල්වා ශ්‍රී ලාංකේය ගායකයෙක් සහ විනෝදාස්වාදකයෙක් වන අතර, දශක හතරකට වඩා වැඩි ප්‍රසංගයක් වෙනස් කර ඇති ඔහුගේ තරුණ කටහඬ නිසා \"බයිලා රජු\" ලෙස සැලකේ. දකුණු ශ්‍රී ලංකාවේ මාතර ප්‍රදේශයේ උපත ලද ද සිල්වා දැන් ඕස්ට්‍රේලියාවේ පදිංචිව සිටින අතර ලොව පුරා ප්‍රසංග ශාලා පිරී ඉතිරී ගොස් ඇත.1960 දශකයේ ලංකාවේ\n\nඔහුගේ රසිකයින් දන්නා පරිදි \"ඩෙස්\" 1963 දී කොළඹ ජනප්‍රිය සංගීතයෙන් ඔහුගේ වෘත්තීය ජීවිතය දියත් කළේය, ඔහු ෆයර්-ෆ්ලයිස් හි ප්‍රධාන ගායකයා විය. ඔහුගේ සංගීතය රේඩියෝ සිලෝන් සහ පසුව දකුණු ආසියාවේ පැරණිතම ගුවන් විදුලි මධ්‍යස්ථානය වන ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවේ පුළුල් ලෙස ප්‍රදර්ශනය විය. ඩෙස් ශ්‍රී ලංකාවේ ප්‍රමුඛ පෙළේ පොප් කණ්ඩායම් සමඟ ද රඟපා ඇත - \"ස්පිට්ෆයර්ස්\", \"ගැබෝ ඇන්ඩ් ද බ්‍රේක්ඒවේස්\" සහ \"ජෙට්ලයිනර්ස්\". ඔහු මිග්නෝන් ප්‍රනාන්දු සහ ජෙට්ලයිනර්ස් සමඟ එක්ව 'ඔබ නිසා' නම් ගීතයක් ගායනා කළේය - එය ජාත්‍යන්තර ගීත උළෙලකදී සංගීත විශිෂ්ට කෘතියක් ලෙස ප්‍රශංසාවට ලක් විය. 1976 දී ඔහු මාලදිවයින ඇතුළු අග්නිදිග ආසියාවේ විවිධ රටවල ප්‍රසංග කළ \"ඩෙස්මන්ඩ් සහ ක්ලැන්\" ඔහුගේම සංගීත කණ්ඩායමක් පිහිටුවීමට තීරණය කළේය. 1984 දී ද සිල්වා තනිව යාමට තීරණය කළේය.\n\n ජාත්‍යන්තර ගීත තරඟ\n\nDesmond de Silva 1979 ග්‍රීසියේ ඇතන්ස් නුවර පැවති 5 වැනි ගීත ඔලිම්පියාඩ් උළෙලේදී සහ ජපානයේ ටෝකියෝ නුවර පැවති Yamaha Festival of Song හිදී ශ්‍රී ලංකාව නියෝජනය කර ඇත.\n\n අවුරුදු හතළිහක් Showbiz හි\n\nඔහු ප්‍රදර්ශන ව්‍යාපාරයේ වසර 40ක් සමරමින් ලොව පුරා CD තැටි මිලියන ගණනක් අලෙවි කර ඇත. ද සිල්වා ශ්‍රී ලාංකේය 'බයිලා' සංගීතයේ ජනප්‍රිය වාදනය සඳහා ප්‍රසිද්ධය, එය පෘතුගීසි සහ ස්පාඤ්ඤ සංගීතයේ මූලාරම්භය වූ ශෛලියකි. ඔහුට 'පොල්කටු හඳේ,' 'යමන් බන්ඩෝ (වොලී බැස්ටියන්ස්),' 'චූඩා මැනිකේ,' 'අම්මා නෝ,' 'මිස් ශ්‍රී ලංකා,' 'හායි හූයි බබා ආච්චි(වොලී බැස්ටියන්ස්) ඇතුළු බයිලා ගීත වැලක් තිබේ. ' 'රාජසඟබෝ' 'කෝමලි පැනේ' මෙන්ම ජනප්‍රිය නිර්නාමික බයිලා ගීත පටිගත කිරීම්. ඔහු ලොව පුරා අලෙවි වන 'පාර්ටි ටයිම්' නොනවතින බයිලා සංගීතය සඳහා ද ප්‍රසිද්ධය.\n\nඩෙස්මන්ඩ් ද සිල්වා දැන් ලන්ඩනයේ පදිංචිව සිටින අතර එක්සත් රාජධානියේ බොහෝ ප්‍රසංගයකදී ලන්ඩන් පදනම් කරගත් විදේශ කටයුතු සහාය කණ්ඩායම සමඟ ප්‍රසංග කර ඇත.\n\n ඔටිසම් රෝගයට හේතුව ජය ගැනීම\n\nද සිල්වා ඔටිසම් සහ ඇස්පර්ජර් සින්ඩ්‍රෝමය සඳහා ප්‍රමුඛයා වී ඇත: ඔහු 2005 අගෝස්තු මාසයේදී ඉතිහාසය නිර්මාණය කළේ ශ්‍රී ලංකාවේ ඔටිසම් දරුවන් සහ ඕටිසම් රෝගයෙන් පෙළෙන අය වෙනුවෙන් ආයාචනා කළ පළමු ශ්‍රී ලාංකේය සංගීතඥයා වීමෙනි. තමන් වෙනුවෙන් කතා කරන්න බැහැ.' ද සිල්වාට අත්පොළසන් දෙන ලදී.\n\nද සිල්වා කොළඹ බණ්ඩාරනායක සම්මන්ත්‍රණ ශාලාවේදී දහස් ගණනක් අමතමින් මෙසේ පැවසීය: 'ඔටිසම් යනු ලොව පුරා බොහෝ දෙනෙකුට බලපාන ස්නායු-සංවර්ධන ආබාධයකි. ඔටිසම් යනු මානසික රෝගයක් නොවේ, මේ ළමයින් සහ වැඩිහිටියන් වෙනස් ලෙස සිතති. ඔවුන් පවසන්නේ ඇල්බට් අයින්ස්ටයින් ඔටිසම් රෝගයෙන් පෙළුණු බවයි. ශ්‍රී ලංකාවේ ඔටිසම් රෝගීන් 38,000ක් සිටින බව ප්‍රේක්ෂකාගාරයෙන් දන්නේ කීයෙන් කීදෙනාද? එබැවින් අපි විනෝදකාමීන් ලෙස ඔබ සැමගෙන් ඉල්ලා සිටින්නේ 'තමන් වෙනුවෙන් කතා කළ නොහැකි අය වෙනුවෙන් කතා කරන ලෙසයි.' ඔටිසම් රෝගය පිළිබඳ දැනුවත්භාවය පතුරුවා හරිමු, විශේෂයෙන් ඔටිසම් දරුවන්ගේ සංඛ්‍යාව ඉහළ යන විට සහ පොදු සේවාවන් ද සපයන ලෙස අපි අපගේ රජයෙන් ඉල්ලා සිටිමු - අපි අපේ සුන්දර දිවයිනේ ඔටිසම් දරුවන් සඳහා අධ්‍යාපනය, සෞඛ්‍ය, විශේෂඥ කථන ප්‍රතිකාර ලබා දෙන්නේ නම් ඇල්බට් අයින්ස්ටයින් පවා බිහි කළ හැකි බව කවුද දන්නේ. ....'\n\nDesmond de Silva විසින් 2006 මාර්තු 31 දින ඕස්ට්‍රේලියාවේ සිඩ්නි නුවරදී ශ්‍රී ලංකාව සඳහා ඔටිසම් රෝගය සඳහා වූ ප්‍රථම ප්‍රසංගය දියත් කරන ලදී.\n\nඔහු ශ්‍රී ලංකාවේ ජනප්‍රිය විනෝදාස්වාදකයෙකු ලෙස පවතින අතර එක්සත් රාජධානිය, එක්සත් ජනපදය, ඕස්ට්‍රේලියාව, ඉන්දියාව සහ වෙනත් ස්ථානවල දැඩි ඉල්ලුමක් ඇත.\n\n ඩෙස්මන්ඩ් ද සිල්වා පිළිබඳ උපුටා දැක්වීම්\n\nඩෙස්මන්ඩ් ද සිල්වා ශ්‍රී ලංකාවේ ප්‍රමුඛ පෙළේ සංගීතඥයෙකි - ඔහු ශ්‍රී ලාංකීය බයිලා සංගීතය ලොව පුරා ප්‍රචලිත කර ඇති අතර ලොස් ඇන්ජලීස්, නිව් යෝර්ක්, මෙල්බර්න්, ලන්ඩන්, ඕක්ලන්ඩ්, ඩුබායි, බහරේන්, නවදිල්ලි සහ සිංගප්පූරුව වැනි දුර බැහැර ක්ෂේත්‍රවල පෙනී සිට ඇත. .'\n\nලෝක සංගීත මධ්‍යම\n\nඔව්... BMICH හි අලෙවි වූ ප්‍රසංගයේදී ඔවුන්ගේ වීරයාගේ ඉහළ ක්‍රියාදාමයට සවන් දීමට සහ දැකීමට ඔවුන් සියල්ලෝම රොත්තක් පැමිණියහ. වැඩිහිටි රසිකයින් උත්සවය රස විඳීමට සහ ඔවුන්ගේ ප්‍රියතම ගීතවලට සවන් දෙන අතර, තරුණයින් රස විඳීමට උනන්දු වන අතර, සමහර විට පළමු වතාවට, Desmond Live in Concert - අනපේක්ෂිත වෙනසක් සහිත ප්‍රසංගයක්. එය සංගීත ලෝකයේ, රංග ශාලාවේ, විලාසිතා සහ සමාජයේ ප්‍රභූන්ට ද රාත්‍රියක් විය - ඔවුන්ට මෙම අතිවිශිෂ්ටත්වය සහ ඩෙස්මන්ඩ්ගේ ප්‍රශංසනීය සංදර්ශන මග හැරෙන්නේ නැති බව සහතිකයි....'\n\nඉරිදා නිරීක්ෂක ශ්‍රී ලංකා\n\nඩෙස්මන්ඩ්ට රත්තරන් හදවතක් ඇත, ඔහු ඔටිසම් රෝගයෙන් පෙළෙන පුද්ගලයින් වෙත ළඟා වෙමින් සිටින අතර ශ්‍රී ලංකා ඔටිසම් දැනුවත් කිරීමේ ව්‍යාපාරය මෙම තත්ත්වය පිළිබඳව දැනුවත් කිරීම පිළිබඳව 'බයිලා රජුට' කෘතඥ වෙනවා. ඩෙස්මන්ඩ් ද සිල්වා වෙනසක් කරයි.ඔහු ලොව පුරා ප්‍රේක්ෂකයින් කුල්මත් කර ඇත. ඔහුගේ සීඩී තැටි ලොව පුරා මිලියන ගණනින් අලෙවි වී ඇත. ශ්‍රී ලංකාවේ ඔටිසම් දරුවන් 38,000 කගේ දුක්ඛිත තත්වය ගැන ඇසීමෙන් ඩෙස්මන්ඩ් සංවේදී විය - පාසල්වල උපකාර කරනු ලබන්නේ අතළොස්සක් පමණක් වන අතර සෞඛ්‍ය පිළිබඳ මහජන සේවාවන් වෙත ප්‍රවේශ වීමට දෙමාපියන්ට, රැකබලා ගන්නන්ට සහ ඔටිස්ට්වරුන්ට අරගල කිරීමට සිදු වේ. දිවයිනේ අධ්‍යාපන විශේෂඥ කථන චිකිත්සාව සහ විවේක සත්කාර.'\n\nඔටිසම් දැනුවත් කිරීමේ ව්‍යාපාරය ශ්‍රී ලංකාව\n\n'වසර 40 කට වැඩි කාලයක් රංගනයේ යෙදී සිටින ද සිල්වා මහතා ඔහුගේ ඉහළම ජනප්‍රිය ගීත කිහිපයක් ඉදිරිපත් කරනු ඇතැයි අපේක්ෂා කෙරේ. මෙම කලාකරුවා ලොව පුරා සිටින ප්‍රේක්ෂකයින් අලෙවි කිරීමට ඉදිරිපත් කර ඇති අතර පළමු වරට ද වෝබ්ලර්, බයිසන් හි ප්‍රසංගය පවත්වයි. බහරේන්හි ජාත්‍යන්තර හෝටලය. ඉංග්‍රීසි ගීතවල ප්‍රවීණ ගායකයෙකු වන ඔහු 1963 දී Fireflies නම් සංගීත කණ්ඩායම සමඟින් සිය සංගීත ගමන ආරම්භ කළේය. ගායකයා දැනට The Warbler හි ප්‍රසංගය කරන SriMirage සංගීත කණ්ඩායම සමඟ ද කටයුතු කර ඇති අතර අද ප්‍රසංගය ඔවුන්ගේ නැවත එක්වීම සනිටුහන් කරයි. ...'\n\nගල්ෆ් ඩේලි නිව්ස් බහරේන්\n\n ඩිස්කෝග්‍රැෆි\n\nබයිලා 20\n\nග්‍රැමෆෝන් එක්ස්ප්‍රස්\n\nචූද මාණිකේ\n\nහාදු හතක්\n\nකෝමලි පැනේ\n\nබයිලා රාජ්ජේ\n\nසන්ෆ්ලවර්ස් සමග ඩෙස්මන්ඩ් සිල්වා"
    },
    {
        "name": "ඉන්ද්‍රචාප ලියනගේ",
        "info": "සංගීතඥයෙක්",
        "Intro": "සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1982 ජනවාරි 13, කොළඹ",
        "Age": "අවුරුදු 39 යි",
        "Family": "පියා:\n\nහේමසිරි ලියනගේ",
        "description": "ඉන්ද්‍රචාපා ලියනගේ (සිංහල: ඉන්ද්‍රචාපා ලියනගේ; උපත ජනවාරි 13, 1982) යනු ශ්‍රී ලාංකික ගායකයෙකි. ඔහු සිය පළමු ඇල්බමය අභිනිෂ්ක්‍රමනය (අත්‍හැරීම) සම්පූර්ණ කර ඇත, නමුත් එය තවමත් නිල වශයෙන් නිකුත් කර නොමැත. චරිතාපදානය\n\nඉන්ද්‍රචාප ලියනගේ 1982 ජනවාරි 13 වන දින ශ්‍රී ලංකාවේ කොළඹ දී උපත ලැබූ අතර අධ්‍යාපනය ලැබුවේ කොළඹ ආනන්ද විද්‍යාලයේ ය. ඔහුගේ සංගීත දිවිය ආරම්භ වූයේ 2000 වසරේ, ඔහුගේ පාසල් සගයා වන කසුන් කල්හාර සමඟ ඔවුන්ගේම ව්‍යාපෘතියක ය. නමින් ඇල්බමයක් නිකුත් කළහ\n\nහරිත නිම්නයේ\n\n, සහ එය ඉතා සාර්ථක නිකුතුවක් වූ අතර, ඇල්බමය ඔවුන් විශාල රසික පිරිසක් වෙත හඳුන්වා දුන්නේය. නමුත් 2004 සහ 2005 වසරවලදී, ඔවුන් තම ව්‍යාපෘතිය වසා දැමූ අතර, ඔවුන් එක් එක් අවස්ථාවන්හිදී එකට වැඩ කළද, සෑම කෙනෙකුම තමන්ගේම සංගීතය නිර්මාණය කළහ.\n\nමෑතකදී ඉන්ද්‍රචාප රොක් සංගීතයට යොමු වී \"ශ්‍රී ලාංකේය අනන්‍යතාවය\" රොක් ශෛලියක් නිර්මාණය කිරීම සඳහා අත්හදා බැලීම් කළේය. රටේ බහුතරයක් අතර රොක් සංගීතය ජනප්‍රිය කිරීම ඔහුගේ ප්‍රධාන අරමුණයි. ඔහු නමින් ගීතයක් නිකුත් කර ඇත\n\n\"ගිනිඩාල්\"\n\n එය ඔහුගේ පළමු ගීතය විය.\n\nඉන්ද්‍රචාප දේශීය ප්‍රධාන ප්‍රසංග 20 කට වැඩි ප්‍රමාණයක් සහ අනෙකුත් කලාකරුවන් සමඟ විදේශයන්හි කිහිපයක් ඉදිරිපත් කර ඇත.\n\n2010 දී ඔහු චිත්‍රපටයේ තේමා ගීතය රචනා කරමින් චිත්‍රපට ක්ෂේත්‍රයට පිවිසියේය\n\nHow I Wonder What You Are\n\n.\n\n පෞද්ගලික ජීවිතය\n\nඉන්ද්‍රචාප ඔහුගේ පවුලේ බාලම සාමාජිකයාය. ඔහුට වැඩිමහල් සහෝදරයන් දෙදෙනෙක් සිටී: සෞම්‍ය ලියනගේ සහ ආලෝක ලියනගේ. ඔහුගේ පියා හේමසිරි ලියනගේ ශ්‍රී ලංකාවේ ප්‍රසිද්ධ නළුවෙකි.\n\n ඩිස්කෝග්‍රැෆි\n\nඅභිනිෂ්ක්‍රමනය (අත්‍හැරීම) (ඇල්බමය)\n\nකේවල\n\n\"\n\nආදරය අංශුමාත්‍රයක්\"\n\n (\"ආදරය පාපොච්චාරණයකි\")\n\n\"\n\nදාසින්\"\n\n\"\n\nගිණිඩාල්\"'\n\n\"අබිනික්‍රමනය\"\n\n\"\n\nසිංහයෝ\n\n\"(2011 ක්‍රිකට් ලෝක කුසලානය සඳහා)\n\n\"\n\nIrunu Aththatu\n\n\"(2011)\n\nඋල්කපතයක් (තරු වැටෙන තරුව)\n\n\"\n\nපියවුණා දෙනෙත් නිදිමතින්\n\n \"\n\nIrunu Aththatu (විශේෂිත වෙබ් නිකුතුව)\n\n(\n\nYouTube වීඩියෝ සබැඳිය\n\n)]"
    },
    {
        "name": "නලින් ජයවර්ධන",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා\n\nගීත රචකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1957 අප්‍රේල් 18",
        "Age": "අවුරුදු 64 යි",
        "description": "නලින් ජයවර්ධන (සිංහල : නලින් ජයවර්ධන) (උපත 1957 අප්‍රේල් 18) යනු ජනප්‍රිය ශ්‍රී ලාංකික ගායකයෙක් සහ ගායන ශිල්පියෙකි. ලොව පුරා සිටින ඔහුගේ රසිකයින්ට නොමිලේ ඇල්බමය බාගත කිරීමට ඉඩ සලසමින් අන්තර්ජාලය පදනම් කරගත් ශ්‍රව්‍ය ඇල්බමයක් සිංහලෙන් නිකුත් කළ පළමු ශ්‍රී ලාංකික ගායකයා ඔහු විය. කන්ද පාමුලේ නම් වූ මෙම ඇල්බමය 2004 වසරේ නිකුත් කරන ලදී. නලින් ජයවර්ධන ජීවත් වන්නේ ඕස්ට්‍රේලියාවේ පර්ත් නගරයේය.\n\nජනප්‍රිය ගායන ශිල්පී එච් ආර් ජෝතිපාල වෙනුවෙන් උපහාර සීඩී තැටි කිහිපයක් ඇතුළුව සීඩී තැටි 10කට අධික ප්‍රමාණයක් ඔහු විසින් නිකුත් කර ඇත. නලින් ජයවර්ධන මුල් ගීත 250 කට අධික ප්‍රමාණයක් ගායනා කර ඇත. නලින්ගේ බොහෝ ගීත රචනා කළ ආචාර්ය විකුම්ප්‍රිය පෙරේරා, සුනිල් ගෝවින්නගේ, ශ්‍රියා කුමාරසිංහ, ක්‍රිෂාන්ති ද ෆොන්සේකා වැනි දක්ෂ සිංහල ගී පද රචකයන්ගේ සහයෝගයෙන් මෙම ගීත රචනා කර ඇත. නලින්ගේ ගීත සඳහා සංගීත නිර්මාණය නිමල් මෙන්ඩිස්, රොහාන් ජයවර්ධන, සංගීත් වික්‍රමසිංහ, ආනන්ද විද්‍යාසේකර, රුක්ෂාන් කරුණානායක ඇතුළු ජනප්‍රිය ශ්‍රී ලාංකේය සංගීතඥයන් අතින් සිදු විය. නලින් යනු Google Play, iTunes සහ Amazon හි ඔහුගේ ගීත නිකුත් කළ මුල් ශ්‍රී ලාංකික කලාකරුවන්ගෙන් කෙනෙකි.\n\nඋන්වහන්සේ බේරුවල සිරි සෝභිත හිමි සහ ආචාර්ය ගිල් ෆ්‍රොන්ස්ඩාල් සමඟ ප්‍රථම වරට ධම්මපද ගාථා සීඩී ඇසුරුම් සෑදීමට ද සහයෝගයෙන් කටයුතු කර ඇත. ඔහු ශ්‍රී ලංකාවේ සුනාමියෙන් විපතට පත් වූවන්ට ආධාර කිරීම සඳහා පුණ්‍යායතන සීඩී/ඩීවීඩී සෑදීමට ද සහයෝගයෙන් කටයුතු කළේය. ඔහු විකුම්ප්‍රිය පෙරේරා සහ භද්‍රජි මහින්ද ජයතිලක සමඟ එක්ව ප්‍රථම වරට සිංහල ශ්‍රව්‍ය ප්‍රබන්ධ ග්‍රන්ථයක් වන කුලගෙයින් කුලගෙයට සංයුක්ත තැටි පහක් දක්වා විහිදී ගියේය. මෙම ශ්‍රව්‍ය පොත ලංකා හෙරිටේජ් සහ සරසවි ප්‍රකාශකයන්ගේ ශ්‍රී ලංකාවේ නිෂ්පාදනයකි. ජීවිතය සහ වෘත්තීය\n\nළමා අවධිය\n\nචන්ද්‍රා මහතාගේ සහ මේරි ඈන් ජයවර්ධන මහත්මියගේ වැඩිමහල් පුත්‍රයා ලෙස නැගෙනහිර ශ්‍රී ලංකාවේ මඩකලපුවේ උපත ලද අතර, ප්‍රාථමික අධ්‍යාපනය ලැබුවේ මොරටුව වේල්ස් කුමර විද්‍යාලයෙන් සහ ගම්පහ බණ්ඩාරනායක විද්‍යාලයෙන් [WP]\n\nඔහු ඔහුගේම ගීත කිහිපයක් ලියා ඇති අතර ඔහුගේ ජීවිතයේ පසු අවධියේදී ඔහුගේ සංගීත ජීවිතය ආරම්භ කළේය. අර්ධ සම්භාව්‍යයේ සිට ජනප්‍රිය බටහිර දක්වා විවිධ ශෛලීන් සහ ප්‍රභේදයන්ගෙන් හඬ නැඟීමේ හැකියාව ඔහුට ඇති අර්ථයෙන් ඔහු සංගීතමය වශයෙන් දක්ෂයෙකි. ඔහු සිය රසික රසිකාවියන් පිනවීම සඳහා සිංහල ශ්‍රව්‍ය සංයුක්ත තැටි 11කට අධික ප්‍රමාණයක් සහ DVD තැටි කිහිපයක් නිෂ්පාදනය කර ඇත.\n\nඔහු වෘත්තියෙන් වෛද්‍ය විද්‍යාඥයෙකු වන ශ්‍රී ලංකාවේ ගලහිටියාවේ ගලහිටියාවේ පදිංචි රේණුකා ජයවර්ධන [නී රණසිංහ] සමඟ විවාහ වී ඇති අතර ඔහුට දියණියන් දෙදෙනෙක් සිටී. ඔහු පදිංචිව සිටින්නේ ඕස්ට්‍රේලියාවේ පර්ත් නගරයේය.\n\nමෑත සිදුවීම්\n\nනලින් ජයවර්ධන දැනට ඕස්ට්‍රේලියාවේ ගොඩනැගිලි සේවා වෘත්තිකයෙකු ලෙස සේවය කරයි. ඔහු මෑතකදී ෆේස්බුක් මිතුරන් සමඟ එක්ව නිර්මාණය කරන ලද \"දුරු රටවල අපි (2011),\" \"පිලක් වගේ (2013)\" සහ \"පිනි වැස්ස වගේ (2013)\" ඇල්බම දෙකක් සහ \"මල් රේණුවක් (2013) ඇතුළු සිංහල ශ්‍රව්‍ය සංයුක්ත තැටි කිහිපයක් නිකුත් කළේය. ).\"\n\n කැපී පෙනෙන ගීත\n\nසංසාර සුවඳ\n\n – නලින් ජයවර්ධන සහ අමිලා නදීශානි, සංගීතය සහ තනුව – ආනන්ද වෛද්‍යසේකර, පද රචනය – එරංග සී.පාලතිරත්න.\n\nදුරු රටවල අපි\n\n – නලින් ජයවර්ධන සහ නිලුපුලි දිල්හාරා, සංගීතය සහ තනුව – ආනන්ද වෛද්‍යසේකර, පද රචනය – ක්‍රිෂාන්ති ද ෆොන්සේකා.\n\nමාලවිකා\n\n – නලින් ජයවර්ධන, සංගීතය සහ තනුව – රොහාන් ජයවර්ධන, පද රචනය – විකුම්ප්‍රිය පෙරේරා.\n\nPaata Paata Samanaliyan\n\n – නලින් ජයවර්ධන, සංගීතය සහ තනුව – රුක්ෂාන් කරුණානායක සහය චයිම්ස් ඔෆ් ද 70ස්, පද රචනය – රුක්ෂාන් කරුණානායක.\n\nසුනාමිය\n\n – නලින් ජයවර්ධන, තනුව සහ ඉංග්‍රීසි වචන – නිමල් මෙන්ඩිස්, සංගීතය – රොහාන් ජයවර්ධන, සිංහල ගී පද – විකුම්ප්‍රිය පෙරේරා.\n\nමිදුල පුර\n\n – නලින් ජයවර්ධන සහ සඳුනි රශ්මිකා, සංගීතය සහ තනුව – ආනන්ද වෛද්‍යසේකර, පද රචනය – විකුම්ප්‍රිය පෙරේරා.\n\n\"සංසාර සුවඳ\"\n\n. ලබා ගන්නා ලදී\n\nදෙසැම්බර් 19\n\n 2013\n\n.\n\n\"දුරු රටවල අපි\"\n\n. ලබා ගන්නා ලදී\n\nදෙසැම්බර් 19\n\n 2013\n\n.\n\n\"මාලවිකා\"\n\n. ලබා ගන්නා ලදී\n\nදෙසැම්බර් 19\n\n 2013\n\n.\n\n\"පාට පාට සමනලියං\"\n\n. ලබා ගන්නා ලදී\n\nදෙසැම්බර් 19\n\n 2013\n\n.\n\n\"සුනාමි ශ්‍රී ලංකාව\"\n\n. ලබා ගන්නා ලදී\n\nදෙසැම්බර් 19\n\n 2013\n\n.\n\n\"මිදුල පුර\"\n\n. ලබා ගන්නා ලදී\n\nදෙසැම්බර් 19\n\n 2013\n\n.\n\n ශ්‍රව්‍ය සංයුක්ත තැටි ලැයිස්තුව\n\nකන්ද පාමුලේ (2004)\n\nඅනුස්මරණ උපහාර – එච් ආර් ජෝතිපාල උපහාරය (2004)\n\nසුනාමි ඕඩියෝ සීඩී (2005)\n\nසීතල සීතල රාත්‍රිය - නත්තල් තනි (2005)\n\nපාට පාට හීනයක් (2008)\n\nඋපහාර සිහිවටන (2009)\n\nවැලි අටයක් - විකුම්ප්‍රිය පෙරේරා ගී පද 02 (2009)\n\nAthithawarjanaa – H. R. Jothipala Upahara Gee Pelahara (2010)\n\nපර්ත් ගමට පායායි සන්ධා (2010)\n\nපාට පාට සමනලයින් (2010)\n\nOba Soya Ennam (H. R. Jothipala Tribute – නොමිලේ CD Release)\n\nදුරු රටවල අපි (2011)\n\nපිලක් වේගේ (2013)\n\nපිනි වැස්ස වාගේ (2013)\n\nමල් රේණුවක් (2013)\n\nප්‍රථම සිංහල අන්තර්ජාල සංගීත සංයුක්ත තැටිය\n\nසුනාමි ගීතයට එක්සත් රාජධානියේ ධනාත්මක ප්‍රතිචාර ලැබේ\n\nPata Paata Heenayak\n\n^\n\nඋපහාර සිහිවටන – ජෝතිපාලයන් සිහිකරමින්\n\nඋපහාර සිහිවටන - අනුස්මරණ සංයුක්ත තැටිය\n\n‘වැලි ඇටයක්’: නලින් සහ විකුම්ප්‍රිය හවුල් ව්‍යාපාරයක්\n\nදුරු රටවල අපි\n\n^\n\nපෙරේරා, චරිත්.\n\n\"ගී පද රචකයින් සහ කවියන් සඳහා ඩිජිටල් වේදිකාවක් දක්ෂතා සංචිතය තට්ටු කරයි\"\n\n. ඉරිදා ඔබ්සර්වර්.\n\nතිලකරත්න, ඉන්දීවර.\n\n\"ගීත තුළින් ජීවිතය නිරූපණය කිරීම\"\n\n. සිලෝන් ටුඩේ\n\n. ලබා ගන්නා ලදී\n\nදෙසැම්බර් 20\n\n 2013\n\n.\n\nමල් රේණුවක්"
    },
    {
        "name": "සාදිරිස් මාස්ටර්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක් සහ නළුවෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක් සහ නළුවෙක්",
        "A.K.A.": "ජෝතිරත්නගේ සාදිරිස් ද සිල්වා",
        "Is": "සංගීතඥයෙක්\n\nනළුවා\n\nගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "චිත්‍රපටය, රූපවාහිනිය, වේදිකාව සහ ගුවන්විදුලිය\n\nසංගීතය",
        "Gender": "පිරිමි",
        "Birth": "මාතර",
        "Death": "1958 අප්රේල් 8",
        "description": "සාදිරිස් මාස්ටර් ලෙස ප්‍රකට ජෝතිරත්නගේ සාදිරිස් ද සිල්වා (මියගියේ 1958) ශ්‍රී ලාංකික සංගීතඥයෙක් සහ නළුවෙකි.\n\nසාදිරිස් ඉපදුනේ මාතර. ඔහු කළුතර පන්සලේ අධ්‍යාපනය ලබා පෙරදිග භාෂාව හැදෑරුවා. සාදිරිස් පසුව හින්දුස්ථානි සහ කර්ණාටක සංගීතය ගායනා කරමින් සහ වාදනය කරමින් ජනප්‍රිය සංගීතවේදියෙකු විය. ජෝන් ද සිල්වා නාට්‍ය කිහිපයකම ප්‍රධාන චරිතයට පණ පොවමින් ඔහු රඟපෑවා. සිරිසඟබෝ, වෙස්සන්තර. සාදිරිස් මිය ගියේ 1958 අප්‍රේල් 8 වැනිදාය."
    },
    {
        "name": "රූකාන්ත ගුණතිලක",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා\n\nගීත රචකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "5 සැප්තැම්බර් 1959, කෑගල්ල, කෑගල්ල දිස්ත්‍රික්කය, සබරගමුව පළාත, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 62 යි",
        "Family": "කලත්රයා:\n\nචන්ද්‍රලේඛා පෙරේරා",
        "description": "මාරියෝ ග්ලෝරි රූකාන්ත ගුණතිලක\n\n (සිංහල:\n\nරූකාන්ත ගුණතිලක\n\n) (උපත 1959 සැප්තැම්බර් 5) ශ්‍රී ලාංකික ගායකයෙක් සහ ගීත රචකයෙකි. ඔහු 1980 දශකයේ අගභාගයේදී තනි ගායකයෙකු ලෙස සිය වෘත්තීය ජීවිතය ආරම්භ කළේය. ඔහු තම බිරිඳ චන්ද්‍රලේඛා පෙරේරා සමඟ නිතර යුගල ගායනා කරයි. ඔහුගේ දියණිය රයිනි චාරුකා ගුණතිලක ගායිකාවක් සහ නිළියක් ද වේ.රූකාන්ත ශ්‍රී ලාංකේය ඩිස්කෝ ක්ෂේත්‍රයේ සාර්ථකම සංගීතඥයෙකි. ඔහුගේ ඇල්බම ශ්‍රී ලංකාවේ පිටපත් 10,000ක් පමණ අලෙවි වී ඇත. 80 දශකයේ ශ්‍රී ලාංකේය සංගීත ක්ෂේත්‍රය සිය ගීතවලින් වෙනස් කළ පුද්ගලයා ලෙස ඔහු ප්‍රකටය. ජීවිතය හා වෘත්තීය ජීවිතය මුල් වසර රූකාන්ත ගුණතිලක කෑගල්ලේ උපත ලැබුවේ ශ්‍රී ලංකාවේ මධ්‍යම පාන්තික පවුලක ය. ඔහු කුඩා කල සිටම සංගීතයට ආදරය කළේය. එහි ප්‍රතිඵලයක් ලෙස ඔහුගේ දෙමාපියන් ඔහුව පියානෝ වාදනය ඉගැන්වීමට අසල සිටි සංගීත ගුරුවරයකු වෙත යැව්වා. රූකාන්ත වරක් ගුවන්විදුලි සම්මුඛ සාකච්ඡාවකදී කියා සිටියේ තම පාසලේ සංගීත ගුරුවරයෙකු එතරම් මිත්‍රශීලී නොවන බවත්, නිවැරදි ඇඟිලි ගැසීම් භාවිතා නොකිරීම නිසා ඔහුට කිහිප වතාවක්ම දඬුවම් කළ බවත්ය. පියානෝව තුළ. එසේම, ඔහු ඉගෙන ගැනීමට ගුරුවරයාට අවශ්‍ය දේට සීමා වන බව ඔහු සොයා ගත්තේය. ඔහු ප්‍රාථමික අධ්‍යාපනය සඳහා කෑගල්ල ශාන්ත මරියා විද්‍යාලයට ඇතුළත් විය. ඔහු තම පාසල වන මහනුවර ශාන්ත අන්තෝනි විද්‍යාලයෙන් සංගීතය ඉගෙන ගත්තේ ස්ටැන්ලි පීරිස් සහ සිරිල් බ්‍රවුන් වැනි විශිෂ්ට සංගීතඥයන්ගෙනි. සංගීතය රූකාන්ත ගුණතිලක මුලින්ම සංගීත රචකයෙකු ලෙස 1976 දී වෘත්තීය ජීවිතය කරගෙන ගියේය. ඔහුගේ \"බඹර පහස\" රචනා ගායකයෙකු ලෙස තම වෘත්තීය ජීවිතය ආරම්භ කරමින් ඔහු විසින්ම ගායනය සපයා ඇත. ඔහුගේ සිව්වන ඇල්බමය \"චාරුකා\", ඔහුගේ දියණියගේ නමින් නම් කරන ලදී.\n\nරයිනි චාරුකා ගුණතිලක\n\n, 1997 දී නිකුත් කරන ලදී. රූකාන්ත සහ චන්ද්‍රලේඛාගේ සුවිශේෂී ප්‍රසංගය \"රූ සඳ රැයේ\" එහි තේරුම \"සුන්දර සඳ රැය\" යන්නයි. පළමු ප්‍රසංගය 1993 පෙබරවාරි මාසයේදී ශ්‍රී ලංකාවේ කොළඹ එල්ෆින්ස්ටන් රඟහලේදී වේදිකාගත කරන ලදී. අද වන විට එය ඉතාලිය, ප්‍රංශය, ඩෙන්මාර්කය, එක්සත් රාජධානිය, ඇමරිකා එක්සත් ජනපදය සහ මැද පෙරදිග බහරේන් වැනි ලෝකයේ බොහෝ ස්ථානවල වේදිකාගත කර ඇත. \"රූ සඳ රැයේ\" ප්‍රසංගය 200 වාරයකට වඩා වේදිකාගත කර ඇති අතර තවමත් ගණන් බලා ඇත. පුද්ගලික ජීවිතය රූකාන්ත විවාහ වී සිටින්නේ ගායිකාවක් සහ හිටපු නිළි චන්ද්‍රලේඛා පෙරේරා සමඟයි. ඔවුන්ට දියණියන් දෙදෙනෙක්,\n\nරයිනි චාරුකා ගුණතිලක\n\n(උපත 1991 අප්‍රේල් 10) සහ\n\nට්‍රිනිටා වින්ඩි\n\n. 2005 දෙසැම්බරයේ සිට රූකාන්ත සහ චන්ද්‍රලේඛා සිය පවුලේ අය සමඟ නිව්යෝර්ක් නගරයේ පදිංචිව සිටිති. රූ සඳ රැයේ නවතම සංචාරය 2005 සහ 2006 අතර සිදු විය. \"රූකාන්ත-චන්ද්‍රලේඛා ලයිව් ඇට් ස්ටේඩියම්\" මෙගා සංදර්ශනය 2007 අගෝස්තු මාසයේදී සුගතදාස හිදී පැවැත්විණි. ගෘහස්ථ ක්‍රීඩාංගනය.DiscographySingles"
    },
    {
        "name": "සිසිර සේනාරත්න",
        "info": "ගායකයා",
        "Intro": "ගායකයා",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1935 මාර්තු 29, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 86 යි",
        "description": "සිසිර සේනාරත්න\n\n 1960 ගණන්වල සිට ශ්‍රී ලංකාවේ ජනප්‍රිය ගායකයෙක් විය. සේනාරත්න සිය බිරිඳ ඉන්ද්‍රානි සමඟ කැනඩාව, එක්සත් රාජධානිය, ඇමරිකා එක්සත් ජනපදය, ඩුබායි, ඕස්ට්‍රේලියාව, ජර්මනිය, ස්විට්සර්ලන්තය සහ ඉතාලිය ඇතුළු ශ්‍රී ලංකාවේ සහ ලොව පුරා සංදර්ශන පැවැත්වීය. ඔහුගේ බිරිඳ සමඟ එක්ව ශ්‍රී ලංකාවේ සහ විදේශයන්හි ජනප්‍රිය 'සිසින්ද්‍රා' සංගීත සංදර්ශන රැසක් පවත්වා ඇත. මුල් ජීවිතය සහ අධ්‍යාපනය මරදාන මධ්‍ය විද්‍යාලයෙන් සහ කොළඹ නාලන්දා විද්‍යාලයෙන් සේනාරත්න අධ්‍යාපනය ලබා ඇත.පවුල ඔහු විවාහ වූයේ ඉන්ද්‍රානි නී විජේබණ්ඩාර සමඟයි. වෘත්තීය ජීවිතය 1960 ගණන්වල සිට සිසිර සිට ඇත. \"ඕලු නෙළුම් නැළිය\", \"සීත දියරැලි\", \"නුහුරු නූපුරුද\", \"මගේ පුතුට මල්\", \"ගයා ගීතයන් ගේම් වැල් එළියේ\" වැනි ජනප්‍රිය ගීත රැසක් ගායනා කළා. 1956 සිසිර ගායනා කළා\n\nOlu Nelum Neliya Rangala\n\n ලාංකේය චිත්‍රපට අධ්‍යක්ෂ ලෙස්ටර් ජේම්ස් පීරිස්ගේ චිත්‍රපටිය සඳහා\n\nරැකව\n\n.සාමාන්‍ය යොමු"
    },
    {
        "name": "ෂෙල්ටන් ප්‍රේමරත්න",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1931",
        "Age": "අවුරුදු 90 යි",
        "Instruments:": "හඬ",
        "description": "ෂෙල්ටන් ප්‍රේමරත්න\n\n (උපත 1931) යනු විවිධ පෙරදිග හා බටහිර වාද්‍ය භාණ්ඩ වාදනය කරන ශ්‍රී ලාංකික වාද්‍ය වාදකයෙක් සහ සංගීත අධ්‍යක්ෂකවරයෙකි.\n\nප්‍රේමරත්න උපත ලැබුවේ සර්දිරිස් මාස්ටර්ගේ සහ එමලින් නෝනාගේ පුතුන් පස් දෙනාගෙන් කෙනෙකි.\n\nසීමාසහිත Sri Lankan Airlines විසින් පවත්වන ලද \"බක්ති ගී\" වැඩසටහන් බොහොමයක් ඔහු විසින් අධ්‍යක්ෂණය කරන ලදී. 2004 දී මාතර \"වෙහෙරහේන බුද්ධ ප්‍රතිමාව\" අබියස සිදු කරන ලද විශේෂ \"බක්ති ගී\" වැඩසටහන් TNL රූපවාහිනී විකාශන සේවයේ සජීවීව විකාශය වූ අතර 2005 දී වැඩසටහන ITN TV විකාශන සේවයේ විකාශය වේ. ඔහුගේ BAKTHI GEE ගීත බොහොමයක් ඔහුගේ පුත් අග්‍රා ප්‍රේමරත්නගේ උපකාරයෙන් ඩිජිටල් ලෙස රචනා කර මිශ්‍ර කර ඇත.\n\nඔහු බහුවිධ සංගීතඥයන් ද බිහි කළේය. සුප්‍රසිද්ධ හුණුවටය කතාවේ සංගීතය (බ්‍රේච්ට් කෝසෙකන්ඩ් හුණු කවය) ප්‍රේමරත්න විසින් සිංහල ක්ෂේත්‍රය සඳහා නිර්මාණය කරන ලදී.\n\nචිත්‍රපට සංගීතය1971 - හිතක පිපුණු මල්\n\n1972 - කළණ මිතුරෝ"
    },
    {
        "name": "නාරද දිසාසේකර",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "බ්‍රිතාන්‍ය ලංකාව, එක්සත් රාජධානිය",
        "Death": "2010 මැයි 19, ශ්‍රී ලංකාව, ශ්‍රී ලංකාව",
        "Star sign": "මිථුන ලග්නය",
        "Instruments:": "හඬ",
        "description": "නාරද දිසාසේකර\n\n (7 ජූනි 1933 - 19 මැයි 2010) ශ්‍රී ලාංකික සම්භාව්‍ය ගායකයෙකි. ඔහු 1964 දී තරුණයෙකු සමඟ ඔහුගේ \"ගලන ගඟකි ජීවිතේ\" යුගලය සඳහා පිරිමි පසුබිම් ගායනය සඳහා පළමු සරසවිය සම්මානය දිනා ගත්තේය.\n\nනන්දා මාලිනී\n\n සඳහා\n\nරන්මුතු දූව\n\n.\n\nජාතික ගුවන් විදුලියේ ඉංජිනේරු අංශයේ කාර්මිකයෙකු ලෙස ආරම්භ කළ දිසාසේකර පසුව ගුවන් විදුලියේ ජනප්‍රිය ගායකයෙකු බවට පත්විය.\n\n\"චන්දන එංගා ගලා\", \"එයා පමනයි මගේ මිහිරට\", \"මුළු හදින් මම ඔබට පෙම්කර\" නාරදගේ රේඩියෝ සිලෝන් ගීත කිහිපයකි.\n\n“ගලන ගඟකි ජීවිතේ”, “පිපී, පිපී රේණු නටන”, “ගමන නොනිමෙයි ලෝකයේ”,\n\n“ආරිච්චි බොරිච්චි” ඔහු ගැයූ පසුබිම් ගීත ජනප්‍රිය වුණා.\n\n“හතර කේන්ද්‍රය”, “සෙණසුම කොතැනද”, “ආදරයයි කරුණාවයි, මනමාලයෝ” චිත්‍රපට සඳහා ද ඔහු පසුබිම් ගීත සපයා ඇත.\n\nඑයා පුතා\n\nසාරංග දිසාසේකර\n\n යනු ලංකාවේ ප්‍රසිද්ධ ජනප්‍රිය නළුවෙකි.\n\nදිසාසේකර 2010 මැයි 19 වන දින වයස අවුරුදු 76 දී මිය ගියේය."
    },
    {
        "name": "නීලා වික්‍රමසිංහ",
        "info": "ශ්‍රී ලංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1950 මාර්තු 30",
        "Age": "අවුරුදු 71 යි",
        "Star sign": "මේෂ",
        "Profiles": "",
        "description": "විශාරද නීලා වික්‍රමසිංහ යනු ප්‍රධාන වශයෙන් සිංහල භාෂාවෙන් ගායනා කරන ශ්‍රී ලංකාවේ ප්‍රවීණ ගායිකාවක් සහ සංගීතඥයෙකි.\n\nවික්‍රමසිංහ වත්තල ප්‍රදේශයේ දොන් ප්‍රැන්සිස් වික්‍රමසිංහ සහ විතානආරච්චිගේ දෝනේ යසවතී ගුණසේකරගේ බාල දියණියයි. ඇය පෝලියෝ රෝගයට ගොදුරු වූයේ වයස අවුරුදු හයේදීය. ඇය ඉගෙන ගත් පළමු පාසල කිරිමැටියාගාර විද්‍යාලයයි. 1954 දී ඇය කැස්බෑව රජයේ පෞද්ගලික පාසලට ඇතුළත් කරන ලද අතර එහිදී ඇය මුලින්ම සංගීතයට සම්බන්ධ විය. පසුව ඇය මාම්පේ ශ්‍රී සෝභිත මහා විද්‍යාලයට ගියා. වික්‍රමසිංහ විශාරද වින්සන්ට් සෝමපාල සහ ආනන්ද ජයසිංහ යටතේ සංගීතය ඉගෙන ගත්තේය. ඇය 1959 දී එවකට ගුවන්විදුලි සිලෝන් ආයතනයට සිය පළමු ගීතය ගායනා කළේ 'ආධුනික හඬ' වැඩසටහනක් සඳහාය. 1967 දී ඇය සිය පළමු ගීතය රේඩියෝ සිලෝන් සමඟ පටිගත කිරීමේ භාග්‍යය ලැබුවාය. ඩෝල්ටන් අල්විස් මහතා විසින් රචනා කරන ලද මෙම ගීතය සංගීතවත් කළේ ලයනල් අල්ගම, \"සඳේ අඹරේ නිශ්ශබ්ද මල් යට\". 1973 දී ශ්‍රී ලංකා ගුවන් විදුලි සංස්ථාවේ පර්යේෂණ අංශයේ ගායනා කළ ගීතවල කුසලතාව මත ඇය A ශ්‍රේණියේ කලාකාරිනියක් ලෙස තේරී පත් වූවාය. උතුරු ඉන්දීය සම්භාව්‍ය සංගීතය හැදෑරීමෙන් පසු ඇය 1974 දී සංගීත් විශාරද උපාධිය ලබා ගත්තාය. වික්‍රමසිංහට T. M. ජයරත්න සමඟ යුගල ඇතුළු ජනප්‍රිය ගීත ගණනාවක් තිබුණි. පසුව වික්‍රමසිංහ සංගීතය පිළිබඳ ගුරුවරයකු වීමට තීරණය කළේය. පාසල් කිහිපයක ඉගැන්වීමෙන් පසු ඇය කොළඹ විශාඛා විද්‍යාලයේ වසර අටක දීර්ඝ කාලයක් සේවය කර වසර 23කට පසු 1998 දී අකාලයේ විශ්‍රාම යාමට තීරණය කළාය. වික්‍රමසිංහට උදරයේ පිළිකාවක් වැළඳී ඇති බව ඉතා බරපතළ ලෙස හඳුනාගෙන දිවි ගලවා ගත්තේය.\n\n සංගීතය\n\nමේ වන විට පසුබිම් ගායිකාවක් ලෙස චිත්‍රපට 67කට ගායනා කර ඇති ඇය ගීත සිය ගණනකට දායක වී තිබෙනවා. වික්‍රමසිංහ විසින් රචනා කරන ලද ගීත ලැයිස්තුව.\n\nසිංදුව\n\nගී පද\n\nගායකයා\n\nකක්කුටු සුත්තං\n\nසීතා රංජනී\n\nප්‍රදීපා ධර්මදාස\n\nදැල්තිර\n\nආනන්ද හේවරන්හිඳගේ\n\nනෙලූ අදිකාරි\n\nවල පොටින්\n\nමංජු නැදගමුව\n\nපෙට්‍රොනෙල්ලා ප්‍රනාන්දු\n\nආතා දෙන්නම්\n\nසුනෙත් ​​රූපසිංහ\n\nපෙට්‍රොනෙල්ලා ප්‍රනාන්දු\n\nජීවිතයේ\n\nචන්ද්‍රදාස ප්‍රනාන්දු\n\nවික්ටර් රත්නායක\n\nසිහින නගරයේ\n\nචන්ද්‍රදාස ප්‍රනාන්දු\n\nවික්ටර් රත්නායක\n\nMage puthanuwane\n\nඅශෝක කෝවිලගේ\n\nජෝර්ජ් ලෙස්ලි රණසිංහ\n\nනිරිඳෙක් වී\n\nචන්ද්‍රදාස ප්‍රනාන්දු\n\nටී.එම්. ජයරත්න\n\nතන පින්නේ\n\nප්‍රියානන්ද විජේසුන්දර\n\nටී.එම්. ජයරත්න\n\nසිහින තුසිතය\n\nස්වර්ණ ශ්‍රී බණ්ඩාර\n\nටී.එම්. ජයරත්න\n\nකඳුළු ඉවරකර\n\nසිද්ධාර්ථ හාමුදුරුවෝ\n\nරෝහණ බෝගොඩ\n\nEdawage mathu\n\nප්‍රියානන්ද විජේසුන්දර\n\nඅමරසිරි මුණසිංහ\n\nMee Thula mee peni\n\nප්‍රියානන්ද විජේසුන්දර\n\nඅමරසිරි මුණසිංහ\n\nවියෝ දුකින්\n\nතිලකා කළුආරච්චි\n\nඅයේෂා ගුණසේකර\n\nමහමෙර සේ අපේ අම්මා\n\nතිලකා කළුආරච්චි\n\nනීතා වික්‍රමතන්ත්‍රිගේ\n\nබලකාලේ\n\nසිද්ධාර්ථ හාමුදුරුවෝ\n\nකපිල හේරත්\n\nAyeth dawasaka\n\nආනන්ද හේවරන්හිඳගේ\n\nකපිල හේරත්\n\nඅඩසඳ නිවිල\n\nසුනිල් ආර්.ගමගේ\n\nකපිල හේරත්\n\nපහන්කාල සඳ\n\nආනන්ද හේවරන්හිඳගේ\n\nකපිල හේරත්\n\nකඳුලුසුරේ\n\nසුනිල් ආර්.ගමගේ\n\nකපිල හේරත්\n\nඇතා හිමලේ\n\nසිද්ධාර්ථ හාමුදුරුවෝ\n\nකුමා අතානායක\n\nනිවන් දකින\n\nමහින්ද දිසානායක\n\nකුමා අතානායක\n\nහදවතක්\n\nසිද්ධාර්ථ හාමුදුරුවෝ\n\nක්‍රිෂාන්ත එරන්දක\n\n ඒක පුද්ගල ප්‍රසංගය\n\n2012 දී වික්‍රමසිංහ සිය සංගීත දිවියේ 45 වැනි සංවත්සරය නිමිත්තෙන් \"මාස්ටර් සර්\" නමින් ඒක පුද්ගල ප්‍රසංගයක් ආරම්භ කළාය.\n\n සමාජ ක්රියාකාරකම්\n\nමව් සංවිධානය\n\n2002 දී වික්‍රමසිංහ \"ද මදර්\" නමින් පුණ්‍යායතනයක් ආරම්භ කළේ ක්ෂේත්‍රයට ජීවිත කාලය පුරාම දායකත්වයක් ලබා දුන් දරුවන්, වැඩිහිටියන් සහ කලාකරුවන්ට ආහාර සැපයීමේ අරමුණ ඇතිවය. සංවිධානයේ සභාපතිනිය ඇයයි\n\nපෝලියෝ රෝගය තුරන් කිරීමට සහාය වීම\n\n1989 අපේ රටින් පෝලියෝ රෝගය තුරන් කර දරුවන් බේරා ගැනීමේ යුනිසෙෆ් ව්‍යාපෘතියට වික්‍රමසිංහ සහභාගි වූවාය. මේ සඳහා නිර්මාණය කළ ගීතයක් ඇය ගායනා කළ අතර එය ගුවන් විදුලි නාලිකා සහ රූපවාහිනී නාලිකා ඔස්සේ නිතර අසන්නට ලැබිණි. මෙම ව්‍යාපාරය හරහා පෝලියෝ රෝගය තුරන් කිරීමට ඇයගේ උත්සාහය බෙහෙවින් ඉවහල් වූ අතර 2000 වන විට පෝලියෝ රෝගියෙකු හෝ වාර්තා වී නොමැත.\n\n සම්මාන\n\nඇය තෙවරක් සරසවිය සම්මානය, ජනාධිපති සම්මානය, සුමති ටෙලි සම්මානය, සොන්ටා සම්මානය සහ වනිතා සම්මානය දිනාගෙන ඇත.\n\nඅවුරුදු\n\nශීර්ෂය\n\nසම්මානය\n\nනිෂ්පාදනය\n\nසිංදුව\n\nගී පද\n\nසංගීතය\n\n1984\n\nසරසවිය හොඳම පසුබිම් ගායිකාව\n\nසරසවි\n\nඇතින් එතනට\n\nබෝධියේ විහාරයේ\n\nඅජන්තා රණසිංහ\n\nසරත් දසනායක\n\n1986\n\nසරසවිය හොඳම පසුබිම් ගායිකාව\n\nසරසවි\n\nදොළොස්මහේ පහන\n\nරස මුසුවූ පෙම් කල්පනා\n\nකේ.ඩී.කේ. ධර්මවර්ධනය\n\nප්‍රේමසිරි කේමදාස\n\n1992\n\nසරසවිය හොඳම පසුබිම් ගායිකාව\n\nසරසවි\n\nදොළොස්මහේ පහන\n\nපේමකසුවන්ද දෙනිලා\n\nයාපා බී සෙනෙවිරත්න\n\nග්‍රේෂන් ආනන්ද\n\n1996\n\nහොඳම ටෙලිනාට්‍ය ගායකයා\n\nසුමති සම්මාන\n\nසංක්‍රාන්ති සමය\n\nනොතලන් මල්කැකුළු"
    },
    {
        "name": "සී ටී ප්‍රනාන්දු",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1921 ජනවාරි 28, ශ්‍රී ලංකාව, ශ්‍රී ලංකාව",
        "Death": "1977 ඔක්තෝබර් 21\n\n(වයස අවුරුදු 56)",
        "Star sign": "කුම්භ ලග්නය",
        "Instruments:": "හඬ",
        "description": "සිරිල් ටියුඩර් ප්‍රනාන්දු\n\n (සිංහල: සිරිල් ටියුඩර් ප්‍රනාන්දු), ලෙස හැඳින්වේ\n\nසී.ටී.ප්‍රනාන්දු\n\n (සිංහල: සී. ටී. ප්‍රනාන්දු) (ජනවාරි 28, 1921 - ඔක්තෝබර් 17, 1977), ශ්‍රී ලංකාවේ ජනප්‍රිය සිංහල ගායකයෙකි. ඔහු සංගීත ක්ෂේත්‍රයට පිවිසියේ 1940 දශකයේදීය. \"වන බමරු\", \"බිලින්ද නෙල්වා උකුලේ\" සහ \"රෝස මලේ\" වැනි ඔහුගේ ගීතවල තේමා සහ වචන සඳහා ඔහු විචාරකයන්ගේ පැසසුමට ලක් විය. \"ලෝ අඩ නින්දේ\", \"ගිලේ මලේ තරුව\" සහ \"මරිය මව් කුසේ\" ඔහුගේ අනෙකුත් ජනප්‍රිය ගීත වේ.\n\nචරිතාපදානය මුල් ජීවිතය සහ වෘත්තියC.T. මොරටුව කඩලාන ප්‍රදේශයේ උපත ලබා නාවල්පිටිය ශාන්ත මරියා විද්‍යාලයෙන් අධ්‍යාපනය ලැබුවා. ශිෂ්‍යයෙකු ලෙස සී.ටී. පාසලේ නාට්‍යවලට සහභාගි වෙමින් ප්‍රදේශයේ පල්ලියේ ගායක ගායිකාවන් සමඟ ගායනය කරමින් කලාව කෙරෙහි උනන්දුවක් දැක්වීය. C.T.Fernando බොහෝ විට කථික රන් පදක්කමක් ඇතුළු කථිකත්වය, ගායනය සහ නාට්‍ය සඳහා ත්‍යාග දිනා ගත්තේය. ඔහු ඔහුගේ ප්‍රාදේශීය පල්ලියේ ගායන ශිල්පියෙකු වූ අතර පසුව A.R.P හි ගායන ගුරුවරයා බවට පත්විය. 1942 සහ 1965 අතර කොළඹ මැසෙන්ජර් සේවය. පසුව ඔහු දෙවන ලෝක යුද්ධයට සම්බන්ධ වූ භට පිරිස් විනෝදාස්වාදය සඳහා Grand Cabaret ට සම්බන්ධ වූ අතර ඔහුගේ සංගීත කුසලතාවයන් තවදුරටත් වර්ධනය කර ගත්තේය.\n\nප්‍රනාන්දු 1946 දී රේඩියෝ සිලෝන් හි පළමු ශ්‍රේණියේ ගුවන්විදුලි ශිල්පියෙකු ලෙස තනතුරක් සඳහා සාර්ථකව විගණනය කළේය. එහිදී ඔහු සිය ප්‍රථම ජනප්‍රිය ගීතය වූයේ \"පින් සිඳු වන්නෙ\" සමඟින්, කුරුල්ලන්ට හානි කිරීම නවත්වන ලෙස දරුවන්ට කරන ආයාචනයකි. ගීතය ලිව්වේ R. N. H. පෙරේරා.\n\nවාණිජ කලාකරුවා 1952 දී ප්‍රනාන්දු HMV අනුබද්ධිත Cargills සමාගම සමඟ ගිවිසුම් අත්සන් කරමින් වාණිජ කලාකරුවෙකු ලෙස ශාඛාවක් ලබා ගත්තේය. \"පින්සිදුවන්නෙ\", \"සුවඳ රෝස\", \"බර බාගේ\", \"ඇඹිලිමාමේ\", \"ලෝ අඩ නින්දේ\", \"ගිළිමලේ තරුව\", \"කිමද සුමිහිරියේ\", \"අඹ රුක්\" ඇතුළු ඔහුගේ ජනප්‍රිය ගීත රැසක් ඔහු ලේබලය සමඟ පටිගත කළේය. \"බිලින්ද නැලවේ උකුලේ\".\n\n1959 සිට 1960 දක්වා ප්‍රනාන්දු මෙරට ජනප්‍රියම ගායකයා ලෙස ඇගයීමට ලක් විය. ලුවිස් බ්‍රවුන් සමාගම සමඟින් LP \"The Golden Voice of CT Fernando\" පටිගත කරමින් ඔහු සිය පටිගත කිරීමේ ජීවිතය දිගටම කරගෙන ගියේය. \"හෙළ ජාතික අභිමානේ\", \"මා බල කාලේ\", \"සන්ධාවට රන් තරු\", \"අනේ දිනක්\", \" වැනි ජනප්‍රිය ගීත. පියුමෙහි පැණි බොති\",\"රුක්මණී දේවි සමගින් යුගලයක් වූ පුන්සාද හීනෙහෙන්නේ\", \"සිහින ලොවේ\", \"අවධිවන්න\" සහ \"මගේ සුදු මාමේ\" මෙම ඇල්බමයට ඇතුළත් විය. ඇල්බමයේ මෙම ගීත සඳහා මුල් සංගීත සැකැස්ම සහ අධ්‍යක්ෂණය මියුසික් ලෙජන්ඩ් පැට්‍රික් දෙනිපිටිය විසින් සිදු කරන ලදී. මෙම පටිගත කිරීම් ලලිත් එස් මෛත්‍රීපාල, කරුණාරත්න අබේසේකර, සරත් විමලවීර සහ විමලදාස පෙරේරා යන අයගේ ගී පද රචනා කර ඇත.\n\nඔහුගේ සමහර ගීත සඳහා සංගීතය B.S.පෙරේරා සහ පැට්‍රික් දෙනිපිටියට අමතරව ප්‍රනාන්දු විසින්ම රචනා කරන ලදී.\n\nප්‍රනාන්දු විසින් ජනප්‍රිය යුගලයක් වන \"පුන් සඳ හිනැහේනේ\" පටිගත කරන ලදී\n\nරුක්මණී දේවි\n\n. තවත් යුගලයක් වූ \"සැලලිහිණි කොවුල් හඬ\" ලතා වල්පොල සමඟ කළා. ඔහුගේ බොහෝ යුගල ගීත රුක්මණී දේවි සහ ලතා වල්පොල මෙන්ම චන්ද්‍රා ද සිල්වා සමඟ ගායනා කරන ලදී. C.T.Fernando විසින් අධ්‍යක්ෂණය කරන ලද දෙයියන්ගේ රටේ සහ ගම්පෙරළිය වැනි සිංහල චිත්‍රපට කිහිපයක ද රඟපෑවේය.\n\nලෙස්ටර් ජේම්ස් පීරිස්\n\n. 1967 වසරේ මාස 6ක කාලයක් තුළ UK,France,Italy,Switzerland,Spain සහ අනෙකුත් යුරෝපයේ ගමනාන්තයන්හි විවිධ ස්ථානවල ප්‍රසංග පවත්වමින් සංගීත අධ්‍යක්ෂක \"Patrick Denipitiya and his Combo\" සමඟ විදේශගත වූ ප්‍රථම ශ්‍රී ලාංකික කලාකරුවා ඔහුය.\n\nTrack listingDeath and legendC.T.Fernando 1977 ඔක්තෝම්බර් 17 වන දින හෘදයාබාධයකින් මිය යන විට වයස අවුරුදු 56 දී C.T.ගේ පුත් ප්‍රියන්ත ප්‍රනාන්දු වසර හතළිහකට වැඩි කාලයක් තම පියාගේ ගීත ගායනා කළේය. වකුගඩු අකර්මණ්‍ය වීමෙන් පීඩා විඳි ප්‍රියන්ත ද 2018 මැයි 1 වැනිදා වයස අවුරුදු 65 දී මිය ගියේය."
    },
    {
        "name": "ග්‍රේටියන් ආනන්ද",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1957 මාර්තු 11, තංගල්ල, ශ්‍රී ලංකාව",
        "Death": "2010 දෙසැම්බර් 29\n\n(වයස අවුරුදු 53)",
        "Star sign": "මීන",
        "description": "ග්‍රේටියන් ආනන්ද\n\n (සිංහල:\n\nග්රේෂන් ආනන්ද\n\n; 11 මාර්තු 1957 - 29 දෙසැම්බර් 2010), ලෙසද\n\nග්රේෂන් ආනන්ද\n\n හෝ\n\nග්‍රේෂන් ආනන්ද\n\n, ශ්‍රී ලාංකික ගායකයෙක්, තනු නිර්මාපකයෙක්, ගීත රචකයෙක් සහ ගී පද රචකයෙක් විය. ප්‍රවීණ කලාකරු දිවංගත එච්.ආර්. ජෝතිපාල මහතාගෙන් පසු මෙරට බිහි වූ හොඳම සිංහල චිත්‍රපට සංගීතඥයා ලෙස සැලකෙන ආනන්ද, දශක තුනකට ආසන්න කාලයක් පුරා දිව ගිය සංගීත දිවියක් සමඟින් චිත්‍රපට 400කට අධික සංඛ්‍යාවකට ගායනා කළේය.\n\nඔහු කොළඹ ජාතික රෝහලේ ප්‍රතිකාර ලබමින් සිටියදී වයස අවුරුදු 52 දී මිය ගියේය.\n\nපුද්ගලික ජීවිතය ඔහු 1957 මාර්තු 11 වන දින සංගීතයේ ගිලී සිටි පවුලක උපත ලැබීය. ඔහුගේ සීයා බ්‍රිගේඩියර් චාලි ජයවර්ධන අමදෝර් රාජකීය හමුදාවේ සේවය කළ කීර්තිමත් සංගීතවේදියෙකි. ඔහුගේ මව පියානෝ වාදකයෙකි. ප්‍රාථමික අධ්‍යාපනය සඳහා උපන් ගම වන තංගල්ලට ගිය පසු ඔහු සිය මුල් ළමාවිය මහනුවර ගත කළේය. ඔහු පාසල් 10කට පමණ අධ්‍යාපනය ලැබිය. ඔහු මුලින්ම ගියේ තංගල්ල පුංචි මල් කන්‍යාරාමයට පසුව දෙමටගොඩ ශාන්ත මැතිව් විද්‍යාලයට. ඉන්පසු ඔහු කොළඹ ශාන්ත ජෝශප් විද්‍යාලයෙන් උසස් පෙළ විභාගය සම්පූර්ණ කළේය.\n\nකොළඹ කොච්චිකඩේ ශාන්ත අන්තෝනි දෙව්මැදුරේ අඟහරුවාදා දේව මෙහෙය කිසි විටෙක අතපසු නොකළ ඔහු කැප වූ කතෝලිකයෙකි. පූජ්‍ය ජෝන් හේරත් ඕඑම්අයි පියතුමා විසින් බොරැල්ලේ සියලුම සාන්තුවරයන්ගේ දේවස්ථානයේ ගායන ශිල්පියෙකු ලෙස ඔහු තම සංගීත හැකියාව ඔපවත් කළේය.\n\nශ්‍රීමා අබේකෝන් සමඟ විවාහ වූ ඔහුට දුලාංජලී චාතුර්‍යා ආනන්ද නම් එක් දියණියක් සහ මාරියෝ ඇන්ජලෝ ආනන්ද නම් පුතෙක් සිටී. ඔහුගේ පුත් මාරියෝ ආනන්ද 1991 මැයි 12 වන දින උපත ලැබූ අතර පියාගේ පාසල වන ශාන්ත ජෝසප් විද්‍යාලයෙන් අධ්‍යාපනය සම්පූර්ණ කළේය. ඔහු ග්‍රේටියන්ගේ මරණයෙන් පසු ඔහුගේ උරුමය දිගටම කරගෙන යාමට සංගීත ජීවිතය ආරම්භ කළේය.\n\nගායන දිවිය ආනන්ද වයස අවුරුදු 3 සිට Mooth Organ වාදනය කිරීමට පටන් ගත්තේය. ඔහුගේ සංගීත හැකියාව මුලින්ම හඳුනාගනු ලැබුවේ පාසලේ සංගීත ගුරු ගරු ජෝන් හේරත් පියතුමා විසිනි, එහිදී ආනන්ද හොරණෑව වාදනය කිරීමට පටන් ගත් අතර පසුව යතුරුපුවරුව වාදනය කිරීමට පටන් ගත්තේය. ඔහු ලාල් පෙරේරා සහ ක්ලෝඩ් ප්‍රනාන්දු යටතේ පියානෝව පුහුණු විය. ඉන්පසු ඔහු ලන්ඩනයේ රාජකීය සංගීත විද්‍යාලයෙන් බටහිර සංගීතය පිළිබඳ ඩිප්ලෝමාවක් ලබා ගත්තේය.\n\n1976 දී ආනන්ද ස්ටැන්ලි පෙරේරාගේ විවිධ සංගීත කණ්ඩායම් යටතේ වාදනය කිරීමට පටන් ගත්තේය\n\nවාසනාව\n\n, එය ඔහුගේ හැරවුම් ලක්ෂය බවට පත් විය. එම කාලය තුළ සංගීතවේදී සරත් දසනායක හමුවී ඔහුගේ වාද්‍ය වෘන්දයට ගිටාර් වාදනය කිරීමට සම්බන්ධ විය. වාද්‍ය වෘන්දය තුළ ඔහු මුලින්ම ගිටාරය වාදනය කළේය\n\nඑච්.ආර්.ජෝතිපාල\n\nගේ\n\nටජ් මහලක්\n\n සිංදුව. ඔහුගේ අතිශය සංගීත කුසලතාවයෙන් ඔහු වාද්‍ය වෘන්දයේ සහකාර සංගීත අධ්‍යක්ෂක තනතුර දක්වා උසස් කරනු ලැබුවා. සරත් දසනායක සහ මර්වින් පෙරේරා යටතේ ඔහු ශාස්ත්‍රීය පෙරදිග සංගීතය ඉගෙනීමට පටන් ගත්තේය.\n\nපසුව, ඔහු ඇතුළු බොහෝ සංගීත කණ්ඩායම්වල ලීඩ් ගිටාර් වාදකයා ලෙස කටයුතු කළේය\n\nසිහින දකින්නන්\n\n,\n\nඅර්නස්ට් සහ කොම්බෝ\n\n,\n\nසුපර්සෙට්\n\n හා\n\nමුහුදු\n\n වසර ගණනාවක් තිස්සේ. ඔහුට ගිටාර් වාදකයෙකු ලෙස වාදනය කිරීමට ද ආරාධනා කරන ලදී\n\nවික්ටර් රත්නායක\n\nගේ\n\nSA ප්‍රසංගය\n\n.\n\nඔහු සිය පළමු කැසට් පටය නිකුත් කළේ 1978 දීය. ආනන්ද සමඟ එක්ව ගායනා කිරීමට හැකි විය\n\nනීලා වික්‍රමසිංහ\n\n 1978 දී තැටියක් සඳහා. ඔහුගේ පළමු LP වාර්තාවේ ගීත හතරක් අඩංගු වූ අතර සියලුම ගීත සංගීතමය වශයෙන් ග්‍රේෂන් විසින්ම රචනා කර ඇත. ඒ ගීතයත් එක්ක\n\nAtha Duraka Detha Pawela\n\n, ආනන්දට චිත්‍රපට පසුබිම් ගායකයෙක් ලෙස ගී ගයන්න ආරාධනා ලැබුණා. ඔහුගේ මංගල පසුබිම් ගායනය සිදු වූයේ සේන සමරසිංහගේ චිත්‍රපටිය හරහාය\n\nමල් කැකුළු\n\n යුගලය වුවත්\n\nBindu Bindu Kandulu Gala\n\n ශ්‍යාමි ෆොන්සේකා එක්ක. චිත්‍රපටයෙන් පසුව, ඔහු සිංහල සිනමාවට සිය දැවැන්ත දායකත්වය දිගටම ලබා දුන් අතර එහිදී ඔහු චිත්‍රපට 400 කට වැඩි ප්‍රමාණයකට ගීත ගායනා කළේය.\n\n2004 දී ඔහු ප්‍රසංගයක් සමඟ සංගීතයට වසර 25 ක් සැමරීය\n\nආනන්ද රාත්රිය\n\n BMICH හිදී සැප්තැම්බර් 25 සවස 6.00 ට. ප්‍රසංගයේ DVD තැටිය Torana Music Box සන්නාමය සමඟින් 2005 දී නිකුත් කරන ලදී. මෙම DVD තැටිය ආනන්ද විසින් ගායනා කරන ලද ජනප්‍රිය ගීත 20 කින් සමන්විත වේ.\n\nඔහුගේ අවසන් ගීත ඇල්බමය විය\n\nදේශිතක ගී\n\n නව ගීත 12ක් සමඟින් 2007 වසරේ නිෂ්පාදනය කරන ලදී. 2009 දී, ඔහු පෙබරවාරි 14 වන දින පෙ.ව. 9 ට නාමෙල් මාලිනී පුංචි තියටර්හිදී සංයුක්ත තැටියක් එළිදැක්වීය. මෙම සංයුක්ත තැටිය ගායනා කරන ලද ගීත 23 කින් සමන්විත වේ\n\nආනන්ද රාත්රිය\n\n සහ ඔහුගේ පුත් මාරියෝ ද දියත් කරන ලදී\n\nගයනා ගයුම්\n\n එකම දිනයේ ධාවන පථ 16 කින් සමන්විත විය.\n\nසංගීත අධ්‍යක්ෂණය ඔහු ගීත සඳහා සංගීතය නිර්මාණය කිරීමට පටන් ගත්තේය\n\nEtha Duraka Etha Pawela\n\n තමා සහ නීලා වික්‍රමසිංහ විසින් සහ\n\nටෙදිනි විරාජා\n\n විසින්\n\nඑඩ්වඩ් ජයකොඩි\n\n. ගීත දෙකම ජනප්‍රිය ජනප්‍රිය ගීත බවට පත් වූ අතර එහිදී K.A.W පෙරේරා තම චිත්‍රපටිය සඳහා සංගීත අධ්‍යක්ෂණය කිරීමට ආනන්දට ආරාධනා කළේය\n\nදුර්ගා\n\n. වැනි චිත්‍රපට 16කට පමණ ඔහු එම චිත්‍රපටිය සමඟ සංගීත අධ්‍යක්ෂණය කළේය\n\nධවල පුෂ්පය\n\n,\n\nරන්දෙණිගල සිංහයා\n\n,\n\nසිංහ පටවු\n\n,\n\nහායි මාස්ටර්\n\n හා\n\nහිත හොන්ඩා ගහෙනියක්\n\n.\n\nඔහු රූපවාහිනී කතාමාලාවලටද සංගීතය නිර්මාණය කළේය. නමුත් ඔහුගේ මුල්ම ටෙලි නාට්‍ය සංගීතය ආවා\n\nගමන\n\n හා\n\nප්‍රේමද වේඩි\n\n, දෙකම K.A.W පෙරේරා විසිනි.\n\nගේය පද රචකයෙකු වූ ආනන්ද තම සහෝදර කලාකරුවන් සඳහා තනු නිර්මාණය කළ නිසා සමහර ඒවා ඉතා ජනප්‍රිය විය. ඔහුගේ සමහර ගී පද ඇතුළත් වේ\n\nMage Punchi Kumari\n\n හා\n\nMage Athita Diviya\n\n (ලිව්වේ මහා නළු සනත් ගුණතිලක විසිනි) සඳහා\n\nමිල්ටන් මල්ලවාරච්චි\n\n,\n\nආරාධනා නෙතු චායා\n\n හා\n\nසුදු රෝස මල්\n\n සඳහා\n\nප්‍රියා සූරියසේන\n\n,\n\nමංගල්ලේ මල්\n\n සඳහා\n\nචන්ද්‍රලේඛා පෙරේරා\n\n,\n\nසඳලතා\n\n සඳහා\n\nසනත් නන්දසිරි\n\n.\n\n2010 දෙසැම්බර් 22 වන දින, අක්මාව අකර්මණ්‍ය වීම ඇතුළු රෝග ගණනාවකට ප්‍රතිකාර ලබා ගැනීම සඳහා ආනන්ද රෝහල් ගත කරන ලදී.\n\n2010 දෙසැම්බරයේදී ආනන්ද කොළඹ ජාතික රෝහලේ වෛද්‍ය ප්‍රතිකාර ගනිමින් සිටියදී වයස අවුරුදු 52 දී මිය ගියේය. බොරැල්ල කනත්තේදී දේහය ආදාහනය කළා. ඔහු දැඩි සත්කාර ඒකකයේ (ICU) ප්‍රතිකාර ලබමින් සිටියදී පෙරවරු 6.45 ට මියගිය බව රෝහල තහවුරු කළේය.\n\nපසුධාවන ගායනය චිත්‍රපට ග්‍රැෆික් ට්‍රැක් ලැයිස්තු සෝලෝ ට්‍රැක්ස් ඩුවට්ස්"
    },
    {
        "name": "රුක්ෂාන් පෙරේරා",
        "info": "ගායකයා",
        "Intro": "ගායකයා",
        "Is": "ගායකයා\n\nගීත රචකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1956 ජූනි 17",
        "Age": "අවුරුදු 65 යි",
        "description": "රුක්ෂාන් පෙරේරා, ශ්‍රී ලංකාවේ උපත ලද ගායකයෙක්-ගීත රචකයෙක්, තැටි නිෂ්පාදකයෙක්, ජාත්‍යන්තර පටිගත කිරීම්, රූපවාහිනී තරුවක් සහ බහු වාදකයෙකි. චරිතාපදානය\n\n රුක්ෂාන් පෙරේරා ගියේ කොළඹ රාජකීය විද්‍යාලයට.\n\nඔහු උපත ලැබුවේ කොළඹ සංගීත පවුලක ය. රුක්ෂාන් වයස අවුරුදු පහේදී සිය පළමු පියානෝ පාඩම ඉගෙන ගත්තේ වසර පනහක් මොරටුවේ ප්‍රසිද්ධ සංගීත ගුරුවරියක්/පල්ලි ඕගන් වාදකයෙක් වූ ඔහුගේ මවගෙනි. රුක්ෂාන් ස්වයං-ඉගැන්වූ ගිටාර් වාදකයෙකු බවට පත් වූ අතර වයස අවුරුදු දහයේදී ඔහුගේ පළමු පවුලේ සංගීත කණ්ඩායම පිහිටුවා රේඩියෝ සිලෝන් හරහා ඉදිරිපත් කළේය. ඔහු අධ්‍යාපනය ලැබුවේ කොළඹ රාජකීය විද්‍යාලයෙන්. නව යොවුන් වියේ සංගීත ian යෙකු ලෙස, රුක්ෂාන් පෙරේරා රාජකීය විද්‍යාලයේ පාසල් සිසුවෙකු ලෙස සිටියදී යතුරුපුවරු වාදකයෙකු ලෙස කණ්ඩායමකට සම්බන්ධ වූ අතර, ශ්‍රී ලංකාවේ 'පොප් රජු' ක්ලැරන්ස් විජේවර්ධන සහ ඔහුගේ සහකරු ඇනස්ලි මාලේවනගේ ඉදිරියෙන්. ‘සුපර් ගෝල්ඩන් චයිම්ස්’ නමින් හැඳින්වෙන කණ්ඩායම ශ්‍රී ලංකාවේ සාර්ථකත්වයේ හිනිපෙත්තටම ළඟා විය. 'සුපර් ගෝල්ඩන් චයිම්ස්' ගුවන්විදුලි සිලෝන්හි ගුවන් තරංග හරහා නිරන්තර විකාශනයට ලක් වූ අතර පසුව ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාව ඔවුන් දිවයිනේ සහ දකුණු ආසියාව පුරා ජනප්‍රිය නම් බවට පත් කළේය. ඔහු ද එස්කුවර් සෙට්, සෙරන්ඩිබ් සහ 'ගෝල්ඩන් චයිම්ස්' කණ්ඩායම සමඟ ද ක්‍රීඩා කර ඇත. රුක්ෂාන් ගිටාරය, හාර්මොනිකා, පියානෝ සහ තවත් සංගීත භාණ්ඩ කිහිපයක් වාදනය කරයි. ශ්‍රී ලංකාවේ සන්ඩේ ටයිම්ස් පුවත්පත සඳහන් කළේ 'රුක්ෂාන් පෙරේරා යනු අතිදක්ෂ, ඉහළ පළපුරුදු සහ උමතු දක්ෂ සංගීතඥයෙක්' බවයි. රුක්ෂාන් පෙරේරා යනු 'සිංහල ඇකැපෙලා' ද ප්‍රගුණ කර ඇති සුප්‍රසිද්ධ ජෑස් කලාකරුවෙකි. කොළඹ සන්ඬේ අයිලන්ඩ් පුවත්පත නිරීක්ෂණය කළේ ඔහුගේ (සංගීත) ප්‍රසංගය පොප්, ජෑස්, බ්ලූස් සිට ෆියුෂන් සහ කැපෙල්ලා, ප්‍රසංග සහ බහු වාදකයෙකු වූ අතර, ඔහු ගිටාර්, පියානෝ, නළාව සහ හාර්මොනිකා වාදනය කරමින් ප්‍රේක්ෂකයින් කුල්මත් කළේය. .' ඔහු දශක තුනකට ආසන්න කාලයක් එක්සත් ජනපදයේ ජීවත් විය. රුක්ෂාන් සංගීතයෙන් විවේකයක් ගෙන, ශාස්ත්‍රීය වෘත්තියකට යොමු විය, තොරතුරු පද්ධති පිළිබඳ උපාධියක් ලබා, ව්‍යාපාර පරිපාලනය පිළිබඳ ශාස්ත්‍රපති උපාධියක් ද ලබාගෙන, පාරිභෝගික නිෂ්පාදන සමාගමක් වන පිලිප් මොරිස් සමඟ තොරතුරු තාක්ෂණ කළමනාකරුවෙකු ලෙස සම්බන්ධ විය.\n\nපිලිප් මොරිස්ගේ අනුග්‍රහයෙන් නිව් යෝර්ක් හි පැවති ප්‍රසංගයක දී ඔහු සුප්‍රසිද්ධ ජෑස් නම් සමඟ වාදනය කළේය. ඔහු එකම ආධුනිකයා වූ අතර ඔහු ගෞරවාන්විතව දිවි ගලවා ගත් අතර පසුව ශ්‍රී ලාංකික බාස් වාදක හුසේන් ජිෆ්රි සමඟ ප්‍රසංගයක් ඇතුළුව ප්‍රසංගයක් ඉදිරිපත් කළේය. 1980 වසරේ සිට අමෙරිකාවේ ජීවත් වූ රුක්ෂාන් පෙරේරා යළි උපන් බිමට පැමිණීමට තීරණය කළේය. රුක්ෂාන් පෙරේරා සීඩී ඇල්බම් දෙකක් පටිගත කර ශ්‍රී ලංකාවේ සහ ඇමරිකා එක්සත් ජනපදය ඇතුළු ලොව පුරා 'සජීවී' ප්‍රසංග පවත්වා ඇත. වෙන කොහේවත් නොදැකපු 'harmony whisle' සහ 'harmony scatting' ද ඔහු හඳුන්වා දී ඇත. තනුව සහ සුසංයෝගය එකට විස්ල් කිරීම රුක්ෂාන්ගේ දුර්ලභ හැකියාවක් වන අතර ඒ සඳහා ඔහුගේ නම ගිනස් වාර්තා පොතට පවා ඔහුගේ රසිකයන් විසින් යෝජනා කර ඇත.\n\n ඩිස්කෝග්‍රැෆි\n\nකේවල\n\n\"ඔබ වෙත ගෙදර එනවා\"\n\n\"සමනලයෙක් වගේ දැනෙනවා\"\n\n\"මම දිගටම සටන් කරන්නම්\"\n\n\"ඔබ වෙනුවෙන් පමණයි\"\n\n\"ඉතිහාසය කරමු\"\n\n\"සොබාදහමේ කැඳවීම\"\n\n\"සැමට එක ඉඩමක්\"\n\n\"යථාර්ථය\"\n\n\"යමක් සිදුවෙමින් පවතී\"\n\n\"ශ්‍රී ලංකා බ්ලූස්\"\n\n\"වේලාව කීයද?\"\n\nඇල්බම\n\nඔබ වෙත නිවසට පැමිණේ\n\nරුක්ෂාන් පෙරේරා - Live In Concert"
    },
    {
        "name": "ප්‍රියා සූරියසේන",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1952 ඔක්තෝබර් 27",
        "Age": "අවුරුදු 69 යි",
        "description": "ප්‍රියා සූරියසේන යනු 1972 දී ශ්‍රී ලංකා ගුවන් විදුලි සංස්ථාව (SLBC) හරහා සිය සංගීත දිවිය ආරම්භ කළ ශ්‍රී ලාංකේය ජනප්‍රිය ගායිකාවක් සහ සංගීතය පිළිබඳ කථිකාචාර්යවරියකි.\n\nඑම්.එල්.ඩී. ප්‍රියදර්ශ සූරියසේන ලියනගේ උපත ලැබුවේ ශ්‍රී ලංකාවේ පුත්තලම දිස්ත්‍රික්කයේ නාත්තන්ඩිය ප්‍රදේශයේ උඩරට මධ්‍යම පාන්තික පවුලක දෙමාපියන්ට දාවය. ඔහුගේ පියා දිවංගත එම්.එල්.ඩී ජෙමිස් ලියනගේ වන අතර මව නැසීගිය ඒ.එම්. පොඩි මැණිකේ. ඔහු තිදෙනෙකුගෙන් යුත් පවුලක එකම පුත්‍රයා විය. ඔහු නාත්තන්ඩිය ප්‍රාථමික විද්‍යාලයෙන් මූලික අධ්‍යාපනය ලබා ඇති අතර පුත්තලම දිස්ත්‍රික්කයේ මාදම්පා මධ්‍ය මහා විද්‍යාලයෙන් අපොස සා/පෙළ සහ උසස්පෙළ සම්පූර්ණ කළේය.\n\nඔහුගේ පියා කවියෙකු වූ අතර ඔහුගෙන් ඔහුගේ සංගීත හැකියාව ලැබුණි. සූරියසේන ශිෂ්‍යයෙකු ලෙස යුනෙස්කෝ කුසලතා තරඟය වැනි සංගීත වැඩසටහන් වලට සහභාගී වීමෙන් පසු ත්‍යාග කිහිපයක් දිනා ගත් අතර එහිදී ඔහු පළමු ස්ථානය දිනා ගත්තේය.\n\nඋසස් පෙළට පසුව 1968 සිට 1971 දක්වා ඔහු ‘හේවුඩ්’ රජයේ සංගීත විද්‍යාලයෙන් පවත්වන බාහිර විභාගවලට පෙනී සිට සංගීතය පිළිබඳ ඩිප්ලෝමාවක් ලබා ගත්තේය. පසුව ඔහු සංගීත ගුරුවරයෙකු ලෙස සිය වෘත්තීය ජීවිතය ආරම්භ කළ අතර 1972 දී SLBC හි විකාශය වූ ඔහුගේ මුල් ගීත කිහිපයක් පටිගත කළේය. මෙම අවස්ථාවෙහිදී ඔහු ශ්‍රී ලංකාවේ මෝටර් රථ ධාවන ශූර ප්‍රියා මුණසිංහගේ ආභාසය ඇතිව ප්‍රියදර්ශ යන නම \"ප්‍රියා\" ලෙස කෙටි කළේය.\n\n කීර්තියට නගිනවා\n\nඔහුගේ පළමු ගීත හතර එළිදැක්වීමෙන් පසු සූරියසේන 1970 දශකයේ තරුණයින්ගේ හද ගැස්ම බවට පත් විය. ඔහුගේ පළමු ගීත හතර ('සරතස නිව', 'මත වසන', 'හෙට දවසේ' සහ 'අඳුර අඳුර මගේ') 1972 දී SLBC සඳහා පටිගත කරන ලදී. 'අඳුර අඳුර මගේ' ලිව්වේ රෝහණ ප්‍රනාන්දු සහ 'හැට දවසේ', අභාවප්‍රාප්ත ප්‍රවීණ ගී පද රචක ප්‍රේමකීර්ති ද අල්විස්ගේ 'සරතස නිව' සහ 'මත වසන', සංගීතය සූරියසේනගේම විය.\n\n\"සුදු පරෙවි රෑන\" (හිට් ගීතය) එළිදැක්වීම සූරියසේන 1970 දශකයේ ප්‍රමුඛ පෙළේ ගායකයෙකු දක්වා ගෙන ආවේ ශ්‍රී ලංකා රජය විසින් එම ගීතය ගුවන්විදුලි නාලිකා හරහා කාලයක් ප්‍රචාරය කිරීම තහනම් කළ අවස්ථාවේ ආන්දෝලනයක් ඇති කරමිනි.\n\nසූරියසේන ශ්‍රී ලංකාවේ පළමු සංගීත ශ්‍රව්‍ය කැසට් පටයක් තරංගා ලේබලය යටතේ විජේවර්ධනගේ මඟපෙන්වීම යටතේ නිකුත් කළේය. 1984 දී සේන සමරසිංහගේ එතනින් එහාට (චිත්‍රපටයේ) ගීතයක් වන \"කැන්දන් යන්නම්\" සඳහා වූ සරසවිය සම්මානයත් සමඟ ඔහුගේ ජනප්‍රියත්වය ඉහළ ගියේය.\n\n1996 වසරේ “සන්ෆ්ලවර්ස් විත් ප්‍රියා” ඇල්බමය සමඟින් රුපියල් කෝටියකට අධික ආදායමක් උපයා නව සංගීත පරපුරක් රටට ගෙන ආවේය. ඇල්බමය සඳහා මිලියන 8 ක් සහ රටේ ජනප්‍රියම ගායකයා බවට පත් විය. \"සුදු පරෙවි රෑන\", \"රටකින් එහා\", \"ජීවිතේ මගේ\", \"එත රන්විමන්\", \"කැඳම් යන්නම්\", \"නේරංජනා\", \"මුළු මුහුද\", \"පැතුම් පිරිලා\", \"අපසු එනවා\", \"මට වාසනා\" සහ \" සුප්‍රසිද්ධ සංගීත කණ්ඩායමක් වන \"සන්ෆ්ලවර්ස්\" සංගීත කණ්ඩායමේ සංගීතයත් සමඟ මේ පාළු මාවතේ ගීතය යළිත් ජනප්‍රිය වුණා.\n\nසූරියසේන සහ සිරස සුපර් ස්ටාර් අතර මතභේද වර්ධනය කරමින් ඔහුගේ ජනප්‍රිය ගීතය වන \"ඇත රන්විමන්\" 2006 වසරේ ජනප්‍රියම ගීතය බවට පත්විය.\n\n වෘත්තීය\n\nසූරියසේන 1971 දී කැලණිය ගුරුකුල විද්‍යාලයේ සංගීත ගුරුවරයෙකු ලෙසින් සිය වෘත්තීය ජීවිතය ආරම්භ කළ අතර ඒ සමගම වේදිකා ගායකයෙකු ලෙසද කටයුතු කළේය. වසර 10ක පමණ සේවයෙන් පසු සූරියසේන ගුරු වෘත්තියෙන් සමුගත්තේ තම සංගීත දිවියට මුල්තැන දෙමින්.\n\nලාල් තේනබදු, දිවංගත සරත් දසනායක, ස්ටැන්ලි පීරිස්, සරත් ද අල්විස්, දිවංගත ක්ලැරන්ස් විජේවර්ධන සහ රංජිත් පෙරේරා යන ප්‍රවීණ සංගීත අධ්‍යක්ෂවරුන් ඔහුගේ ගීත සඳහා සංගීතය මෙහෙයවූහ. 'ආදරණීය නේරංජනා', 'හෙට දවසේ', 'මට වසන', 'සඳ මා ගවයි', 'මගේ සමරුම් පොතේ', 'එකම විදියේ', 'මොහොතක සුව දෙන', 'ගැලවට බැන්ද වූ මුතු' වැනි ගීත සඳහා සූරියසේන සංගීත අධ්‍යක්ෂණය කළේය. පොටේ' (බෙල්ලෙන් බැඳ ඇත). සූරියසේන විසින් සංගීත අධ්‍යක්ෂණය කළ සමහර ප්‍රවීණ ගායන ශිල්පීන් වූයේ එම්.එස්. ප්‍රනාන්දු, ඇන්ටන් ජෝන්ස්, මිල්ටන් මල්ලවාරච්චි, පුන්සිරි සොයිසා, මර්වින් පෙරේරා, ග්‍රේෂන් ආනන්ද, දිවංගත මර්වින් මිහිඳුකුල, චන්ද්‍රලේඛා පෙරේරා, ෆ්‍රෙඩී සිල්වා සහ එච්.ආර්. ජෝතිපාල ය. ඇන්ටන් ජෝන්ස් විසින් ගායනා කරන ලද ශාන්ත අන්තෝනි (santha Anthony munituma) වෙනුවෙන් කැප වූ සුප්‍රසිද්ධ ක්‍රිස්තියානි බයිලා සංගීතය ප්‍රියා සූරියසේන විසින් රචනා කර ඇත.\n\n1990 දශකයේ ආරම්භයේදී සූරියසේන කැසට් නිෂ්පාදන ව්‍යාපාරයට නැඹුරු වූ අතර එහිදී ඔහු \"ලක්ෂිත වෙළඳ මධ්‍යස්ථානය\" ආරම්භ කර එම්.එස්. ප්‍රනාන්දු, පුන්සිරි සොයිසා එච්.ආර් ජෝතිපාල සහ චම්පා කල්හාරිගේ කැසට්පට නිකුත් කළේය.\n\nඔහු 1980 දශකයේ මුල් භාගයේ මල් කැකුළු, ෂයාමි ෆොන්සේකා සමඟ 'බිඳු බිඳු කඳුළු සලා' යුගල ගීතය සහ සරත් දසනායක විසින් සංගීත අධ්‍යක්ෂණය කළ සේන සමරසිංහ නිෂ්පාදනය කළ චිත්‍රපට රැසක පසුගාමී ගායකයෙක් ද විය. ඊට අමතරව ඔහු 'සෙලිනාගේ වලව්ව', 'මුඩුක්කුවේ ජුලියට්', 'හරියනකොට ඔබ තාමයි', 'පින ​​පඳුන ද' වැනි තවත් චිත්‍රපට රැසක ගීත ගායනා කළා. 1980 ගණන්වල \"සරසවිය\" (සරසවි සම්මාන) සම්මානයෙන් පිදුම් ලැබූ සරත් දසනායකගේ (\"කන්දන් යන්නන් රන් මල් මල දල\") සංගීත අධ්‍යක්ෂණයට 'ඇතින් එතනට' ඔහු මිල්ටන් මල්ලවාරච්චි සමඟ යුගලයක් ගායනා කළේය. සුහද සොහොයුරෝ චිත්‍රපටයේ ඔහු සුළු චරිතයක් නිරූපණය කළා. නමුත් පසුව සූරියසේන වේදිකාවට පමණක් අවධානය යොමු කරමින් පසුබිම් ගායකයෙකු ලෙස ගායනයෙන් ඉවත් විය. 2006 දී ඔහු ‘කළු සුදු මල්’ චිත්‍රපටිය සඳහා සමිතා මුදුන්කොටුව සමඟ “ගිම්හානයේ” යුගලයක් ගායනා කළේ කමල් අද්දරආරච්චිගේ පිරිමි පසුබිම් චරිතය ලෙසිනි.\n\n විදේශ සංචාර\n\nඔහුගේ මංගල විදේශ සංචාරය 1978 දී සිංගප්පූරුවට විය. පසුව, ඔහු එක්සත් ජනපදය, යුරෝපය, ආසියාව, මැදපෙරදිග සහ ඕස්ට්‍රේලියාව ඇතුළු තවත් රටවල් 44 කට වැඩි ගණනකට ගියේය.\n\nඔහු 2007 ඔක්තෝම්බර් මාසයේදී සැලකිය යුතු ශ්‍රී ලාංකික ප්‍රජාවක් සිටින කටාර් හි රඟ දැක්වීය.\n\n පෞද්ගලික ජීවිතය\n\n1978 දී ඔහු හේවුඩ් වෙතින් සංගීතය පිළිබඳ ඩිප්ලෝමාවක් ලබා සංගීත ගුරුවරියක් වූ තමරා කුමාරි වීරසිංහ සමඟ විවාහ විය. ඔහු දැන් දරුවන් හතර දෙනෙකුගේ පියෙකි - දියණියන් තිදෙනෙකු වන මිනෝෂි, ඉරෝෂි (දෙදෙනාම විදේශගතව අධ්‍යාපනය ලබති), ගයාෂි සහ පුතා, එක්සත් ජනපදයේ ඉගෙනුම ලබන ලක්ෂිත."
    },
    {
        "name": "රොහාන් ශාන්ත බුලේගොඩ",
        "info": "ගායකයා",
        "Intro": "ගායකයා",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "ශ්රී ලංකාව",
        "description": "රොහාන් ශාන්ත බුලේගොඩ\n\n (ඉංග්‍රීසි:\n\nරොහාන් ශාන්ත බුලේගොඩ\n\n) යනු ප්‍රවීන ජනප්‍රිය ගායකයකි.රොහාන් ශාන්ත බුලේගොඩ නාලන්දා විද්‍යාලයේ ආදි සිසුවෙකි.ආශ්‍රීත"
    },
    {
        "name": "මිල්ටන් මල්ලවාරච්චි",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1945 අප්‍රේල් 7",
        "Death": "1998 මාර්තු 10\n\n(වයස අවුරුදු 52)",
        "Family": "ළමා:\n\nරනිල් මල්ලවාරච්චි",
        "description": "මිල්ටන් මල්ලවාරච්චි\n\n (1944-1998) ජනප්‍රිය ශ්‍රී ලාංකේය සංගීතවේදියෙකි. මල්ලවාරච්චි කරුණාරත්න අබේසේකර, කේ.ඩී.කේ. ධර්මවර්ධන, ප්‍රේමකීර්ති ද අල්විස්, ක්ලැරන්ස් විජේවර්ධන, උපාලි දනවලවිතාන, ධර්මසිරි ගමගේ, අජන්තා රන්සිංහ, ෂෙල්ටන් වීරරත්න, ක්ෂෙල්ටන් වීරරත්න, ක්සතුලර් වීරරත්න අනස්ගේ ගීත ගායනා කළේය. චිත්‍රානන්ද අබේසේකර, බණ්ඩාර විජේතුංග සහ විජය රාමනායක චරිතාපදානය. ඔහු ශාක්‍යයන් සහ පසුව ලා සිලෝනියන් නම් කෙටිකාලීන කණ්ඩායමේ සාමාජිකයෙකි. මල්ලවාරච්චි විසින් අවසාන කණ්ඩායමේ \"දහ ආදිපාද විද්‍යාහල\" සහ \"මල් රවමල්\" ගේ ගායනය නිෂ්පාදක පැට්‍රික් කොරයා විසින් ඔහුගේ සොයා ගැනීමට හේතු විය. කුරේරා තරුණ ගායන ශිල්පියා සමඟ ගීත හතරක් පටිගත කිරීමට ඉදිරිපත් විය: \"ඔරුවක පාවෙන\", \"රන් කූඩුවක් ඔබ සාදු\", \"සංසාරේ සෙවනැල්ලේ\" සහ \"මංගලේ නෙත් මංගලේ\". මෙම ගීත 1969 දී 78 rpm වාර්තා ද්විත්ව කට්ටලයක් ලෙස Exvee ලේබලය මත නිකුත් කරන ලද අතර මල්ලවාරච්චිට ඔහුගේ පළමු ජනප්‍රිය ජයග්‍රහණය ලබා දුන්නේ \"ඔරුවක පාවෙන\" සමඟිනි. එය ශ්‍රී ලංකාවේ චිත්‍රපට නොවන ගීත සඳහා නිකුත් කළ අවසන් 78 rpm වාර්තාව විය.සංගීත නිර්මාපකයෙකු වන පැට්‍රික් දෙනිපිටිය මිල්ටන් මල්ලවාරචිචිගේ \"ඉවුරු තල\", \"මා හා එදා\" සහ \"මා නිසා ඔබ\" වැනි ගීතවලට නවීන ස්පර්ශයක් ලබා දුන්නේය. \"සයුර තෙරේදි\" ගීතය ඔහුට අතිශයින් සාර්ථක වීමට ඉවහල් විය. ඔහුගේ පළමු යුගලය - \"බිංදු බිංදු\" - R. චිත්‍රා සමඟ ගායනා කරන ලදී. 1974 දී ලංකා සංගීතඥ ක්ලැරන්ස් විජේවර්ධන \"ගාන අඳුරේ\", \"එදා රෑ,\" ගීත රචනා කළේය. \" \"මාතා මෙන් ඔහුටද\" සහ \"මග තොටදියි\" මැණික් ගල් මත EP නිකුතුවක් සඳහා. විජේවර්ධන මල්ලවාරච්චි වෙනුවෙන් \"අවසර නාථ මාතා\", \"සුළඟේ පවේ\", \"තනිවි සිටයි\" සහ \"ප්‍රේම් රජ දහනේ\" ද රචනා කළේය. \"පෙම් රජදහනේ\" හි ඔහු ඉන්ද්‍රානි පෙරේරා සහ සමිතා මුදුන්කොණ්ඩුව සමඟ ගායනා කළේය. මල්ලවාරච්චිගේ වඩාත්ම සාර්ථක ගීතයක් වූයේ 1976 දී මෙල්රෝයි ධර්මරත්න විසින් නිෂ්පාදනය කරන ලද \"මයි ගහ යට\" ගීතයයි. එය \"රන් මුදු\" සමඟ EP ලෙස Silverline ලේබලය මත නිකුත් විය. ගීත දෙකක් - \"අන්දන්නේ එපා\" සහ \"මා සමනළයක්\" - ශිරෝමි ප්‍රනාන්දු විසිනි.\" මල්ලවාරච්චි විසින් 1978 දී විජය රාමනායකගේ මගපෙන්වීම යටතේ ශ්‍රී ලංකාවේ පළමු සංගීත ශ්‍රව්‍ය කැසට් පටයක් නිකුත් කරන ලදී. එය නම් කර ඇත.\n\nඕනවෙලාවක ඕනතැනක\n\n තරංගා ලේබලය මත විය. මල්ලවාරච්චි 1971 චිත්‍රපටයේ පසුබිම් ගායකයෙකු ලෙස ආරම්භ විය.\n\nපූජිතයෝ\n\n. 1984 වසරේ සරසවිය සම්මාන උලෙළේදී සේන සමරසිංහගේ \"කැඳන් යන්නම්\" ගීතය වෙනුවෙන් හොඳම පසුබිම් ගායකයාට හිමි සම්මානයෙන් පිදුම් ලැබීය.\n\nඒතින් ඒතත්\n\n. ඔහු චිත්‍රපටයේ ප්‍රධාන පිරිමි පසුබිම් ගායකයා විය\n\nසේනකෙළිය\n\n එය 1974 දී බොක්ස් ඔෆිස් හි ජනප්‍රිය විය. එහි ගීත \"රැයක් උපද්දා\" සහ ඉන්ද්‍රානි පෙරේරා සමඟ \"සමනල රෑනක් සේ\" හි යුගල සහ වික්ටර් රත්නායක සහ සීඩී ෆොන්සේකා සමඟ යුගල ඇතුළත් විය. සංගීත අධ්‍යක්ෂණය කළේ පැට්‍රික් දෙනිපිටියයි. මල්ලවාරච්චි ජනප්‍රිය සජීවී ආකර්ෂණයක් විය. ශ්‍රී ලංකාවේ රූපවාහිනියක් නොතිබූ යුගයක, ලංකා දුම්කොළ සමාගම විසින් අනුග්‍රහය දක්වන ලද විවිධ සංදර්ශනවල ඔහු පෙනී සිටීම සඳහා විශාල ජනකායක් ඇදී ආවේය. විජේවර්ධන විසින් සංවිධානය කරන ලද Super Concert 101/102 හි Super Golden Chimes සමග මල්ලවාරච්චි පෙනී සිටියේය. ඔහු අවසන් වරට පටිගත කළ ගීතය වන්නේ ඇල්බමයේ \"අග රෙජිනියා\" ගීතයයි\n\nසෙනෙහස බුදුවක්\n\n. පළමු ටෙලිනාට්‍යයේ\n\nහිමා කඩල්ල\n\n මල්ලවාරච්චි \"සඳ සුළඟේ පාවී\" ගීතය ගායනා කළේ 1998 මාර්තු 10 වන දින මිය ගියේය. පෞද්ගලික ජීවිතය මල්ලවාරච්චි ස්වර්ණා මල්ලවාර්ච්චි (එකම නම ඇති සුප්‍රසිද්ධ ශ්‍රී ලාංකික නිළිය නොවේ) සමඟ විවාහ වූ අතර ඔහුට දරුවන් හතර දෙනෙක් සිටියහ: රනිල්, හර්ෂිනී, නදීජා සහ තාරකා. කරුණාරත්න අබේසේකරයන් මල්ලවාරච්චි වෙනුවෙන් ලියූ \"ඇත එපිට දුර ආකාසේ... ස්වර්ණවර්ණ තරුවක් විලසේ\" ගීතය කැප කරන්නේ ඔහුගේ බිරිඳ ස්වර්ණා වෙනුවෙනි."
    },
    {
        "name": "සහේලි රෝචන ගමගේ",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1988 මාර්තු 8",
        "Age": "අවුරුදු 33 යි",
        "description": "සහේලි රෝචන ගමගේ\n\n (උපත මාර්තු 8, 1988) යනු ශ්‍රී ලාංකික ගායකයෙකි. ඇය \"විශාරධා\" යන පදවි නාමය දරයි. ශ්‍රී ලංකා සිවිල් යුද්ධයේදී සටන් වැදුණු ශ්‍රී ලංකා ජනාධිපති මහින්ද රාජපක්ෂ මහතාට සහ ත්‍රිවිධ හමුදාවට සහ පොලිසියට කැප වූ 'ආයුබෝවන්, මහරජානනී' (මහ රජතුමා ඔබට දීර්ඝායුෂ ලැබේවා) නම් වූ ජනප්‍රිය ගීතය නිසා ඇය ප්‍රසිද්ධියට පත් වූවාය."
    },
    {
        "name": "සමන් ද සිල්වා",
        "info": "ගායකයා",
        "Intro": "ගායකයා",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "ශ්රී ලංකාව",
        "description": "සමන් ද සිල්වා\n\n (ඉංග්‍රීසි:\n\nසමන් ද සිල්වා\n\n) යනු ප්‍රවීන ජනප්‍රිය බයිලා ගායකයකි.සමන්ගේ ගීත අතර\n\nනියරේ පියනගල\n\n,\n\nපුංචි කුරුළු කූඩුවේ\n\n,\n\nසන්තෝස වෙන්න ප්‍රීති වෙන්න\n\n,\n\nතනනිල්ල දිගේ\n\n,\n\nපුරහඳ නැගුණා\n\n මේ ආදී ගීත ඉතා ජනප්‍රියය.සමන් ගායක ගායිකාවන්ගේ සංගමයේ හිටපු සභාපතිවරයා වූ අතර එක්සත් ජාතික පක්ෂයේ කලා සංසදයේ ජාතික සංවිධායක ද විය. සමන් ද සිල්වා පසුගිය බස්නාහිර පළාත් සභා මැතිවරණයේදී එක්සත් ජාතික පක්ෂයෙන් පැවැත්වෙන තරඟාවලිය.චිත්‍රපට සහ ටෙලි නාට්‍ය නළු ගාමිණී හෙට්ටිආරච්චි නාලන්දාවේ සම කාලිනයි"
    },
    {
        "name": "තරංග ගුණතිලක",
        "info": "ශ්‍රී ලාංකීය ඔපෙරාටික් සොප්‍රානෝ",
        "Intro": "ශ්‍රී ලාංකීය ඔපෙරාටික් සොප්‍රානෝ",
        "Is": "ගායකයා\n\nඔපෙරා ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "බදුල්ල",
        "description": "තරංග ගුණතිලක යනු ශ්‍රී ලංකාවේ බදුල්ලේ ඉපිද රත්මලානේ හැදී වැඩුණු සොප්‍රානෝ ඔපෙරා ගායකයෙකි. ඇයගේ ගායන හැකියාව කොන්වර්ස් විද්‍යාලයේ සංගීත මහාචාර්යවරයකු ශ්‍රී ලංකාවට පැමිණෙමින් සිටියදී ඔහුගේ අවධානයට ලක්විය. ලොව ප්‍රමුඛතම සංගීත පාසලක් වන ජුලියර්ඩ් පාසලට ඇතුළත් වූ ශ්‍රී ලංකාවෙන් පළමු කාන්තාව ඇයයි. ඇය දැනට නිව් යෝර්ක් නගරයේ ජීවත් වන අතර, ඔපෙරා හි ඇයගේ වෘත්තිය ජාත්‍යන්තර අවධානයට ලක්ව ඇත.අධ්‍යාපනය\n\nගුණතිලක වයස අවුරුදු 12 දී ක්‍රිස්ටීන් පෙරේරාගේ පුහුණුව යටතේ ශ්‍රී ලංකාවේ ගායනය ඉගෙනීමට පටන් ගත්තේය. ඇය 2001 හි දකුණු කැරොලිනාවේ කොන්වර්ස් විද්‍යාලයට ඇතුළත් වීමට පටන් ගත් අතර 2005 දී වාචික කාර්ය සාධනය පිළිබඳ සංගීත උපාධියක් සහ ජීව විද්‍යාව පිළිබඳ බාල වයස්කාර උපාධියක් ලබා ගත්තාය.\n\nදකුණු කැරොලිනා නියෝජනය කරමින් ඇය මෙට්‍රොපොලිටන් ඔපෙරා ජාතික කවුන්සිලයේ විගණනයට ඇතුළු වී ජයග්‍රහණය කළාය. ගුණතිලකගේ රංගනය ගැන පැහැදුණු විනිසුරුවන්, ජුලියර්ඩ් පාසලේ සිට පැමිණි ඇයගෙන් විමසා සිටියේ ඇය උපාධි පාසලට යාමට සිතුවාද යන්නයි. එහි ප්‍රතිඵලයක් වශයෙන්, ඇය Juilliard සඳහා ඇතුළත් වීමට අයදුම් කිරීමට තීරණය කළ අතර, 2005 දී, Juilliard පාසලට ඇතුළත් වූ පළමු ශ්‍රී ලාංකික කාන්තාව වූ අතර, ඇයට සම්පූර්ණ උපකාරක ශිෂ්‍යත්වයක් ද ලබා දෙන ලදී. ඇයගේ ජීවන වියදම් පියවනු ලැබුවේ ශ්‍රී ලංකා ජනාධිපති අරමුදල විසිනි. ඇය ජුලියර්ඩ් වෙතින් හඬ සහ ඔපෙරා පිළිබඳ ශාස්ත්‍රපති උපාධියක් ලබා ගත්තාය.\n\n වෘත්තීය\n\n1998 දී SOSL ප්‍රසංග වාචික තරඟයෙන් ජයග්‍රහණය කිරීමෙන් පසු 1998 දී ගුණතිලක ශ්‍රී ලංකා සංධ්වනි වාදක කණ්ඩායම (SOSL) සමඟ ගායනයට පිවිසියාය. වශයෙන්\n\nඉල් ට්‍රිටිකෝ\n\n,\n\nකාර්මලයිට්වරුන්ගේ සංවාද\n\n,\n\nLa bohème\n\n,\n\nZauberflöte මිය යන්න\n\n,\n\nIphigénie en Aulide\n\n, හා\n\nඇරියෝඩන්ටේ\n\n. ඇය එක්සත් ජනපදය, යුරෝපය, ඉන්දියාව සහ දකුණු කොරියාවේ ප්‍රසංගවල ද ඉදිරිපත් වී ඇත. ඇයගේ 2011 ප්‍රසංග චාරිකාව ඉන්දියාවේ ශ්‍රී ලංකා මහ කොමසාරිස් කාර්යාලය විසින් \"කාලෝචිත\" ලෙස සලකනු ලැබුවේ එය දෙරට අතර සංස්කෘතික සංවාදයක් ඇති කිරීමට ඉවහල් වූ බැවිනි.\n\n පෞද්ගලික ජීවිතය\n\nගුණතිලක හැදී වැඩුණේ කොළඹ අගනුවරට ආසන්න ශ්‍රී ලංකාවේ රත්මලානේ ය. ඇය මුලින්ම ඔපෙරා ගැන උනන්දු වූයේ ඇයට වයස අවුරුදු දහතුනේදී සෝප්‍රානෝ කිරි තේ කනවා ගායනා කිරීම ඇසූ විටය. කෙසේ වෙතත්, ඔපෙරා වෘත්තීය විකල්පයක් යැයි ඇය ඒ වන විට සිතුවේ නැත. ඩග්ලස් වීක්ස් හි කොන්වර්ස් විද්‍යාලයේ සංගීත මහාචාර්යවරියක් ශ්‍රී ලංකාවට පැමිණෙමින් සිටි අතර ඇය ගායනා කරනු ඇසීය; පසුව ඔහු ඇයව විද්‍යාලයට ඇතුළත් කර ගැනීමට කටයුතු කළේය. ඇය ශ්‍රී ලංකාවේ වෛද්‍ය විද්‍යාව හැදෑරීමට සැලසුම් කර තිබුණත්, ඇයව පුදුමයට පත් කරමින්, ඇයගේ පියා ඇයට Converse College වෙත යාමට ඇති යෝජනාව ගැන දැනගත් විට, එය හොඳ අදහසක් යැයි ඔහු සිතුවේය.\n\nඇගේ බාල සොහොයුරිය වන එරංගා ද කොන්වර්ස් විද්‍යාලයට ඇතුළත් වූ අතර පසුව සදර්න් ඉලිනොයිස් විශ්වවිද්‍යාලයෙන් ඔපෙරා සහ සංගීත රඟහල පිළිබඳ ශාස්ත්‍රපති උපාධිය ලබා ගත්තාය. ඇය දැනට Converse College හි Lawson Academy of Arts හි පීඨ සාමාජිකාවකි. ගුණතිලක විවාහ වී දියණියක් සිටින අතර නිව් යෝර්ක් නගරයේ ජීවත් වේ."
    },
    {
        "name": "Yolande Bavan",
        "info": "ශ්‍රී ලාංකික නිළියක් සහ ගායිකාවක්",
        "Intro": "ශ්‍රී ලාංකික නිළියක් සහ ගායිකාවක්",
        "Is": "නළුවා\n\nගායකයා\n\nජෑස් සංගීතඥයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "චිත්‍රපටය, රූපවාහිනිය, වේදිකාව සහ ගුවන්විදුලිය\n\nසංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1942 ජුනි 1",
        "Age": "අවුරුදු 79 යි",
        "Star sign": "මිථුන ලග්නය",
        "description": "Yolande Bavan (උපත ජුනි 1, 1942 ලංකාවේ) ගායිකාවක් සහ නිළියකි.\n\nඇය සිය වෘත්තීය ජීවිතය ආරම්භයේදී ග්‍රේම් බෙල්ගේ සංගීත කණ්ඩායම සමඟ රංගන ශිල්පිනියක් ලෙස ඕස්ට්‍රේලියාවේ සහ ආසියාවේ සංචාරය කළාය. 1962 දී දුර්වල සෞඛ්‍ය තත්ත්වය හේතුවෙන් රොස්ට කණ්ඩායමෙන් ඉවත් වීමට සිදු වූ පසු ජනප්‍රිය ජෑස් ගායන කණ්ඩායමේ ලැම්බර්ට්, හෙන්ඩ්‍රික්ස් සහ රොස් හි ඇනී රොස් වෙනුවට ඇය වඩාත් ප්‍රසිද්ධය. ඇය ඇල්බම තුනක්, සියලුම සජීවී පටිගත කිරීම්, කණ්ඩායම සමඟ පටිගත කළේ නම් ලැම්බර්ට්, හෙන්ඩ්‍රික්ස් සහ බවන්. 1964 දී, ඇය සහ ඩේව් ලැම්බට් කණ්ඩායමෙන් ඉවත් වූ අතර, ත්‍රිත්වය ඵලදායී ලෙස අවසන් කරන ලදී. ඇය 1962 දී \"To Tell the Truth\" හි පෙනී සිටි අතර දුර්ලභ ජයග්‍රහණයක් ලෙස ගායන කණ්ඩායම පෙනී සිටිමින් \"මෙය ආරම්භය විය හැකිය (විශාල දෙයක)\" ගායනා කළාය.\n\n1969 දී Peter Ivers සහ Yolande Bavan විසින් Epic Records සඳහා ඇල්බමයක් සාදන ලදී, එය Knight of the Blue Communion නමින්. Bavan විසින් Weather Report හි 1972 ඇල්බමය I Sing the Body Electric සඳහා ද ගායනය සපයා ඇති අතර, Salvation, Snow White and the Seven Dwarfs, සහ Michael John LaChiusa ගේ Bernarda Alba ඇතුළු සංගීතමය වැඩසටහන් කිහිපයක වාර්තාගත පෙනී සිටීම් සිදු කර ඇත. ඇය Parting Glances, One True Thing සහ Cosmopolitan වැනි චිත්‍රපටවල ද පෙනී සිට ඇති අතර බොහෝ නාට්‍යවල ද රඟපා ඇත."
    },
    {
        "name": "මර්සි එදිරිසිංහ",
        "info": "ගායකයා",
        "Intro": "ගායකයා",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1945, අඹේපුස්ස, ශ්‍රී ලංකාව",
        "Death": "2014 මාර්තු 17, ගම්පහ, ගම්පහ දිස්ත්‍රික්කය, බස්නාහිර පළාත, ශ්‍රී ලංකාව\n\n(වයස අවුරුදු 69)",
        "Instruments:": "හඬ",
        "description": "මර්සි එදිරිසිංහ\n\n (18 දෙසැම්බර් 1946 - 17 මාර්තු 2014) ශ්‍රී ලාංකේය, සිනමාව, රංග කලාව සහ රූපවාහිනියේ නිළියක් මෙන්ම ගායිකාවක් ද විය. 1964 දී ‘නවක මඬල’ ගීත තරගයෙන් සිය ගායන දිවිය ආරම්භ කළ ඇය 1966 දී වේදිකා නිළියක බවට පත් වූවාය.\n\nලූෂන් බුලත්සිංහල\n\n, තාරාවෝ ඉගිලෙති (තාරාවන් පියාඹයි) යන මාතෘකාවෙන්. විසින් රචනා\n\nගුණදාස කපුගේ\n\n, නාට්‍යයේ හඬපටයේ එන ‘මැඩේ ලගින තරවන්’ ඇගේ සාර්ථකම මුල් ගීතය බවට පත් විය. ඇය විකට රූපවාහිනී වැඩසටහන් සහ ගුවන්විදුලි නාට්‍ය රාශියක ඇයගේ භූමිකාව සඳහා ද ප්‍රසිද්ධියක් උසුලන අතර, ඉන් වඩාත් ප්‍රසිද්ධියට පත්ව ඇත්තේ \"විනෝද සමය\" නම් ගුවන් විදුලි වැඩසටහන වන අතර එහි ඇය ඇනස්ලි ඩයස්, බර්ටි ගුණතිලක සහ සැමුවෙල් රුද්‍රිගෝ සමඟින් රඟපායි.\n\nජීවිතය සහ වෘත්තිය මර්සි එදිරිසිංහ උපත ලැබුවේ ග්‍රේස් පෙරේරා සහ විභාග දෙපාර්තමේන්තුවේ ටයිප්සෙට් කරන්නෙකු වූ දොන් ලොරෙන්සෝ එල්වින් එදිරිසිංහට දාව ය. කතෝලිකයෙකු වූ මර්සි නව දෙනෙකුගෙන් යුත් පවුලක තුන්වන දරුවා විය.\n\nඇයගේ නැසීගිය සැමියා වූ ලලිත් කොතලාවෙල කළුතර ප්‍රදේශයේ බෞද්ධයෙකි. මෙම යුවළට දරුවන් සිටියේ නැත. ඇගේ රසික රසිකාවියන් කෙරෙහි ඇය දැක්වූ භක්තිය කෙතරම්ද යත් විවාහයෙන් පසුව මධුසමය ගත කිරීමට යන අතරතුර ලුම්බිණි රඟහලේ ‘මුතු කුමාරි’ වේදිකා නාට්‍යයේ රඟපෑවාය. 1966 දී ඇය මුලින්ම වේදිකා නාට්‍ය ලෝකයට පිවිසෙන්නේ වැලිකල රත්නගේ ‘උගුරට හොරා බෙහෙත්’ නාට්‍යයෙන්. ඇය ‘රන් කන්ද’, ‘සීලවතී’ ඇතුළු තවත් වේදිකා නාට්‍ය රැසක රඟපා තිබුණා. වසර ගණනාවක් පුරා ඇය දක්ෂ නිළියක් සහ ගායිකාවක් ලෙස පමණක් නොව විකට නළුවෙකු ලෙසද ස්ථිර කීර්තියක් ගොඩනඟා ගෙන සිටියාය.\n\nමරණය ඇයගේ මරණයට වසර දෙකකට පෙර, ඇය නාරිවේද ශල්‍යකර්මයකට භාජනය වූ අතර, එතැන් සිට උකුල්/කොන්දේ අමාරු රාශියකින් පීඩා වින්දාය. ඇය 2014 මාර්තු 17 වන දින ගම්පහ පෞද්ගලික රෝහලකදී මිය යන විට 68 වැනි වියේ පසුවිය.\n\nසම්මාන සහ ගෞරව 1974 දී R.R සමරකෝන් ගේ ‘ඉඩම’ වේදිකා නාට්‍යයේ රංගනය වෙනුවෙන් මර්සි රාජ්‍ය නාට්‍ය උළෙලේ හොඳම නිළියට හිමි සම්මානය දිනා ගත්තාය. ඇය 1975 සහ 1976 වසරවල තවත් හොඳම නිළිය සම්මාන දෙකක් දිනා ගත්තාය. 2014 ඇයගේ වෘත්තීය දිවියේ 50 වැනි සංවත්සරය නිමිත්තෙන් සහ ඇය කලාවට කළ සේවය අගයමින් 2014 රාජ්‍ය නාට්‍ය උළෙලේ දී ඇයට යාවජීව සම්මානයෙන් පිදුම් ලැබීමට නියමිතව තිබුණි.\n\nRadioMercy වේදිකා නාට්‍යය ශ්‍රී ලාංකේය ගුවන් විදුලි නාට්‍යයේ ඉතා ජනප්‍රිය හඬක් විය.\n\nසංගීත ඇල්බම"
    },
    {
        "name": "නිහාල් නෙල්සන්",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "මොරටුව, ශ්‍රී ලංකාව",
        "Instruments:": "හඬ",
        "Profiles": "",
        "description": "නිහාල් නෙල්සන්\n\n ශ්‍රී ලාංකික බයිලා ගායකයෙකි. ඔහු මොරටුව ප්‍රදේශයේ සිට ඇල්බම් 100 කට අධික ප්‍රමාණයක් නිකුත් කර ඇත.\n\nනෙල්සන්ගේ පළමු පටිගත කිරීම \"ලස්සනට පිපුණු වනමල්\" EP හි 1963 මාර්තු 31 දින නිකුත් කරන ලදී. 1978 දී කැසට් පටයක් නිකුත් කළ පළමු ශ්‍රී ලාංකික ගායන ශිල්පීන් අතර ඔහු ද විය.\n\nගුණේ අයියගේ කාමරේ\n\n. මෙම නිකුතුව ශ්‍රී ලංකාවට ආකෘතිය හඳුන්වා දුන් විජය රාමනායකගේ තරංග ලේබලය මත විය. සංයුක්ත තැටියක් නිකුත් කළ පළමු අය අතර නෙල්සන් ද විය.\n\nනෙල්සන්ගේ එකසිය දහවන ඇල්බමය\n\nනිහාල් 110 ඩොට් කොම්\n\n 2000 වසරේ තිරගත විය. එය හලාවත මහවැව සන්ෆ්ලවර්ස් චිත්‍රාගාරයේදී නීල් වර්ණකුලසූරියගේ සන්නායකතාවයෙන් සහ සන්ෆ්ලවර්ස් (කණ්ඩායම) විසින් සංගීතයෙන් පටිගත කරන ලදී. නිහාල් නෙල්සන් පාසල මොරටුව මහා විද්‍යාලයයි"
    },
    {
        "name": "දිනේෂ් කනගරත්නම්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා\n\nසංගීතඥයෙක්",
        "From": "ඉන්දියාව\n\nශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1987 පෙබරවාරි 21, මෝදර, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 34 යි",
        "Star sign": "මීන",
        "Instruments:": "හඬ",
        "description": "ආර්යන් දිනේෂ් කනගරත්නම්\n\n (උපත 1981 අගෝස්තු 29), ඔහුගේ මුලකුරු වලින් ද හැඳින්වේ\n\nඒ.ඩී.කේ.\n\n හෝ සරලව\n\nදිනේෂ් කනගරත්නම්\n\n, දෙමළ භාෂාවෙන් ගීත රචනා කර ඇති ශ්‍රී ලාංකික R&B සහ හිප් හොප් කලාකරුවෙකු සහ සංගීත නිෂ්පාදකයෙකි. ඔහු පසුතල ගායකයෙකු ලෙස දමිළ සිනමාවේ සංගීත අධ්‍යක්ෂවරුන් සමඟ ද බොහෝ විට සහයෝගයෙන් කටයුතු කරයි.\n\nමුල් ජීවිතය සහ වෘත්තීය දිනේෂ් ඉපදී හැදී වැඩුණේ ශ්‍රී ලංකාවේ බදුල්ලේ ය. ඔහු ඉන්දියාවේ තමිල්නාඩුවේ ට්‍රිචි හි තොරතුරු තාක්ෂණය (IT) හැදෑරූ අතර ශ්‍රී ලංකාවේ තොරතුරු තාක්ෂණ පාඨමාලා ඉගැන්වීම ආරම්භ කළේය. ඔහු සංගීතය කෙරෙහි ඔහුගේ වැඩෙන උනන්දුව ලුහුබැඳීම සඳහා අර්ධකාලීනව දේශීය සංගීතඥයන් සමඟ වැඩ කිරීමට පටන් ගත්තේය. 2004 දී ඔහුට ශ්‍රී ලංකාවේ කලාකරුවෙකු වූ භාතියන් විසින් අවස්ථාවක් ලබා දුන් අතර ඔහු සොයා ගන්නා තෙක් රැප් ගීත පටිගත කිරීම ආරම්භ කළේය.\n\nවිජේ ඇන්ටනි\n\n. ඔහු චිත්‍රපටයේ හඬපටය සඳහා \"ආතිචූඩි\" ගීතය සඳහා ඔහු සමඟ සහයෝගයෙන් කටයුතු කළේය\n\nTN 07 AL 4777\n\n (2008) 2009 දී එය ඔහුගේ පළමු ස්වාධීන ඇල්බමය වන Tamizha Back in Sri Lanka හි ගීතයක් වන සුරංගනී හි ප්‍රතිනිර්මාණයකි, ඔහු 2005 දී දෙමළ, සිංහල සහ ඉංග්‍රීසි ගීත ඇතුළත් හරස් සංස්කෘතික ඇල්බමයක් කළේය.\n\nසිනමා කර්මාන්තයේ ඔහුගේ මීළඟ කාලය වූයේ \"මගුඩි\", එය ඔහුගේ පළමු සහයෝගීතාවයයි\n\nA. R. රහමන්\n\n සඳහා\n\nමනි රත්නම්\n\n- අධ්‍යක්ෂණය කළ චිත්‍රපටිය\n\nකඩල්\n\n (2013) ඔහු සමඟින් නිරූපණය විය\n\nඅනිරුද් රවිචන්දර්\n\n චිත්‍රපටයේ \"මුන් සෙල්ලද\" ගීතය සඳහා\n\nමනිතාන්\n\n (2016), රචනා කළේ\n\nසන්තෝෂ් නාරායනන්\n\n.\n\nකනගරත්නම් සහ රැප් ගායක ශ්‍රී රස්කෝල් රැප් මැෂින් නමින් තැටි ලේබලයක් පිහිටුවා වෙනත් රැප් සංගීතයද කර ඇත.\n\nඔහු දෙමළ සහ තෙළිඟු සිනමාවේ දිගටම වැඩ කරමින්, \"Maayon\" යන මාතෘකාව ඇතුළුව, ශබ්ද පට සඳහා ඉංග්‍රීසි භාෂා රැප් ලිවීම සහ රඟ දැක්වීම සිදු කළේය.\n\nMersal\n\n (2017) විසින් රචනා කරන ලදී\n\nA. R. රහමන්\n\n, සමග විශේෂාංගී වූ \"ගල ගලා\" ගීතය\n\nමේඝා\n\n විසින් රචනා කරන ලද Race Gurram වෙතින්\n\nඑස් තමන්\n\n සහ Nekonda Paarvai හි පසුබිම් ලකුණු (පසුව මකා දමන ලදී). ඔහුත් වැඩ කළා\n\n2.0\n\n (2018)\n\nකනගරත්නම් ශ්‍රී ලංකාව, මැද පෙරදිග, ඉන්දියාව, මැලේසියාව සහ සිංගප්පූරුව යන රටවල ප්‍රසංග චාරිකාවලට සම්බන්ධ වී ඇත. ඔහු සෑම A. R. Rahman ප්‍රසංග චාරිකාවකදීම ඔහුගේ රැප් සටන් සඳහා ප්‍රසිද්ධය\n\nකාෂ් ආර්යාව\n\n හා\n\nබ්ලේස්\n\n. 2019 ජනවාරි මාසයේදී කනගරත්නම් භාතිය සහ සන්තුෂ් සමඟ ප්‍රසංගය කළා\n\nඔබ නිසා\n\n ලංකාවේ.\n\nඩිස්කොග්‍රැෆි ස්වාධීන ගීත සහ ඇල්බම ප්ලේබැක් ගායනය"
    },
    {
        "name": "කීර්ති පැස්කුවෙල්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1955, මහනුවර, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 66 යි",
        "Education": "ධර්මරාජ විද්‍යාලය",
        "Genre:": "පොප් සංගීතය",
        "Instruments:": "හඬ",
        "description": "කීර්ති පැස්කුවෙල්\n\n (සිංහල: කීර්ති පැස්කුවල්: උපත 1956) යනු ශ්‍රී ලංකාවේ මහනුවර සිට පැමිණි පොප් සංගීතඥයෙකි. දශක තුනකට වැඩි කාලයක් රංගනයේ යෙදෙන ඔහු සම්මාන රැසකින් පිදුම් ලබා ඇත. ඔහු සංගීත අධ්‍යාපනයේ සහ සමාජ සුබසාධන කටයුතුවල ක්‍රියාකාරීව සිට ඇත.\n\nAwardsPasquel ශ්‍රී ලංකාවේ සම්මාන රැසක් දිනාගෙන ඇත. 1996 දී ඔහු ජපානයේ ලෝක විද්‍යා කවුන්සිලයෙන් ජාත්‍යන්තර සම්මානයක් ලබා ගත් අතර එහිදී ඔහු රටවල් 13 ක කීර්තිමත් සංගීතඥයන් සමඟ තරඟ කළේය.\n\nඅනාථ නිවාස ව්‍යාපෘතිය කීර්ති විසින් අනාථ නිවාසවල සිට ළමයින්ට විනෝදාස්වාදය ලබා දීම සහ ඔවුන්ගේ හැකියාවන් හඳුනා ගැනීම සඳහා 'The Child' නමින් ව්‍යාපෘතියක් දියත් කරන ලදී. 2005 වසරේදී 'The Child' විසින් 2004 බොක්සිං ඩේ සුනාමියෙන් අනාථ වූ දරුවන් පුනරුත්ථාපනය කිරීම සඳහා අනුග්‍රහක අරමුදල් එකතු කරන ලදී. මෙය සංගීත සංදර්ශන පමණක් නොව නාට්‍ය, චිත්‍රපට සහ ආධුනික කුසලතා ද සංවිධානය කරමින් පැස්කුවෙල්ගේ අඛණ්ඩ ව්‍යාපෘතියකි. පෙන්වයි.\n\nPasquel Sound of MusicKeerthi යනු 2006 දී සංගීත ක්ෂේත්‍රයේ වෘත්තිකයන් වීමට කැමති අයට හඬ පුහුණුව සහ සංගීත භාණ්ඩ ඉගැන්වීම සඳහා පාසලක් වන 'Pasquel Sound of Music' හි නිර්මාතෘවරයා විය. 'පැස්කුවෙල් සවුන්ඩ් ඔෆ් මියුසික්' හි ස්ථාපිත සංගීතඥයන් සංගීත භාණ්ඩයක් වාදනය කිරීමට සිසුන් පුහුණු කරයි. හර්ෂ මාකලන්දේ, චන්ද්‍රසේන හෙට්ටිආරච්චි සහ පැස්කුවෙල් යන ගුරුවරුන්ද ඇතුළත්ව ඇත."
    },
    {
        "name": "සුනිල් පෙරේරා",
        "info": "ශ්‍රී ලංකාවේ ගායක ගායිකාවක්",
        "Intro": "ශ්‍රී ලංකාවේ ගායක ගායිකාවක්",
        "Is": "ගායකයා\n\nගීත රචකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1952 සැප්තැම්බර් 14",
        "Age": "අවුරුදු 69 යි",
        "Star sign": "කන්‍යා ලග්නය",
        "Education": "මොරටුව ශාන්ත සෙබස්තියන් විද්‍යාලය",
        "description": "සුනිල් පෙරේරා\n\n (උපත 1952 සැප්තැම්බර් 14) ශ්‍රී ලාංකික ගායන ශිල්පියෙක්, ගිටාර් වාදකයෙක්, ගීත රචකයෙක් සහ තනු නිර්මාපකයෙකි. ඔහු ශ්‍රී ලංකාවේ ජනප්‍රිය සංගීත කණ්ඩායමක් වන ජිප්සීස් හි නායකයා සහ ප්‍රධාන ගායන ශිල්පියා වේ.\n\nමුල් ජීවිතය 1952 දී උපත ලද සුනිල් පෙරේරා මොරටුව ශාන්ත සෙබස්තියන් විද්‍යාලයෙන් සහ කොළඹ ශාන්ත පීතර විද්‍යාලයෙන් අධ්‍යාපනය සම්පූර්ණ කළේය. ඔහු පාසල් තූර්ය වාදක කණ්ඩායමේ සාමාජිකයෙක් විය.\n\nවෘත්තීය ජීවිතය 1969 දී ඔහු පාසලෙන් ඉවත් වූ වහාම සුනිල් ද ජිප්සීස් සංගීත කණ්ඩායමට සම්බන්ධ විය. සංගීත කණ්ඩායම 1969 දී ඔහුගේ පියා වන Glucorasa සමාගමේ රසකැවිලි නිෂ්පාදකයෙකු වූ ඇන්ටන් පෙරේරා විසින් පිහිටුවන ලදී.\n\nසංගීත කණ්ඩායමේ ප්‍රධාන ගායකයා වූයේ සුනිල් පෙරේරාය. ඔවුන්ගේ පළමු පහර\n\nලින්ඩා ලංගා සංගමය\n\n 1972/1973 දී නිකුත් කරන ලදී. සුනිල් පෙරේරා විසින් ගායනා කරන ලද අනෙකුත් ගීත අතර, නෝන් මගේ සුදු නෝන් (1977), ලුණු දෙහි (1987), කුරුමිට්ටෝ, ඔයේ ඔජායේ (1989), පිටි කොටපන් නෝන් සහ සිග්නෝර් (1997) ඇතුළත් වේ.\n\nසුනිල් රටේ ජනප්‍රියම ගායකයෙකු ලෙස පවතින අතර, ඔහුගේ ජිප්සීස් සංගීත කණ්ඩායම පසුගිය දශක තුනක කාලය තුළ නිත්‍ය විදේශ සංචාර, ජනප්‍රිය ඇල්බම් කිහිපයක් සහ අලෙවි වූ ප්‍රසංග සමඟින් ශ්‍රී ලංකාවේ විශාලතම සංගීත වරප්‍රසාදයක් ලෙස පවතී.\n\nවැනි සුනිල් පෙරේරාගේ මෑතකාලීන කෘති\n\nඇයි කියලා මම දන්නේ නැහැ\n\n හාස්‍යය හරහා හුදු සමාජ දේශපාලන ප්‍රශ්න ආමන්ත්‍රණය කරයි. ඔහුගේ ගීත කිහිපයක් රාජ්‍ය මාධ්‍ය විසින් තහනම් කර ඇත.\n\nමතවාදය සුනිල් පෙරේරා මෑතක දී රටේ සමාජ දේශපාලන තත්ත්වය පිළිබඳ ඔහුගේම මතවාදයක් ඉදිරිපත් කළේය. ඔහු ශ්‍රී ලාංකීය සමාජය සහ දේශපාලනය සම්බන්ධයෙන් ඉතා විවේචනාත්මක ය.\n\nපෞද්ගලික ජීවිතය ගීතා කුලතුංග සමඟ විවාහ වී සිටින සුනිල්ට පුතුන් දෙදෙනෙක් සහ දියණියන් දෙදෙනෙක් සිටිති. ඔහුට මුණුබුරන් ද සිටී."
    },
    {
        "name": "ඇන්තනි සී පෙරේරා",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1921 සැප්තැම්බර් 13, හලාවත, ශ්‍රී ලංකාව",
        "Death": "1988 මැයි 20, ජා-ඇල, ශ්‍රී ලංකාව\n\n(වයස අවුරුදු 66)",
        "Star sign": "කන්‍යා ලග්නය",
        "description": "මහපටබැදිගේ ඇන්තනි ක්‍රිස්මන් කිව්ලෝජියස් පෙරේරා\n\n (උපත 1921 සැප්තැම්බර් 13 - 1988 මැයි 20 වැනි දින මිය ගියේය\n\nඇන්තනී සී. පෙරේරා\n\n) [සිංහල]), ජනප්‍රිය ලෙස\n\nඇන්තනි සී පෙරේරා\n\n, ශ්‍රී ලාංකේය සිනමාවේ සහ රංග ශාලාවේ නළුවෙකි. ශ්‍රී ලාංකේය චිත්‍රපට ඉතිහාසයේ මුල්ම කුළුණු වලින් එකක් වන පෙරේරා දශක හතරකට වැඩි කාලයක් පුරා දිව ගිය ඔහුගේ වෘත්තීය ජීවිතය තුළ ගායකයෙකු, තිර රචකයෙකු සහ අධ්‍යක්ෂකවරයෙකු ලෙස ද කටයුතු කළේය.\n\nපෞද්ගලික ජීවිතය 1921 සැප්තැම්බර් 13 වැනි දින පුත්තලම මහවැව වී හේන නම් කුඩා ගම්මානයක පවුලේ වැඩිමලා ලෙස පෙරේරා උපත ලැබීය. ඔහුගේ පියා මහපටබැදිගේ ලෝගස් පෙරේරා උපත ලැබුවේ ජාඇල තුඩැල්ල ප්‍රදේශයේ වන අතර ඔහු වතු පරිපාලකයෙකු ලෙස සේවය කළේය. ඔහුගේ මව වර්ණසූරියගේ තියඩෝරා තිසේරාය. ඔහු ප්‍රාථමික අධ්‍යාපනය සඳහා මහවැව කනිෂ්ඨ විද්‍යාලයට ඇතුළත් වූ අතර වැඩිදුර අධ්‍යාපනය සඳහා තුඩැල්ල රෝමානු කතෝලික විද්‍යාලයට (වර්තමානයේ ක්‍රිස්තු රජු විද්‍යාලය, තුඩැල්ල ලෙස හැඳින්වේ) වෙත ගියේය. ඉන්පසුව තම පියා කුරුණෑගල නව වත්තකට මාරුවීමත් සමඟ පෙරේරා කුරුණෑගල සිට සැතපුම් 7ක් පමණ දුරින් පිහිටි බුදුපිටිය රෝමානු කතෝලික පාසලට මාරු විය.\n\nපෙරේරාට එක් බාල සොහොයුරෙකු වන විල්ෆ්‍රඩ් සහ එක් බාල සහෝදරියක් වන බියට්‍රිස් සිටී. විල්ෆ්‍රඩ් පසුව කොටහේන ශාන්ත බෙනඩික්ට් විද්‍යාලයේ කීර්තිමත් ගුරුවරයකු බවට පත් වූ අතර ජනප්‍රිය චරිත කිහිපයක් බිහි කළේය.\n\nවිජය කුමාරතුංග\n\n,\n\nරවීන්ද්‍ර රන්දෙණිය\n\n හා\n\nරොබින් ප්‍රනාන්දු\n\n.\n\nඔහු විවාහ වී සිටියේ මෝදරගේ මේරි වාස් සමඟයි. විවාහ උත්සවය 1953 දී පවත්වන ලදී. මෙම යුවළට දියණියන් පස් දෙනෙක් - මේනකා, දීප්තිකා, ගෞරිකා, චෞද්රි, ෂෙරීන් - සහ පුතුන් දෙදෙනෙක් - රෝහණ සහ එමිල්. ඔහුගේ වැඩිමහල් පුත් රෝහණ තරුණ වියේදීම හදිසි අනතුරකින් මිය ගියේය.\n\nපෙරේරා 1988 මැයි 20 වැනි දින මිය යන විට 66 වැනි වියේ පසුවූ අතර ජාඇල තුඩැල්ල කනත්තේ තැන්පත් කරන ලදී.\n\nවෘත්තීය ජීවිතය කෙටි වසර කිහිපයකින් පාසල් ජීවිතය අවසන් කිරීමෙන් පසු ඔහු නළුවෙකු වීමේ අභිලාෂය කරා ගමන් කළේය. ඇන්තනි වේදිකා නළුවෙකු වීමට ලඩී රණසිංහ සොයා ගොස් රණසිංහගේ ආකේඩියන්ස් නාට්‍ය කණ්ඩායම සමඟ සම්බන්ධ විය. මේ අතර ලැඩී පෙරේරාව ඔහුගේ සගයකු වූ පී.ඩී.එස්. කුලරත්න, කොළඹ ආනන්ද විද්‍යාලයේ විදුහල්පතිවරයා ලෙස කටයුතු කළ අයෙකි. කුලරත්න මරදානේ \"නැෂනල්\" නමින් නාට්‍ය සමාජයක් පිහිටුවමින් ඔහුගේ අලුත්ම නාට්‍ය සඳහා පෙරේරා සමඟ එක්විය.\n\nAwessa Bena\n\n.\n\nකෙසේ වෙතත්, එම නාට්‍යයෙන් පසුව ඔහු තවදුරටත් රඟපෑම ප්‍රතික්ෂේප කර ලංකා යුද හමුදාවට සහ රේස් අශ්වයාට අයදුම් කළේය. දෙකටම එකම දවසේ එන්න කියලා එයාට කෝල් ආවා.\n\n1942 දී පෙරේරාට බ්‍රිතාන්‍ය හමුදාවට බැඳීමට අවස්ථාව ලැබුණි. පෙරේරා වසර පහහමාරක් කාන්තාරයේ කැලෑවල සතුරාට එරෙහිව මිත්‍ර හමුදාව සමඟ සටන් කළේය. ශ්‍රී ලංකාවට පැමිණි පසු ඔහු රාජ්‍ය සේවයට එක් විය. ඔහු කෙටි කාලයක් කුරුණෑගල කච්චේරියේ සේවය කළ අතර පසුව කොළඹ බෘක්බොන්ඩ් සමාගමේ නියෝජිතයෙකු ලෙස සම්බන්ධ විය. එහිදී ඔහු වෘත්තීය අයිතිවාසිකම් ඉල්ලා 1953 හර්තාලයට සම්බන්ධ විය. ඔහු එකල දැඩි වාමාංශිකයෙකි. දිගින් දිගටම පැවති හර්තාලය නිසා බෘක්බොන්ඩ් කළමනාකරු ඇන්තනිව මීගමුව ශාඛාවට මාරු කළේය. හැඳල විජය චිත්‍රාගාරයේ නිෂ්පාදන කළමනාකරු ලෙසත් කටයුතු කළා.\n\nවසර ගණනාවක රාජ්‍ය සේවයෙන් පසු පෙරේරාට ජාඇල රත්නාවලී සිනමාහල හිමි ඔහුගේ මිතුරෙකු වූ එච්.එම්.එල්.තිසේරා හමුවිය. පෙරේරා සිනමාස් චිත්‍රපට සංස්ථාවේ හිමිකරු කේ.ගුණරත්නම්ට තිසේරා හඳුන්වා දුන්නේය. පෙරේරා මුණගැසුණේ ඒ අතරතුරය\n\nහියුගෝ ප්‍රනාන්දු\n\n ඒ වගේම චිත්‍රපටයේ රඟපාන්න අවස්ථාව ලැබුණා\n\nසුරයා\n\n ඉන්දියානු චිත්‍රපට නිෂ්පාදකයින් වන S. V. ක්‍රිෂ්ණා රෙඩ්ඩි සහ T. R. සුන්දරම් විසින් සම අධ්‍යක්ෂණය කරන ලදී. වැනි ජනප්‍රිය චිත්‍රපට රැසක රඟපෑවා\n\nවන මෝහිනී\n\n,\n\nසංදේශය\n\n,\n\nවීර විජය\n\n හා\n\nරන්මුතු දූව\n\n. ඔහු චරිතාංග චරිතවල සිට විකට චරිත දක්වා බොහෝ ප්‍රභේද හරහා චිත්‍රපට 70 කට වඩා රඟපා ඇත. පෙරේරා 1965 දී සෝනියා දිසා සිංහල සිනමාවට හඳුන්වා දුන්නේය.\n\nඔහු චිත්‍රපටවල හාස්‍යජනක චරිත රාශියක් රඟපෑවේය\n\nහතර දෙනම සූරයෝ\n\n,\n\nEdath Suraya Adath Suraya\n\n,\n\nඅල්ලපු ගෙදර\n\n,\n\nචණ්ඩියා\n\n හා\n\nසිංගප්පූරු චාලි\n\n. ඔහු චිත්‍රපටයේ විවිධ චරිත පහක රඟපෑවා\n\nහොන්දම වැලව\n\n. ඔහු චිත්රපටයේ රඟපෑවේය\n\nසිංගප්පූරු චාලි\n\n විග් එකක් දාගෙන දෙබස් රචකයා විදියටත් වැඩ කළා. හි, ඔහු විසින් චිත්‍රපටයේ තිර රචනය, කතාව සහ දෙබස් රචනා කර අධ්‍යක්ෂණය කරන ලදී\n\nහොන්ඩින් ඉන්නා\n\n. 1977 න් පසු ඔහුට එතරම් චිත්‍රපට ලැබුණේ නැත. මෙම නිදහස් කාලය තුළ ඔහු Paddle Chase නවකතා කියවීමට කැමති විය. 1986 දී ඔහු වේදිකා නාට්‍ය නිෂ්පාදනය කළේය\n\nයම ලොව පෙරළිය\n\n."
    },
    {
        "name": "ජගත් වික්‍රමසිංහ",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1 ජනවාරි 1988",
        "Age": "අවුරුදු 33 යි",
        "Profiles": "",
        "description": "ජගත් වික්‍රමසිංහ\n\n (උපත 1966) ශ්‍රී ලාංකික සංගීතඥයෙකි. \"සාගර තරංග\", \"මගේ නංගෝ\", \"පෙම්වන්තයින් සේ\" සහ \"ඔබේ සිනා ලංගා\" ඔහුගේ හොඳම ගීත වේ. ඔහු විනිසුරුවන් තිදෙනාගෙන් කෙනෙකි\n\nසිරස සුපර්ස්ටාර්\n\n"
    },
    {
        "name": "ලයනල් රන්වල",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "සංගීතඥයෙක්\n\nගායකයා\n\nනිර්මාපකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1939 නොවැම්බර් 27, ශ්‍රී ලංකාව",
        "Death": "2002 නොවැම්බර් 13, තලවතුගොඩ\n\n(වයස අවුරුදු 63)",
        "description": "ලයනල් රන්වල (1939 නොවැම්බර් 27 - 2002 නොවැම්බර් 13) ශ්‍රී ලංකාවේ සංගීතඥයෙක් සහ ගායකයෙක් විය.\n\nරන්වලගේ ප්‍රධාන උනන්දුව වූයේ ශ්‍රී ලංකාවේ සිංහල ජන සංගීතයයි. ජනප්‍රිය ශ්‍රී ලාංකේය සංගීතයට සිංහල ජන නාද සහ තනු නිර්මාණය සාර්ථක ලෙස ගෙන ආ ඔහු, ඒවායේ ප්‍රභවය රැක ගනිමින් ඉන්දියාවේ චන්දිගාර් හි පන්ජාබ් විශ්වවිද්‍යාලයෙන් සංගීතය හැදෑරූ අතර ක්ෂේත්‍රය පිළිබඳ ඇඹුල් දැනුමක් ඇත්තෙකි.\n\nතම ගුරුවරයා වූ ඩබ්ලිව් ඩී මකුලොළුව සමඟ එක්ව දේශීය ජන සංගීත ක්ෂේත්‍රයේ පෙරළියක් ඇති කළ රංවල 1959 වසරේ ඇරැව්වල MMV හි ගුරු වෘත්තිය ආරම්භ කළේය. 38 වසරක කාලය තුළ ඔහු ආනන්ද විද්‍යාලය, කොළඹ රාජකීය විද්‍යාලය ඇතුළු ප්‍රධාන පෙළේ පාසල් කිහිපයක සංගීතය ඉගැන්වීය. වෘත්තීය. ඔහු පාසල් තුළ දේශීය සංගීතය ප්‍රචලිත කළ අතර 1964 දී පන්නිපිටිය ධර්මපාල විද්‍යාලයේදී පාසලක පළමු ‘හේවිසි’ සංගීත කණ්ඩායම පිහිටුවීය. ඔහුගේ අමතක නොවන චරිතයක් වූයේ මකුලොළුව විසින් අධ්‍යක්ෂණය කළ පළමු සිංහල ඔපෙරා ‘දෙපානෝ’ ය. ඔහු ළමා නාට්‍ය කිහිපයක් රචනා කොට අධ්‍යක්ෂණය කර ඇත. ඔහු ටෙලි නාට්‍ය කිහිපයකම රඟපෑවා.ඔහුගේ අවසන් ටෙලිනාට්‍යය ස්වර්ණවාහිනියේ විකාශය වූ \"රංගමඬල සමුගනි\"යි.\n\nඔහු දිවයින පුරා සංචාරය කළේ අනාගත පරපුර සඳහා ජන ගී එකතු කරමිනි. දේශීය සංගීතයේ දැඩි ආරක්ෂකයෙකු වන ඔහු පර්යේෂණාත්මක ජන සංගීතය ඇතුළත් කැසට් පට කිහිපයක් නිකුත් කළේය, විශේෂයෙන් 'අහසේ ඉන්නවලු' 1999 දී. ඔහු ජන සංගීතය සුරැකීම සඳහා 'තාලම පදනම' පිහිටුවා ගත්තේය. \"ගම අහුලග්ගං\", \"මැයි අවුරුදු කාලේ\" සහ \"වන්නම් සවුදම්\" ඔහුගේ ජනප්‍රිය ගීත කිහිපයකි.\n\nඔහුට චිරන්ත සහ සහන් යනුවෙන් පුතුන් දෙදෙනෙකි. වැඩිමහල් චිරන්ත ස්වර්ණවාහිනියේ නිවේදකයෙක් සහ නිෂ්පාදකවරයෙකි. සහන් ද ස්වර්ණවාහිනියේ සේවය කරයි, නමුත් ඔහුගේ පියාගේ හදිසි අභාවයෙන් පසු, ඔහුගේ පියා කළ ආකාරයටම සිංහල ජන සංගීතය සුරැකීමට සහ ජනතාව දැනුවත් කිරීමට දැන් මූලිකත්වය ගෙන ඇත. .\n\n2002 වසරේ තලවතුගොඩදී වයස අවුරුදු 63 දී හදිසි අනතුරකින් රන්වල මිය ගියේය. ඔහුගේ බිරිඳත් අනතුරට මුහුණ දී බරපතළ තුවාල ලැබුවා. වේදිකා නාට්‍ය නිෂ්පාදනය කළා\n\nEka gediyay pala gaththe\n\nබීරි අලි\n\nනොගිය ගමන\n\n ගීත\n\nAhase Innawalu\n\nඅහුවම කන් පිරෙන\n\nඅකුලගෙන සොන්දා\n\nකෙලිපොද්ද බලේදි\n\nමම අවුරුදු කැලේ\n\nමිතුරු සරොහුර\n\nපාන්කිරිත්ති\n\nපසුණු කරල්\n\nසඳ සාවී මා\n\nසවනත් කිනිහාර\n\nසෝයා\n\nවන්නම් සවුදම්\n\nයුද්දෙටත් ඇවිත්"
    },
    {
        "name": "ක්ලැරන්ස් විජේවර්ධන",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1943 අගෝස්තු 3, හපුතලේ",
        "Death": "1996 දෙසැම්බර් 13\n\n(වයස අවුරුදු 53)",
        "description": "විතාන කුරුප්පු-ආරච්චිලාගේ ක්ලැරන්ස් ආතර් සෝමසිංහ විජේවර්ධන (ජනප්‍රිය සහ පොදුවේ හඳුන්වනු ලබන්නේ ක්ලැරන්ස් විජේවර්ධන; සිංහල: ක්ලැරන්ස් විජේවර්ධන; අගෝස්තු 3, 1943 - දෙසැම්බර් 13, 1996) ඔහුගේ ජනප්‍රියත්වයට සහ දායකත්වයට අනුව ශ්‍රී ලංකාවේ වඩාත්ම ගෞරවනීය සංගීතඥයෙකි. සිංහල සංගීතයේ ඉලෙක්ට්‍රික් ගිටාර් භාවිතයට පුරෝගාමී වූ ශ්‍රී ලාංකේය සිංහල පොප් සංගීත කර්මාන්තයේ විප්ලවයක් ඇති කරන්න. මෙය 1960 ගණන්වල සිදු වූ අතර බොහෝ විට ශ්‍රී ලාංකේය පොප් සංගීතයේ ගෝඩ්-ෆාදර් ලෙස නම් කෙරේ - ඩබ්ලිව්. ඩී. අමරදේව, ප්‍රේමසිරි කේමදාසගේ සිට අතුල අධිකාරි දක්වා වූ ගායක ගායිකාවන්ට බලපෑම් කර ඇත. ඔහුගේ සංගීතය බොහෝ විට විද්‍යුත් ගිටාරය ඇතුළත් තනුවක් වටා ගොඩනගා ඇති සරල තනු වලින් සංලක්ෂිත වේ - මෙම ශෛලිය මලට බඹරකු සේ. මුල් ජීවිතය ගීතයෙන් වඩාත් හොඳින් නිරූපණය කළ හැකිය.\n\nක්ලැරන්ස් විජේවර්ධන 1943 අගෝස්තු 3 වන දින ශ්‍රී ලංකාවේ හපුතලේ දී වතු වෛද්‍යවරයෙකුට දාව උපත ලැබීය. ඔහුගේ පවුල රත්නපුර, බටුගෙදර ප්‍රදේශයට පදිංචියට ගිය අතර, ක්ලැරන්ස් පූර්ණකාලීනව සංගීතය හැදෑරීම සඳහා අංකුර වැවිලිකරුවෙකු ලෙස වෘත්තීය ජීවිතය අත්හැරියේය. ඔහු ශීලා රාමදාස සමඟ විවාහ වූ අතර ඔවුන්ට අමිලා ප්‍රියදර්ශනී නම් එක් දියණියක් සිටියාය.\n\n සඳකඩපහණ\n\nවිජේවර්ධන වයස අවුරුදු 21 දී ඇනස්ලි මාලේවන ප්‍රධාන ගායකයා ලෙස සඳකඩ පහණ නිර්මාණය කළේය. ශ්‍රී සඟබෝ කොරයා නම් වෙළඳ ප්‍රචාරණ නිරූපකය විසින් කළමනාකරණය කරන ලද මෙම කණ්ඩායම 1966 දී සෙනසුරාදා ස්ටාර් වැඩසටහනේ විකාශය කිරීමට ගීත කිහිපයක් පටිගත කරන ලදී. තරුණ සංගීතවේදීන් ශ්‍රී සඟබෝ කොරයා විසින් ප්‍රවීණ රේඩියෝ සිලෝන්/එස්එල්බීසී විකාශකයින් වන වර්නන් කොරයා සහ විජය කොරයා සමඟ උපදේශකත්වය ලබා ගත්හ. ඔවුන්ගේ 1968 මංගල EP\n\nඅඹ නන්දා\n\n පිටපත් 5,000ක් දක්වා අලෙවි වන JVPC007 Philips ලේබලය මත නිකුත් කරන ලදී. එයට \"අඹ නන්ද\", \"රුවන් පුරය\", \"සීතා උඩ\" සහ \"මැණිකේ\" ගීත ඇතුළත් විය. දෙවන වසර නිකුතුව\n\nMoonstones විසින් තවත් පහරවල්\n\n එම වසරේ නොවැම්බරයේදී සූරිය ලේබලය මත තිරගත වූ අතර \"කළු මාමා\", \"රෝස මල\", \"රමණී\" සහ \"ගොයම් කැපනවා\" යන ගීත ඇතුළත් විය. රේඩියෝ සිලෝන්හි Hit Parade වැඩසටහන මගින් හොඳම සිංහල ගීතය ලෙස \"Mango Nanda\" තේරී පත් විය. 1969 දී Moonstones විසින් කාන්තා ගායන ශිල්පිනී ඉන්ද්‍රානි පෙරේරා පිළිගනු ලැබුවේ වැඩියෙන්ම අලෙවි වූ \"දිල්හානි\" ගීතයේ ප්‍රමුඛයා ගායනා කළ ගායිකාවකි. කරුණාරත්න අබේසේකර විසින් තම පුතුට ලියූ කවියක අනුවර්තනයක් වූ \"දිලීප පොඩි පුතු\" ගීතයට විජේවර්ධන විසින්ම ගායනා කළේ ඊයම් පමණි.\n\n‘සඳකඩ පහණ’ යුගයේදී තනු නිර්මාපකයෙකු හා සංගීත අධ්‍යක්ෂකවරයෙකු ලෙසින් දස්කම් පෑ විජේවර්ධන ගායකයෙකු බවට පත් විය. විජේවර්ධන ත්‍රිපුද්ගල සංගීත කණ්ඩායමක් ආරම්භ කිරීමට මූලිකත්වය ගත් අතර, ඔහු ස්වයං-ඉගැන්වූ ගිටාර් වාදකයෙකි. කෙසේ වෙතත්, පසුව 'මූන්ස්ටෝන්ස්' නිර්මාණය වූයේ ඇනස්ලි මාලවන ප්‍රධාන ගායකයා ලෙස ප්‍රධාන චරිතය රඟපාමිනි. එතැන් පටන් මෙම සුවිශේෂී මිනිසා සහ ඔහුගේ සංගීතය සිංහල පොප් සංගීත ක්ෂේත්‍රයේ ආධිපත්‍යය දැරීය. ඔහු සිංහල ජනප්‍රිය සංගීත ක්ෂේත්‍රයේ පුරෝගාමී ශ්‍රී ලාංකේය සංගීතඥයෙකු ලෙස බොහෝ දෙනා විසින් සලකනු ලැබේ.\n\nඔහු 1970 වසරේ සඳකඩ පහණින් ඉවත් වූ පසු ශානක පෙරේරා සහ විජිත් පීරිස් සමඟ මොරටුවේදී සංගීත සංදර්ශනයක් පැවැත්වූ අතර එම සංදර්ශනය නම් කර තිබුණේ \"සඳකඩ පහණින් බිඳී යාම\" ලෙසිනි. ක්ලැරන්ස්ගේ නික්ම යාමෙන් පසු දිවංගත මයික් ගුණසේකර සඳකඩපහණේ පාලනය භාර ගත්තේය.\n\n ගෝල්ඩන් චයිම්ස්\n\nවිජේවර්ධන සඳකඩ පහණින් ඉවත්ව ගෝල්ඩන් චයිම්ස් නමින් නව සංගීත කණ්ඩායමක් පිහිටුවා ගත් අතර, හිටපු මූන්ස්ටෝන්ස් වාදකයෙකු වන චානක පෙරේරා සහ ලංකික පෙරේරා සමඟ 1971 ජනවාරි මාසයේදී නව සංගීත කණ්ඩායමක් පිහිටුවන ලදී. ඔවුන්ගේ පළමු නිකුතුවට \"කිමදේ නාවේ\", \"මගේ පැල්පතේ\", \"සිහින් සිනාවයි\" සහ \"සමනලයෝ\" ඇතුළත් විය. .\" පසුව ඉංග්‍රීසි භාෂා ගායන ශිල්පී අනිල් භාරතීද එක්විය. Philips ලේබලයේ දෙවන EP හි \"මලෙයි වේලයි\", \"සිහිල් නුවන්\", \"සුරංගනා වෙස්වල\" සහ \"මගේ වියෝවෙන්\" සහ තෙවන EP හි \"ඉරු දින\", \"සඳයි තරුයි\", \"මුහුදු රැල්ල\" සහ \"තක්කිට තරිකිට\" අඩංගු විය.\n\nමේ වෙලාවේ විජේවර්ධනට මඟුල් ගෙදරක දී වෘත්තීය ලීඩ් ගිටාර් වාදකයකු වන ඩික්සන් ගුණරත්න හමුවුණා.\n\nවසරක් භාරතීගේ රංගනය ඇගයීමෙන් පසු විජේවර්ධන ඔහුව සිංහල පොප් සංගීත ක්ෂේත්‍රයට ඇතුළත් කිරීමට තීරණය කළේය. විජේවර්ධන භාරතී වෙනුවෙන් රචනා කළ \"ආද වෙයි ඉරු දින\" එය සර්වකාලීන ජනප්‍රියත්වයට පත් වූ අතර ඉන් පසුව \"බෙත්ලෙහෙම්පුරේ\" සහ \"මා ආදරේ නංගියේ\" යන සොඳුරු නත්තල් ගීතයද විය. \"මා මුලින් ලියු පෙම් පතේ\", \"දෙස විදලා\", \"බඹරකු අදුන\", \"සරෝජිනී\" සහ \"ඉරු දින පමනක්\" සමඟින් ක්ලැරන්ස් ඔහුට තවත් සර්වකාලීන ජනප්‍රිය \"ටිකිරිමලී\" පිරිනැමීය.\n\n1972 දී විජේවර්ධන සහ ගුණරත්න ගෝල්ඩන් චයිම්ස් වෙතින් ඉවත් වූ අතර ඔවුන් දෙදෙනාම 1973 දී ඇනස්ලි මාලවනගේ සහාය ඇතිව සුපර් ගෝල්ඩන් චයිම්ස් නමින් නව සංගීත කණ්ඩායමක් පිහිටුවා ගත්හ.\n\n සුපර් ගෝල්ඩන් චයිම්ස්\n\nසුපර් ගෝල්ඩන් චයිම්ස්.\n\nවිජේවර්ධන \"සුපර් ගෝල්ඩන් චයිම්ස්\" පිහිටුවා ගත්තේ ඔහුගේ සදාකාලික මිතුරා වූ ඇනස්ලි මාලවනගේ ඇසුරෙනි. එය ශ්‍රී ලංකාවේ වඩාත්ම ඵලදායි සංගීත කණ්ඩායමක් වූ අතර ඔවුන් එක්ව ලංකා ගුවන්විදුලි සිංහල සහ ඉංග්‍රීසි සේවා දෙකෙහිම සහ පසුව ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවේ ශ්‍රී ලාංකීය සංගීත ප්‍රස්ථාරවල අංක එකේ ස්ථානයට පත්විය. වසර ගණනාවක් ඔවුන් 1970 සහ 1980 ගණන් වලදී ශ්‍රී ලංකාවේ අංක එකේ කණ්ඩායම ලෙස කීර්තිය භුක්ති වින්දා. වසර තුනකට පසු ඇනස්ලි මාලේවන තම විවාහ සැලැස්ම ප්‍රකාශ කළ විට විජේවර්ධන තනිවම යාමට තීරණය කළේය.\n\n සංගීතය පිළිබඳ අත්හදා බැලීම්\n\nවිජේවර්ධන බීට්ල්ස් සංගීත කණ්ඩායම මෙන් සිතාර් සංගීතය අත්හදා බලමින් ‘මූන්ස්ටෝන්ස්’ හි ඇතැම් ගීත සඳහා සිතාරය හඳුන්වා දුන්නේය. විජේවර්ධන සංගීතඥයාගේ සංගීතඥයෙක් විය. නූතන ජනප්‍රිය සංගීතයේ නව ප්‍රවණතා ග්‍රහණය කර ගැනීමේ හැකියාව ඔහුට තිබුණි. ඔහු ප්‍රථම වරට (පටිගත කිරීමක් සඳහා) 'පෙම්කත්වාව' ගීතය සඳහා ගිටාර් වා වා පැඩලය භාවිතා කළේය. එමෙන්ම 'සීගිරිය' ගීතය ලංකාවේ ප්‍රථම බොසා නෝවා බීට් ගීතය වූ අතර පසුව ඔහු පියාණෙනි, මගේ පැල්පතේ, මුහුදු රැල්ල, රනින් පියාඹන්න, මාලිනියේ, රම්‍යා (මීට පෙර 4/4 බීට් වලින් විජේවර්ධන විසින් ගායනා කරන ලදී) යන ගීත සඳහා මෙම බීට් එක යොදා ගත්තේය. , රන් මොණරුන් (වින්ස්ලෝ සික්ස්), ලලිත කලා (චිත්‍රා සෝමපාල) යනාදී වශයෙන්. ඒ වගේම සුමුදු මල් පිපිනු, දිලීප පොඩි පුතු ආදී ගීතවල ප්‍රධාන කොටස් සහ ප්‍රතිපක්ෂ වාදනය කිරීමට ඔහු ගිටාර් වාදකයින් දෙදෙනෙකු භාවිතා කළේය. ඔහු ලංකාවේ ප්‍රථම වරට භාවිතා කළේය. 'කුසුමලතා' ගීතය සඳහා අවහිර වූ ගිටාර් නාදය. විජේවර්ධනයන් \"දෙල්ලේප පොඩි පුතු\" සහ \"සිහින ලොවක්\" සහ \"මලට බඹරැකු සේ\" යන චිත්‍රපටවල ආර්පෙජියෝ ශෛලීන් හඳුන්වාදීමේදී ගිටාර් ශිල්පීය ක්‍රම කිහිපයක් ඔහුගේ ගීත හරහා තනි ගිටාර් සුසංයෝග ශෛලියකින් හඳුන්වා දුන්නේය.\n\nවිජේවර්ධනයන් 1960 දශකයේ \"Twist\" ශෛලියේ Ma langin ගීතයක් රචනා කළ අතර 1989 දී \"Ugayen ugayata\" කැසට් පටයට එම ගීතය නිකුත් කරන ලදී.\n\n\"දිනේක මේ නදී තිර\" සඳහා ඔහු හැඳින්වීම සඳහා භාවිතා කළේ ගොළු ගිටාර් තාක්ෂණයයි. ක්ලැරන්ස් ඔහුගේ ගීත සඳහා භාවිතා කරන සමහර ගිටාර් ශිල්පීය ක්‍රම නම් විකල්ප තෝරා ගැනීම, කුකුළු මස් තෝරා ගැනීම, කාටර් පවුල තෝරා ගැනීම, හරස් තෝරා ගැනීම, පැතලි තෝරා ගැනීම, ගෝල්පේ, මිටිය-ඔන්, ලෙගාටෝ, පික් ටැපිං, පින්ච් හාර්මොනික්, පුල්-ඕෆ්, ස්ලයිඩ් ගිටාර්, ස්වීප් පික්කින් ය. හා හාර්මොනික් තට්ටු කරන්න.\n\n උපහාර ගීත\n\nවිජේවර්ධන තම හිතමිතුරන්ගේ නෑදෑ හිතමිතුරන්ගේ දූ පුතුන් වෙනුවෙන් ගීත රැසකට රචනා කර සංගීත අධ්‍යක්ෂණය කර ඇත. ඔහු 'පියනෙනි' රචනා කළේ රේඩියෝ සිලෝන් විකාශක වර්නන් කොරයාගේ පියා වූ දිවංගත කැනන් අයිවන් කොරයා අනුස්මරණය කිරීම සඳහා ය. 1960 ගණන්වල වර්නන් කොරයා හමුවීමට ගිය චාරිකාවලදී විජේවර්ධනට කොරයා හමුවී ඇත්තේ මහ නුගේ උද්‍යානයේදීය. මෙම ගීතය දකුණු ආසියාවේ ක්ෂණික ජනප්‍රියත්වයට පත් වූ අතර අද දක්වා එය ඇනස්ලි මාලේවන විසින් ඔහුගේ ලෝක සංචාරවලදී ගායනා කරයි.\n\nවිජේවර්ධන විසින් විජය කොරයාගේ පුත්‍රයා වෙනුවෙන් ගීතයක් නිර්මාණය කළ අතර එය \"විරන් බිළිඳු පුතේ\" ලෙස නම් කර තිබුණා. ඉන්පසුව විජේවර්ධන එම ගීතයේ කෝරස් කොටස වෙනස් කර කිරි මුහුද කළාබල ලෙස එම ගීතය ගායනා කළා. එසේම විජේවර්ධන චානකගේ සහ ලංකික පෙරේරාගේ පුත්‍රයා වෙනුවෙන් නිර්මාණය කළ ගීතයක් \"සිහින පැතුම් විමනේ\" ලෙසින් නම් කර තිබූ අතර ශ්‍රී ලංකාවේ කීර්තිමත් ගී පද රචක කරුණාරත්න අබේසේකර මහතා විසින් රචනා කරන ලද \"බෙත්ලෙහෙම්පුරේ\" ගීතයද දිවයිනේ ක්ෂණික ජනප්‍රියත්වයට පත්විය. එය නත්තල් ආත්මය සහ ජේසුස් වහන්සේගේ උපත ග්‍රහණය කරගත් බොහෝ ගීත වලින් එකකි. විජේවර්ධන ද 1970 දශකයේ මුල් භාගයේදී ‘නත්තල් සීය’ රචනා කළේය.\n\nවිජේවර්ධනගේ ප්‍රථම ඒක පුද්ගල ගීතය වන 'දිලීප පොඩි පුතු' ලියා ඇත්තේ රේඩියෝ සිලෝන් විකාශක කරුණාරත්න අබේසේකර විසින් ඔහුගේම පුතා වෙනුවෙන් ය. විජේවර්ධන කරුගේ කාර්යය අගය කළ අතර කරුණාරත්න අබේසේකරයන්ගේ අවමංගල්‍ය දිනයේදී කෘතඥතාව පළ කිරීමට සීතා පවන් ගීතයක් ලිවීය.\n\n සිනමා සංගීතය\n\nවිජේවර්ධන චිත්‍රපට සංගීත ක්ෂේත්‍රයට පිවිසෙන්නේ ඒ කාලයේදීය. විජේවර්ධන සංගීත අධ්‍යක්ෂණය කළ පළමු චිත්‍රපටය 'සිකුරුලිය' වන අතර එහි හඬ පටය සපයන ලද්දේ ගෝල්ඩන් චයිම්ස් විසිනි - චිත්‍රපටයේ විජේවර්ධන සහ ගෝල්ඩන් චයිම්ස් සාදයක ​​රඟ දක්වන දර්ශනයක් ඇතුළත් වේ. ඒ වගේම සිකුරුලිය චිත්‍රපටයේ ගීතවල සංගීතය සඳහා විජේවර්ධන බටහිර සංගීත භාණ්ඩ වගේම පෙරදිග සංගීත භාණ්ඩත් භාවිත කළා. විජේවර්ධනයන් විසින් රචනා කරන ලද ‘වසන්තයේ මල් කැකුලේ’ ගීතය එම ගීතයේ ගායන කොටසේ පේළි පහකින් සමන්විත පළමු ගීතය විය. ඔහු චිත්‍රපට සඳහා සංගීතය අධ්‍යක්ෂණය කළේ ඔහුටම ආවේණික වූ වෙනස්ම ශෛලියකින්.ඒ වගේම H.D.ප්‍රේමරත්න විසින් අධ්‍යක්ෂණය කරන ලද \"අපේක්ෂා\" චිත්‍රපටයේ සංගීතය නිර්මාණය කළා.\n\n කැපී පෙනෙන කුසලතා\n\n Super Golden Chimes LP.\n\n 1980 ගණන්වල මුල් භාගයේ ක්ලැරන්ස්.\n\nවිජේවර්ධනයන් මේ කාලය තුළ සිය විශිෂ්ට සංගීත කුසලතාවයන් පෙන්නුම් කළේය. ඔහු 1975 වසරේ ශ්‍රී ලංකාවේ පැවති නොබැඳි ජාතීන්ගේ සමුළුව සඳහා \"මහ බලවතුනේ\" නමින් ගීතයක් රචනා කර සංගීත අධ්‍යක්ෂණය කළේය. ඔහු SAARC සමුළුව සඳහාද ගීතයක් රචනා කර සංගීත අධ්‍යක්ෂණය කළේය. ඒ සමගම ඔහු \"දුවනි සිරිමා\" ගීතය ගායනා කරන විට ගරු. සෙරමික් සංස්ථාව විවෘත කිරීමේ උත්සවයේ ප්‍රධාන ආරාධිතයා ලෙස හිටපු අගමැතිනි සිරිමාවෝ බණ්ඩාරනායක මැතිනිය පැමිණියා. ඒ වගේම ඒ සමාරම්භක උත්සවයට සංගීතය සැපයුවේ Super Golden Chimes. විජේවර්ධන Pop and Teen Fanfare විසින් පවත්වන ලද පොප් මත විමසුමකින් 1974 සහ 1976 වසර සඳහා ශ්‍රී ලංකාවේ ජනප්‍රියම නිර්මාපකයා ලෙස සහතික විය. විජේවර්ධන විසින් රචනා කරන ලද \"කතරගම\" ගීතය Pop and Teen Fanfare විසින් පවත්වන ලද පොප් මත විමසුමකින් 1974 වසරේ ශ්‍රී ලංකාවේ හොඳම ගීතය ලෙසද සහතික කර ඇත. කතරගම දෙවියන් වෙනුවෙන් වැඩිම ගීත සංඛ්‍යාවක් නිර්මාණය කළේ විජේවර්ධනය.\n\n1970 දශකයේ මුල් භාගයේදී විජේවර්ධන විසින් ආරම්භයේ සිටම තමාට උපදේශකත්වය ලබා දුන් රේඩියෝ සිලෝන් විකාශක වර්නන් කොරයා හට ලෝටස් එල්පී කමිසයක සටහන් ලිවීමට ආරාධනා කළේය. Vernon Corea මෙසේ ලිවීය: \"අපි සියලු දෙනාම ඔබේ සුන්දර ගී පද, ඔබේ සුසර රචනා, ඔබේ සුහද ඉදිරිපත් කිරීම සහ ඔබේ අනුගාමිකයින් සමඟ බෙදාගැනීමේ ස්වයංසිද්ධ හැඟීම, ඔබේ දක්ෂතා භාණ්ඩාගාරය. දිගටම කරගෙන යන්න, වර්ධනය වෙමින්, දිදුලන්න\". 1976 දී ලන්ඩන් බීබීසී රේඩියෝවේ ලන්ඩන් සවුන්ඩ්ස් ඊස්ටර්න් නමින් ප්‍රථම ආසියානු ගුවන් විදුලි වැඩසටහන ඉංග්‍රීසියෙන් ඉදිරිපත් කිරීමට වර්නන් කොරයාට ආරාධනා ලැබුණු විට ඔහු විජේවර්ධන සහ ඇනස්ලි මාලේවනගේ සංගීතය වාදනය කළේ ඔවුන් ලන්ඩනයේ නවක ප්‍රේක්ෂක පිරිසකට හඳුන්වා දෙමිනි.\n\nවිජේවර්ධන වෙනත් සංගීත අධ්‍යක්ෂවරුන් යටතේ සිංහල චිත්‍රපට සඳහා ගායනා කිරීමට පටන් ගත්තේය. ඉන් අනතුරුව \"ඕනෑම වේලාවක ඕනෑම තැනක\" නමින් කැසට් පටයක් කොළඹදී නිකුත් විය. 1979 දී විජේවර්ධන සුපර් ගෝල්ඩන් චයිම්ස් වෙතින් ඉවත් වී තනි වෘත්තියක් ආරම්භ කළේය.\n\n ක්‍රිකට් රසිකයෙක්\n\n1982 දී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම ටෙස්ට් ක්‍රිකට් ලෝකයට පිවිසෙන විට විජේවර්ධන නමින් ඇල්බමයක් නිෂ්පාදනය කළේය\n\nටෙස්ට් ක්‍රිකට් සිහිවටනය\n\n, ටෙස්ට් ක්‍රිකට් තත්ත්වය අත්කර ගනිමින් රට පැමිණෙමින්. සමන් ද සිල්වා විසින් ගායනා කරන ලද \"තන නිල්ල දිගේ\" ටෙස්ට් තරඟ සමය තුළ සහ කොළඹ පැවති සෑම මහා තරඟයකදීම ජනප්‍රිය විය. ඇල්බමයට අනෙකුත් දායකයන් වූයේ නිහාල් නෙල්සන්, මරියසෙල් ගුණතිලක සහ ෆ්‍රෙඩී සිල්වා ය.\n\nවිජේවර්ධන මහතා කනස්සල්ලට පත්ව ප්‍රකාශයක් කළේය\n\nසත්සර\n\n (ශ්‍රී ලංකාවේ කලා සඟරාවක්) \"තන නිල්ල දිගේ\" ගීතය සම්බන්ධයෙන් සහ එහි ගායක සමන් ද සිල්වාට එම ගීතය සඳහා නිසි ගෞරවය ලබා නොදුන් ආකාරය පිළිබඳව සහ එම ගීතය පිළිබඳ සම්පූර්ණ පිටුවක ලිපියක් නිකුත් කරන අවස්ථාවේ පුවත්පතක පළ කර තිබුණි. ගීතය සහ කැසට් පටය නමුත් නිර්මාපකයාගේ නම සඳහන් කර නැත\n\n නව වෘත්තිය\n\n ක්ලැරන්ස් සමග වර්නන් පෙරේරා, එච්.ඩී.ප්‍රේමරත්න සහ හේමසිරි හල්පිට.\n\nවිජේවර්ධන සීමාසහිත සින්ග් ලංකා සමාගමට සම්බන්ධ වී සාමාන්‍යාධිකාරීවරයා ලෙස කටයුතු කළේය. සිංග් ලංකා රෙකෝඩින් මැදිරිය බහු ධාවන පථ සහිත ශ්‍රී ලංකාවේ ප්‍රථම පටිගත කිරීමේ මැදිරිය වූ අතර මෙම පටිගත කිරීමේ මැදිරිය හඳුන්වාදීමේ පුරෝගාමියා වූයේ විජේවර්ධනය. එම කාලය තුළ ඔහු ශ්‍රී ලංකාවේ කලාකරුවන් රැසකට සංගීත අධ්‍යක්ෂණය කළේය. ඔහු \"ක්ලැරන්ස් විත් ද රයිසින් ස්ටාර්ස්\" නමින් කැසට් පටයක් ද නිෂ්පාදනය කළේය.\n\n ටෙලි නාට්‍ය සඳහා සංගීත අධ්‍යක්ෂණය\n\nවිජේවර්ධන සුසීමා සහ නිදිකුම්බා මල් ටෙලි නාට්‍ය සඳහා සංගීත අධ්‍යක්ෂණය කළේය. සුසීමා ටෙලි නාට්‍යයේ ගීත හයේම තනු නිර්මාණය සහ සංගීත අධ්‍යක්ෂණය කළේ ඔහුයි. මේ අතරතුර ඔහුට විශේෂ අවස්ථාවක් ලැබිණි. පණ්ඩිත් අමරදේවයන්ගේ සංගීත නිර්මාණය හා අධ්‍යක්ෂණය කිරීමට ඔහුට හැකි වූ බව. ඒ නිදිකුම්බා මල් ටෙලි නාට්‍යයේ අඩංගු සසර ගෙවා යන දිවි ගමනේ ගීතයයි. ඒ වගේම ළමා අපචාර සහ වර්තමාන සමාජයේ සිදුවන වෙනත් තහනම් දේවල් ගැන කියවෙන ගීතයක් රචනා කරලා සංගීත අධ්‍යක්ෂණය කළා. ඒ සිහිනය II කැසට් පටයේ අඩංගු \"දේසවන් දෑසේ\" ගීතයයි. දළදා මාලිගාවේ රාජකීය ඇතා මිය ගිය විට විජේවර්ධන විසින් රාජකීය ඇතා පිළිබඳ ගීතයක් රචනා කර සංගීත අධ්‍යක්ෂණය කළ අතර එය \"කඳු සිකරින් වට සෙංකඩගල පුර\" ලෙස නම් කර ඇත. එය ගායනා කළේ සිහ ශක්ති සංගීත කණ්ඩායමේ ප්‍රධානියා වූ ආනන්ද පෙරේරා විසිනි.\n\n ජිංගල් සඳහා තනු\n\nවිජේවර්ධන ප්‍රසිද්ධියට පත් වූයේ ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාව හරහා විකාශය වූ ඔහුගේ මධුර සහ ආකර්ශනීය ජිංගල් සඳහාය. මෙම ජිංගල්ස් නම් Elasto, Bata, Astra Margarine, Bristol Cigarettes, Arpico, Dot Toffee, Singer, Edna Chocolate, Thultex, Ice-Cream Soda, Development Lottery, Dasuna Cartoon Paper, Atlas පෑන්, Orex පෑන්, ගොඩනැගිලි ද්‍රව්‍ය සහයෝගිතාව (in) සිංහල සහ ඉංග්‍රීසි), කීල්ස් සහ හෙල්ත් ජෝයි සබන් ආදී රූ රැජින තරගය සඳහා ඔහු විසින් රචනා කරන ලද \"සීගිරි රූ ලදුන් පරදයි\" ගීතය ක්ෂණික ජනප්‍රියත්වයට පත්විය.\n\n නව ශ්‍රී ලාංකේය සංගීත කුසලතා සොයා ගැනීම\n\nඔහු රූකාන්ත ගුණතිලක (යතුරුපුවරු), මරියසෙල් ගුණතිලක (යතුරුපුවරු/කාන්තා ගායනය), රාජු බණ්ඩාර (ලීඩ් ගිටාර්), කෙනත් ද සිල්වා (බේස් ගිටාර්), අජන්තා දොඩම්පේගම (ඩ්‍රම්ස්) සහ සෙසු අය සමඟ 1985 දී ශ්‍රී ලාංකීය \"මධාරා\" සංගීත කණ්ඩායම පිහිටුවන ලදී. කණ්ඩායමේ අනෙකුත් සාමාජිකයින්. 1980 දශකයේදී ඔහු ගීත ගණනාවකට සංගීත නිර්මාණය සහ අධ්‍යක්ෂණය කළ අතර ශ්‍රී ලංකාවේ සුප්‍රසිද්ධ සංගීත අධ්‍යක්ෂවරුන් සමඟ ප්‍රසංග කළේය.\n\nවිජේවර්ධනගේ සියලුම රචනා දිවයිනේ හොඳම පටිගත කිරීමේ මැදිරි කිහිපයක සහ ශ්‍රී ලංකාවේ හොඳම නිෂ්පාදන ලේබල් යටතේ පටිගත කර ඇත. 1960 දශකයේ මුල් භාගයේ සමහර පටිගත කිරීම් තිබුණේ බම්බලපිටියේ ඕගී රණවීරගේ චිත්‍රාගාරයේ ය.\n\n පසුකාලීන වෘත්තිය\n\n ක්ලැරන්ස් සහෝදරියන් 3 දෙනෙකු සමඟ.\n\nවිජේවර්ධන කොළඹ බණ්ඩාරනායක ජාත්‍යන්තර සම්මන්ත්‍රණ ශාලාවේදී සිය ජීවමාන මිතුරෙකු වූ ඇනස්ලි මාලේවන සහ ඉන්ද්‍රානි පෙරේරා සමඟ සංගීත සංදර්ශන තුනක් සංවිධානය කළේය.\n\nවර්නන් කොරයා බීබීසී රේඩියෝවේ ලන්ඩන් 206 හි ඔහුගේ ජනප්‍රිය ගුවන් විදුලි වැඩසටහනෙන් ඔහුගේ සංගීතය විකාශනය කළ විට විජේවර්ධන ලන්ඩනයේ බෙහෙවින් ජනප්‍රිය විය.\n\nලන්ඩන් සවුන්ඩ්ස් ඊස්ටර්න්\n\n. විජේවර්ධන සහ ඇනස්ලි 1980 ගණන් වලදී ලන්ඩනයේ විශාල ප්‍රේක්ෂක පිරිසක් සමඟ නිතර නිතර එක්සත් රාජධානියේ සංචාරය කළහ.\n\n මතභේදය\n\nකෙසේ වෙතත්, ඔහුගේ ගීතවල ජනප්‍රියතාවය හේතුවෙන් (එය ඔහුගේ මරණයෙන් පසු වර්ධනය වී ඇත), ඒවා නීති විරෝධී ලෙස ශ්‍රී ලංකාවේ අනෙකුත් කලාකරුවන් විසින් සාම්පල කර ඇති නීති විරෝධී ලෙස පටිගත කරන ලද ගීතිකා සම්බන්ධයෙන් නඩුවකට ද විෂය වී ඇත. විජේවර්ධනගේ වැන්දඹු බිරිඳ වන ශීලා විජේවර්ධන 2001 දී රජිව් සෙබස්තියන්ට එරෙහිව නඩුවක් ගොනු කළේ තම නැසීගිය සැමියාගේ රැකියාවෙන් උපයාගත් ආදායමෙන් කොටසක් අයකර ගැනීමට අපේක්ෂාවෙනි. පැමිණිලිකරුගේ පාර්ශ්වයෙන් සාක්ෂි නොමැතිකම හේතුවෙන් අසාර්ථක වූ ක්‍රියාවක්. රජිව්ට සහ සරත් කොතලාවෙලට එරෙහිව තිබූ නඩුවේ සිට ශීලා ක්ලැරන්ස්ගේ දිගුකාලීන මිතුරෙකු සහ සංගීත සහකරුවෙකු වූ ඇනස්ලි මාලවනට එරෙහිව වැරදි නඩුවක් ගොනු කර කිසිදු පිළියමක් නොමැතිව එය අහිමි විය. අද දක්වාම, ඔහුගේ බුද්ධිමය දේපලෙහි නීත්‍යානුකූල හෝ නීත්‍යානුකූල උරුමක්කාරයා ලෙස ඇයගේ නීත්‍යානුකූල හිමිකම් තහවුරු කිරීමට ඇයට නොහැකි වී ඇත.\n\n සංගීතය\n\nශ්‍රී ලංකාවේ සංගීතඥ ක්ලැරන්ස් විජේවර්ධන විසින් ගීත 1000කට අධික ප්‍රමාණයක් රචනා කර ගායනා කළ නමුත් ඉන් 40%ක් ප්‍රධාන පටිගත කිරීම් තැටි නිෂ්පාදකයින්ගේ භාරයේ තිබූ බැවින් ඒවායින් 40%ක් නිකුත් නොකළේය. ඔහුගේ මරණයෙන් පසු සමහර ගීත කිසිදු අවසර ලත් ලේබලයක් නොමැතිව වෙළඳපොළට නිකුත් විය. ඒවා ඔහුගේ රසිකයින්ගේ අවධානයට ලක් නොවුනේ ඒවා නීතිවිරෝධී ලෙස සැලකීම සහ ලංකාවේ බොහෝ එෆ්.එම් විකාශන නාලිකා ඒවා නොදැන සිටි නිසාය. මෙම ගීත බොහොමයක් නිල වශයෙන් නිකුත් නොවීම සහ ඒවාට නිසි ගෞරවය විජේවර්ධනට නොලැබීම කනගාටුවට කරුණකි.\n\nවිජේවර්ධන තම ගීත රචනය සඳහා වැඩි කාලයක් වැය කළේ තම සහෝදර ගායක ගායිකාවන් වෙනුවෙන් වන අතර ඔහුට කිසි දිනක ඔවුන් වෙනුවෙන් ගෞරවය පිරිනැමුණේ නැත.\n\nඔහුගේ වෘත්තීය ජීවිතය තුළ, විජේවර්ධන ඔහුගේ කාලය තුළ සම්භාව්‍ය බවට පත් වූ ගීත කිහිපයක් ලිවීය - මේ අතර;\n\nGamen Liyumak\n\n (පරිවර්තනය: ගමෙන් ලිපියක්)\n\nහිරුගේ ලෝවැඩි\n\n (පරිවර්තනය: සූර්යයාගේ ලෝකයේ)\n\nකන්ද සුරිඳුනී\n\n (\"අනේ කන්දේ දෙවියනේ\")\n\nපියනේනි\n\n (\"පියා\"), සහ\n\nමලට බඹරකු සේ\n\n (පරිවර්තනය: මී මැස්සෙකු මලකට මෙන්)\n\n මරණ\n\n බොරැල්ල කනත්තේ ක්ලැරන්ස් විජේවර්ධනගේ ගල් ස්මාරකය (සොහොන්).\n\nඋග්‍ර දියවැඩියා රෝගය හේතුවෙන් පිපිරුණු ආමාශයික වණ සහ ගන්ග්‍රීන් වලට එරෙහිව දීර්ඝ අරගලයකින් පසු විජේවර්ධන ශ්‍රී ලංකාවේදී වයස අවුරුදු 53 දී 1996 දෙසැම්බර් 13 දින මිය ගියේය.\n\n උරුමය\n\nඔහුගේ බොහෝ ගීත සම්භාව්‍ය ලෙස සලකනු ලබන අතර, ශ්‍රී ලංකාවේ රූපවාහිනී සහ ගුවන්විදුලි විකාශනවල සහ සමහර විදේශීය ගුවන්විදුලි මධ්‍යස්ථානවල ප්‍රමාණවත් විකාශන කාලයක් දිගටම භුක්ති විඳිති. රස පිරුණු කතා, ගීයකින් කෙසේ, ඈත රන් විමන් යොවුන් සිහින ලෝකේ ආදී ගීත වර්තමාන පරපුර අතර ඉමහත් ජනප්‍රියත්වයට පත්ව ඇති අතර ඒවා අනාගතයට සංගීතය (ගී පද රචකයෙකු ලෙසද) නිර්මාණය කිරීමට ඔහු සතු හැකියාව යළිත් විදහා පෑවේය."
    },
    {
        "name": "ෆ්‍රෙඩී සිල්වා",
        "info": "ශ්‍රී ලාංකීය නළු-ගායක",
        "Intro": "ශ්‍රී ලාංකීය නළු-ගායක",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1938 මැයි 18, මොරටුව",
        "Death": "2001 ඔක්තෝබර් 29\n\n(වයස අවුරුදු 63)",
        "description": "1977\n\nනිලූක\n\n1977\n\nචින් චින් නෝනා\n\n1977\n\nසාජා\n\n1977\n\nසිතක සුවඳ\n\nටින්ටින්\n\n1978\n\nසසර\n\n1978\n\nමධුවන්ති\n\nෆ්‍රෙඩී\n\n1978\n\nසිරිපතුල\n\n1978\n\nඅප්සරා\n\n1978\n\nදීපාංජලී\n\n1979\n\nසමන්මලී\n\n1979\n\nMinisun Athara Minisek\n\n1979\n\nමුවන් පැලැස්ස\n\nපිනා\n\n1979\n\nරෝස මල් තුනක්\n\nනළා වාදකයා\n\n1979\n\nඅක්කේ මට අවසර\n\n1979\n\nසුභානි\n\n1979\n\nනුවන් රේණු\n\nපබිලිස්\n\n1979\n\nවිසිහතර පෑය\n\n1979\n\nහරි පුදුමයි\n\n1980\n\nසිල්වා\n\n1980\n\nමුවන් පැලැස්ස 2\n\nපිනා\n\n1980\n\nආදර රත්න\n\nශිෂ්‍ය නායකයා\n\n1981\n\nකෝලම් කරයෝ\n\nඅහංග ලාල් සුලෝජන\n\n1981\n\nගීතිකා\n\nසිල්වා 'මහත්තයා'\n\n1981\n\nඅංජානා\n\n1981\n\nඑක් දවසක් රා\n\nඡායාරූප ශිල්පියා\n\n1981\n\nඅම්මේ මට සමවෙන්න\n\nෆ්‍රෙඩී\n\n1982\n\nමල්ලිකා මෙනවිය 1982\n\n1982\n\nවතුර කරත්තය\n\nවාර්තාකරු\n\n1982\n\nකඩවුනු පොරොන්දුව නව\n\nසේවාරිස් 'උන්නා'\n\n1983\n\nසුමිතුරෝ\n\n1983\n\nචන්දි සිරියා\n\n1983\n\nමේරි අක්කා\n\nමිතුරා\n\n1983\n\nහස්ති වියරුව\n\nවේලු\n\n1984\n\nඅරා සොයිසා\n\nසොයිසා ය\n\n1984\n\nකකිලේ රජ්ජුරුවෝ\n\nඅන්දරේ\n\n1985\n\nඅරලිය මල්\n\nබණ්ඩා\n\n1986\n\nදිනුම\n\nඋස්තාද්\n\n1987\n\nයුගයෙන් යුගයට\n\n1987\n\nතත්ති මං ආදරේයි\n\n1987\n\nයුක්තියද ශක්තියද\n\n1987\n\nරාජා වෙදකාරයෝ\n\nඋපුල් 'සංගීත මාස්ටර්'\n\n1987\n\nරන් දම් වැල්\n\n1987\n\nObatai Priye Adare\n\n1987\n\nඅහිංසා\n\n1987\n\nහිත හොන්ඩා චණ්ඩියා\n\nසර්පිනෝ\n\n1989\n\nමමයි රාජා\n\n1988\n\nනෙවා ගිලුනත් බන්චුන්\n\nගිරා\n\n1988\n\nරස රහසක්\n\n1988\n\nගෙදර බුදුන් අම්මා\n\nඇමැති\n\n1988\n\nඅම්මේ ඔබ නිසා\n\n1988\n\nඅංගුලිමාල\n\n1988\n\nදුර්ගා\n\n1988\n\nසටානා\n\n1988\n\nනෙවාත අපි එක්වෙමු\n\n1988\n\nචන්දිංගෙත් චණ්ඩියා\n\n1989\n\nබදුලු කොච්චිය\n\n1989\n\nමමයි රාජා\n\nරංජිත්ගේ උපදේශකයාගේ පුතා\n\n1989\n\nනොම්මාර 17\n\nඅල 'නොම්මරා 13'\n\n1989\n\nObata Rahasak Kiyannam\n\n1989\n\nරන්දෙණිගල සිංහයා\n\nසනී 'අයියා'\n\n1990\n\nසම්බුදු මහිම\n\n1990\n\nදෙසේ මල් පිපිලා\n\nබන්දු\n\n1990\n\nතන්හා ආශා\n\n1990\n\nදේදුන්නේන් සමනලියක්\n\n1990\n\nවලව්වේ හාමු\n\n1990\n\nපෙම් රජ දහන\n\n1991\n\nපාරාදීසය\n\n1991\n\nබඹර කලපේ\n\n1991\n\nබැංකොක්හි ආදරය\n\n1991\n\nචෙරියෝ ඩොක්ටර්\n\nවෛද්‍ය කොකෝ\n\n1992\n\nසත්යා\n\n1992\n\nජය සිරි වී කුමාරිය\n\n1992\n\nකදිරා\n\n1992\n\nකියාල වඩක් නා\n\nජැකී\n\n1992\n\nසිංහයාගෙත් සිංහයා\n\nසැරයන් ජයපාල\n\n1993\n\nJooriya Mamai\n\n1993\n\nසාජන්ට් නල්ලතම්බි\n\n1993\n\nසුරයන් අතර වීරයා\n\nසුනිල්\n\n1993\n\nසුර වීර චණ්ඩියෝ\n\nසීඅයිඩී සිල්වා\n\n1993\n\nමේවිල පෙනෙවි රූපේ\n\n1994\n\nඔක්කෝම හෝදටයි\n\nඔහුම\n\n1994\n\nරාජා වන්සන් එකෙක්\n\nසනී\n\n1994\n\nවිජය ගීතා\n\nඩගී \"පයන්\" ජයසූරිය\n\n1995\n\nපරීක්ෂක ගීතා\n\n1995\n\nPudumai Eth Aththai\n\n1995\n\nවෛරයෙන් වෛරය\n\n1995\n\nචෙරියෝ කැප්ටන්\n\nපිං පොං\n\n1996\n\nසුර දරුවෝ\n\n1996\n\nමනමෝහිනී\n\nඩගී\n\n1996\n\nසිහින විමානේ රාජකුමාරි\n\n1996\n\nචෙරියෝ ඩාලිං\n\n1997\n\nරාගයේ උණුසුම\n\n1997\n\nසූරයෝ වෙදකාරයෝ\n\n1999\n\nකොලොම්පූර්\n\n2001\n\nජොලි හැලෝ\n\n2001\n\nOba Kohida Priye\n\n2001\n\nපිස්සු පූසෝ\n\nපචවංශය\n\n2002\n\nපාර්ලිමේන්තු විහිළු\n\n2002\n\nපිස්සු ඩබල්\n\nනිෂ්පාදක ලෙස\n\nඅවුරුදු\n\nචිත්රපටය\n\nඅධ්යක්ෂක\n\n1994\n\nඔක්කොම්ට හෝදටයි\n\n ගීත\n\nආච්චි පොඩි වෙදවර්ජනායක\n\nආප්ප වැලදීමේ උබ\n\n - කලාවතී එක්ක\n\nආරාධිත අමුත්තෙක් (විකට රසඟ)\n\n - ගැමුණු විජේසූරිය එක්ක\n\nආරොන් මාමා\n\nAaronge Malli Baaron\n\nආවා මේ අම්මා\n\n - අංජලීන් ගුණතිලක සමඟ\n\nඅහන්න බලන්න\n\nආලඩිංගේ පුදුම පහන\n\n - නිහාල් නෙල්සන් සමඟ\n\nඅල්ලපු ගෙදරින්\n\nඅලුත් කතාවක්\n\nඅලුත් කලාවක්\n\nAmuthu Adum ada\n\nඅනංගයා අනංගයා\n\n - අංජලීන් ගුණතිලක සමඟ\n\nAmuthu Sathaa\n\nඅන්දරේ\n\nඅන්දරේ මෙහෙ වරෙන්\n\n - ඩෙස්මන්ඩ් ද සිල්වා සමඟ\n\nඇනා හැන්දේ හාවා\n\nඅපි කතාද බය\n\n - එච්.ආර්.ජෝතිපාල සමඟ\n\nඅරාබියේ තෙලේ\n\nඅරුළු බුරුළු\n\nAta Sakilla Waage\n\nආතක සෙලවෙන\n\nආතාදුන්නා හිතවන්ති\n\nඅත්ථ යුක්තියට\n\nAu Au Au Au Mage Sawarina\n\nඅයිය සාමි\n\n - කලාවතී එක්ක\n\nබානුමතී\n\nබච්නා බචනා\n\nබල්ලා බල්ලා\n\nබල්ලන් බිරුවට\n\nබාම් මන්නා\n\nබාර් එකේන් බීලා\n\nබර කරත්තේ\n\nබටකොළ වට්ටියකට\n\n - කලාවතී සමඟ\n\nබීල බීල\n\nබ්ලේඩ් තාලි\n\nබොම්බේ සුන්දරී\n\nBola Kadala Seeni Kadala\n\n - කලාවතී එක්ක\n\nBoru Manasgaatha Noweyi\n\nබුලත් වාඩියක්\n\nබුරුතු බුරුතු මල්\n\nබුඌරු නාම්බා\n\nචන්ද්‍රසේ කැළුම්\n\nCheriyo Kiyala Me\n\n - ග්රේෂන් ආනන්ද සමඟ\n\nCheene Indalaa Aawe\n\n - කලාවතී එක්ක\n\nචි චි චි\n\nචිම්පන්සි පුතා\n\nචින් චින් නෝනා\n\n - H. R. ජෝතිපාල සහ මිල්ටන් පෙරේරා සමඟ\n\nදන්නවු රට පාවතැන්න වූ\n\nDawasak Daa Kakuluwekuta\n\nදෙවැට දිගේ මං ආවා\n\nDil Thadap Thadap (ඉලගෙන කන පරිප්පු)\n\nදිය යට විස්කම්\n\nEkamath Eka Rataka Ea Kale\n\nඑනකොට එනවා හිනා වේවි (නදයෝ)\n\nඑන්න එන්න වඩිවෙන්න\n\nගහ කොළ මල්\n\n - H.R ජෝතිපාල සමඟ\n\nගජ ලාබයි නෝනා මහත්තයා (පච)\n\nගල්කිස්සේ මුහුදු වෙරළේ\n\nගල් මුවදොර පිටියේ (දහස් ගානකින්)\n\nGanu Parane Mawwe Deyyo\n\nGigiri Jagari Handawana\n\nගිරි ගෝරිස්\n\nහඳ මාමා උඩින්\n\nඉඳි ගහ යට වඩිවෙල\n\nඉපදුනු රට දවස\n\nඉරිදා පොල්ල දොඹ ගහ යට\n\nජැක් සහා ජිල්\n\nකමත ගාවා'\n\n - නිරෝෂා විරාජිනී එක්ක\n\nකපුටුලන්ත වාසියෝ\n\nKawadawath Na Mehema Deyak\n\nකවුඩා ගෝනා (ඔන්න මරු හතර හිනා)\n\nකවුඩා මේ අනේ\n\n - කලාවතී එක්ක\n\nකෙවිලිගේ පැටිය (කපුටිගේ කූඩුවේ)\n\nලගදි පපායි නොන්ඩි ජිමයි\n\nLokaya Namathi Game\n\nමදුරුවතී (කීං කූං හැංගි)\n\nමහා කාලෙක බෙනායක (නාග රාජය)\n\nමහා කැලේ නුග සෙවණේ (බකමූණ)\n\nමමයි මොට්ට පලා\n\nඅම්මේ මේ බකමූණ\n\n - H.R ජෝතිපාල සමඟ\n\nමංගල අතුපිට සරසි\n\nමායම් මාවල පාල\n\nමේ දන්නෝ දනිති\n\nමිණි ගෙජ්ජි හඬන\n\nමගේ නම සයිමන් සිල්වා\n\nනාග රාජයා (මහා කලායක බෙනායක)\n\nනන්දම්මා නා නෙදෝ\n\n - ශ්‍රීලාල් අබේකෝන් සමඟ\n\nනිකම්ම ඉන්න වදට අදන්න (පින් බත)\n\nනිතාරම බිරුවට බල්ලෙක්\n\nඔබ රජ වීලා\n\n - කලාවතී එක්ක\n\nඔන්න බබෝ බිල්ලෝ එනවා\n\nනැත්නම් මිස්ටර්\n\nපන පලයන් ලබන සුමනේ\n\nපාන්කිරිත්ත\n\nපාරානා කබාය\n\nපරවිය වාගේ රාජ මාලිගේ\n\nපට සරුංගල් වගෙයි\n\n - විජය කුමාරණතුංග සමඟ\n\nප්‍රින්සි ඩාර්ලිං මයි ස්වීටි\n\nරයිගමයානානි ගම්පොලයානානි\n\nරජ උම්බනේ ගෝනා\n\nරකින්න කියාල අරන් තිබ්බ\n\nරන් තතියක කිරි පැණි පුරවල\n\nරුපියල් ලක්ෂයක් තෑගි\n\nසාලි ලබෙනකොටා\n\nසැන්ඩෝ ගුන්ඩෝ (කලයකින් දැන් මුණගහුනේ)\n\nසොපිනාත් එක්ක මෑන්\n\nසුරංගනී සුරංගනී\n\nතාමත් ඉන්නව (විජය කුවේණිල)\n\nතංගමනී\n\n - කලාවතී එක්ක\n\nතියා කුඩේ පිටේ බඩන්\n\nටිකිරි කිරිල්ලියෝ\n\nTopsina Premi Mage\n\nUpan Dine Langa Ena Hinda\n\nවිකාර ලෝකේ ලෝක විකාරේ\n\nWadath Agei Hadath Penei\n\n - ග්රේෂන් ආනන්ද සමඟ\n\nවෙද මහත්තයා\n\nවැල්ල සිඹිමින් රැලි පෙරළේ\n\nයකඩ කේට්\n\n - අංජලීන් ගුණතිලක සමඟ\n\nයන්තම් ඇති\n\nයන්තම් ඉංග්‍රීසි දාන ගත්ත"
    },
    {
        "name": "විවියන් ද සිල්වා බොරලැස්ස",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1930 සැප්තැම්බර් 24",
        "Death": "2 අප්රේල් 2017\n\n(වයස අවුරුදු 86)",
        "description": "විවියන් ද සිල්වා බොරලැස්ස\n\n (සිංහල:\n\nවිවියන් ද සිල්වා බොරලැස්ස\n\n; 24 සැප්තැම්බර් 1930 - 2 අප්‍රේල් 2017) ශ්‍රී ලාංකේය ගායිකාවක් වූ අතර, විශේෂයෙන්ම ඇයගේ බෞද්ධ භක්ති සංගීතය සඳහා ප්‍රසිද්ධියට පත් විය. ශ්‍රී ලංකාවේ ග්‍රැමෆෝන් යුගය ලෙස හැඳින්වෙන 1950 ගණන්වල ඇගේ කීර්තිය උච්චස්ථානයට පත් විය."
    },
    {
        "name": "විජය කුමාරණතුංග",
        "info": "නළුවා",
        "Intro": "නළුවා",
        "Was": "ගායකයා\n\nනළුවා",
        "From": "ශ්රී ලංකාව",
        "Type": "චිත්‍රපටය, රූපවාහිනිය, වේදිකාව සහ ගුවන්විදුලිය\n\nසංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1945 ඔක්තෝබර් 9, ශ්‍රී ලංකාව",
        "Death": "1988 පෙබරවාරි 16\n\n(වයස අවුරුදු 42)",
        "Star sign": "තුලා රාශිය",
        "Politics": "ලංකා සමසමාජ පක්ෂය",
        "Family": "කලත්රයා:\n\nචන්ද්‍රිකා කුමාරතුංග",
        "description": "කෝවිලගේ ඇන්ටන් විජය කුමාරණතුංග (සිංහල: කෝවිලගේ ඇන්ටන් විජය කුමාරණතුංග දෙමළ: Vijaya_kumaranathung ; 9 ඔක්තෝබර් 1945 - 16 පෙබරවාරි 1988), විජය කුමාරණතුංග ලෙසද හැඳින්වේ, ජනප්‍රිය ශ්‍රී ලාංකේය චිත්‍රපට නළුවෙකු සහ දේශපාලනඥයෙකු වූ අතර, 1978 සිට හිටපු ශ්‍රී ලංකා ජනාධිපති චන්ද්‍රිකා කුමාරණතුංග සමඟ විවාහ විය. 1988 දී ඔහුගේ ඝාතනයට.පවුල් ජීවිතය\n\n1978 දී කුමාරණතුංග ශ්‍රී ලංකා අග්‍රාමාත්‍ය S. W. R. D. බණ්ඩාරනායකගේ සහ අගමැතිනි සිරිමාවෝ බණ්ඩාරනායකගේ දියණිය වන චන්ද්‍රිකා බණ්ඩාරනායක සමඟ විවාහ විය. විජය කුමාරණතුංගට සහ චන්ද්‍රිකා බණ්ඩාරනායකට දරුවන් දෙදෙනෙක් සිටි අතර, එක්සත් රාජධානියේ වෙසෙන වෛද්‍යවරියක වන යසෝධරා කුමාරණතුංග වෝකර් සහ පශු වෛද්‍යවරයකු වූ විමුක්ති කුමාරණතුංග ය.\n\n සිනමා ජීවිතය\n\nකුමාරණතුංගගේ පළමු චිත්‍රපටය විය\n\nහන්තානේ කතාව\n\n, එහි ඔහු ප්‍රධාන චරිතය රඟපෑවේය. එතැන් සිට, දශක දෙකකට ආසන්න කාලයක් පුරා දිවෙන වෘත්තීය ජීවිතය තුළ ඔහු ඇතුළුව චිත්‍රපට 114 ක රඟපෑවේය\n\nEya Den Loku Lamayek\n\n (1975),\n\nපොන්මනි\n\n (1977),\n\nබඹරු ඇවිත්\n\n (1977),\n\nගංගා අද්දර\n\n (1980),\n\nබද්දේගම\n\n (1980), පාරදිගේ (1980), මහ ගෙදර (1980), කැඩපතක චායා (1989) සහ ක්‍රිස්තු චරිතය (1990). ඔහු සම්මාන කිහිපයක් ද දිනා ගත්තේය. ඔහු 1983 සිට 1988 දක්වා ශ්‍රී ලංකාවේ ජනප්‍රියම නළුවාට හිමි සම්මානය දිනාගත්තේය.එය ශ්‍රී ලංකා සිනමා ඉතිහාසයේ වාර්තාවක් විය. ඔහු රඟපෑ චරිතය වෙනුවෙන් ඔහු මරණින් පසු හොඳම නළුවා ලෙස සම්මාන ලැබීය\n\nකේදපාතක චායා\n\n. ඔහු චිත්‍රපට කිහිපයකම පසුබිම් ගායකයෙකු ලෙස ද රංගනයෙන් දායක වූ අතර හොඳම පසුබිම් ගායකයාට හිමි සම්මානය දෙවතාවක් දිනා ගත්තේය (\"සහරවේ සිහිනය\" චිත්‍රපටිය - \"වළකුලක් ගෙන මුව කරමු හිරු.....\" සහ \"දොළොස්මහේ පහන\" චිත්‍රපටය- \"සරා ගුවන විද නැඟුන.....\"). ඒ වගේම කැසට් පට 10කට ආසන්න ප්‍රමාණයක් (ගඟ අද්දර, කව්ළුව අතරින්, වේදනා, දිනකර පායා, විජය ගී, සීත රැයදී, මංගල නැකත, සුදු දුව, රූස්ස ගහ ළඟ) එළිදක්වමින් ගීත 100කට අධික ප්‍රමාණයක් ගායනා කළා. ඔහු මුදල් නොගෙන ඔහුගේ සියලුම ගීත ගායනා කළේය. ඔහුගේ වෘත්තීය ජීවිතය තුළ විජය එක් ඉංග්‍රීසි චිත්‍රපටයක රඟපෑවේය.\n\nදෙව් රජු\n\n, සහ එක් දෙමළ චිත්‍රපටයක්,\n\nනන්ගුරන්\n\n. ඔහු නිෂ්පාදනය කළ එකම චිත්‍රපටය විය\n\nවරදට දඬුවම්\n\n, ඔහුගේ මරණයෙන් පසු තිරගත විය.\n\n දේශපාලන ජීවිතය\n\nලංකා සමසමාජ පක්ෂයෙන් දේශපාලන ජීවිතය ආරම්භ කළ ඔහු දේශපාලනඥයකු ද විය. පසුව ශ්‍රී ලංකා නිදහස් පක්ෂයට එක්වී ශ්‍රීලනිප පළමු ජාතික සංවිධායකවරයා වූ ඔහු 1977දී කටාන අසුනට තරග කර අසාර්ථක විය. 1982දී හෙක්ටර් කොබ්බෑකඩුවගේ ජනාධිපතිවරණ ව්‍යාපාරයේ ක්‍රියාකාරීව කටයුතු කළ ඔහු මැතිවරණයෙන් පසු හදිසි නීති රෙගුලාසි යටතේ ජේ.ආර්. ජයවර්ධන විසින් සිරගත කරන ලදී. \"නැක්සලයිට්\" (මෙතෙක් සහ ශ්‍රී ලංකාව තුළ නොදන්නා දේශපාලන ඇදහිල්ලක්) යැයි කියනු ලබන නමුත් ඔහුට කිසි විටෙකත් චෝදනා එල්ල නොවීය. ඔහු 1983 ශ්‍රීලනිප අපේක්ෂකත්වය යටතේ මහර අතුරු මැතිවරණයට ඉදිරිපත් වූ අතර එක්සත් ජාතික පක්ෂ ආධාරකරුවන් විසින් ඔහුට හිරිහැර කරන ලදී. ඔහුව මරා දැමීමට තැත් කර ඔහුගේ මිතුරෙකු මිය ගියේය. ගණන් කිරීමේ පළමු වටයෙන් විජය ජයගත් අතර දෙවැනි වටය නියම විය. එම අවස්ථාවේදී ගණන් කිරීමේ මධ්‍යස්ථානයේ කුප්‍රකට කළුවරක් ඇති විය. විදුලිය යථා තත්ත්වයට පත් වන විට එක්සත් ජාතික පක්ෂ අපේක්ෂකයා ඡන්ද කිහිපයකින් ජයග්‍රහණයක් වාර්තා කර තිබුණි. විපක්ෂය තරයේ කියා සිටියේ කවුරුන් හෝ \"එජාප ජයග්‍රහණය තහවුරු කිරීම සඳහා විජයගේ ඡන්ද ටිකක් කෑවා\" යනුවෙනි.\n\nඔහු ශ්‍රී ලංකා මහජන පක්ෂය (SLMP) ආරම්භ කළේය. ඔහු සහ ඔහුගේ පක්ෂය එවකට ශ්‍රී ලංකාවේ පැවති සිවිල් යුද්ධයේදී සාමය සඳහා තර්ක කළහ. ඔහු අලුතින් තේරී පත් වූ ශ්‍රී ලංකා නිදහස් පක්ෂය යටතේ මින්නේරිය අතුරු මැතිවරණයට ඉදිරිපත් වී එජාප අපේක්ෂකයා ජයග්‍රහණය කළ තරගයේ දෙවැනි ස්ථානය වාර්තා කළේ කෙසේ වෙතත් තම පැරණි පක්ෂය වන ශ්‍රීලනිපය නින්දිත ලෙස තුන්වැනි ස්ථානයට යවමිනි. ඔහුගේ පක්‍ෂය කුණ්ඩසාලේ සහ හබරාදූව ඇතුළු අතුරු මැතිවරණ කීපයකට පසුව තරග කළ නමුත් අපේක්‍ෂා කළ පරිදි ජීවත් වූයේ නැත. දේශපාලන බාධක ඉක්මවා ගිය දේශපාලන මෙහෙවරක් කළ කුමාරතුංග සිය අවසන් ප්‍රසිද්ධ දේශනයේදී ලිබරල් චින්තනයේ ඌනතාවය නිසා තම උනන්දුව පවත්වා ගැනීමට අපොහොසත් වූ පක්ෂයක් වන ශ්‍රී ලංකා නිදහස් පක්ෂයේ (ශ්‍රීලනිප) වැඩවසම්වාදී දේශපාලනය කෙරෙහි තමාගේ නොසැඟවුණු අකමැත්ත ප්‍රකාශ කළේය. . 1988 ජනවාරි 28 වැනි දින කැම්බල් පිටියේ පැවැති දැවැන්ත මහජන රැලිය අමතමින් කුමාරතුංග එජාපයට, ශ්‍රීලනිපයට හා ජවිපෙට කාලීන අවශ්‍යතාවයට විසඳුම් සෙවීමට අපොහොසත් වීම ගැන බැණ වැදුණේය. සිත්ගන්නා කරුණ නම්, ජවිපෙ සමග ශ්‍රීලනිපයේ සබඳතා ගැන කුමාරතුංග සිය කනස්සල්ල ද ප්‍රකාශ කිරීමයි. 1988 දී ඔහුගේ පක්ෂය ලසසප, නසසප, ශ්‍රී ලංකා කොමියුනිස්ට් පක්ෂය සහ ඊපීආර්එල්එෆ් ඇතුළු තවත් වාමාංශික පක්ෂ කිහිපයක් සමඟ නව සන්ධානයක්-එක්සත් සමාජවාදී සන්ධානයක් (එක්සත් ජනපදය) පිහිටුවීම සඳහා සම්මුතියකට පැමිණියේය. නව සන්ධානය පිහිටුවීමට දින කිහිපයකට පෙර විජය ඝාතනය විය. එක්සත් ජනපදය සඳහා වූ ගිවිසුම ඔහුගේ අවමංගල්‍ය උත්සවයේදී පක්ෂ නායකයින් විසින් අත්සන් කරන ලදී. ප්‍රධාන විපක්ෂය වන ශ්‍රීලනිපය විසින් වර්ජනය කරන ලද මැතිවරණයකින් එක්සත් ජනපදය අලුතින් පිහිටුවන ලද පළාත් සභාවල ආසන විශාල සංඛ්‍යාවක් දිනා ගත්තේය. පසුව ඇමරිකා එක්සත් ජනපදය විසින් ඔසී අබේගුණසේකර ජනාධිපති අපේක්ෂකයා ලෙස ඉදිරිපත් කළ අතර ඔහු 1988 ජනාධිපතිවරණයේ අවසන් ස්ථානය වාර්තා කරනු ඇත. 1989 පාර්ලිමේන්තු මැතිවරණයට ඇමරිකා එක්සත් ජනපදය ඉදිරිපත් වී ජාතික ලැයිස්තුවෙන් එකක් ඇතුළු ආසන තුනක් දිනා ගත් නමුත් ජයග්‍රාහකයින් සියල්ලෝම එක්සත් ජනපදයේ අනෙකුත් සාමාජික පක්ෂ නියෝජනය කළහ. SLMP එකට වඩා.\n\n 1986 යාපනය සංචාරය\n\n1986 දී විජය කුමාරණතුංග එල්ටීටීඊ පාලනය යටතේ පැවති යාපනයට ගියේය. ඔහු නල්ලූර් මුරුගන් කෝවිලට ගොස් ප්‍රදේශයේ දෙමළ සිවිල් වැසියන් හමුවූ අයුරු දුර්ලභ වීඩියෝවකින් දැක්වේ. ඔහු නැවත ලංකා හමුදා කඳවුරට යාමට පෙර තරුණ එල්ටීටීඊ නායකයින් කිහිප දෙනෙකු මුණගැසුණි.\n\n මරණය සහ උරුමය\n\n1988 පෙබරවාරි 16 වැනි දින දහවල් 12.20 ට ලයනල් රණසිංහ හෙවත් ගාමිණී විසින් අපරාධ පරීක්ෂණ දෙපාර්තමේන්තුව (CID) විසින් කරන ලද ප්‍රශ්න කිරීම්වලින් පසුව එම ඝාතනය පාපොච්චාරණය කළේ කුමාරතුංග මහතාගේ කොළඹ තදාසන්න ප්‍රදේශයේ පිහිටි ඔහුගේ නිවසින් පිටතදී 56 වර්ගයේ ප්‍රහාරක රයිෆලයකින් ඔහුගේ හිසට වෙඩි තබාගෙනය. . මාක්ස්වාදී සංවිධානයක් වන ජනතා විමුක්ති පෙරමුණේ (ජනතා විමුක්ති පෙරමුණේ) හමුදා අංශය වන දේශප්‍රේමි ජනතා ව්‍යාපාරය (DJV)/දේශප්‍රේමී ජනතා ව්‍යාපාරය විසින් තමන්ට ලබාදුන් නියෝග ක්‍රියාත්මක කිරීම පමණක් බව රණසිංහ පිටු 141ක ප්‍රකාශයක් නිකුත් කරමින් පාපොච්චාරණය කළේය. 1980 ගණන්වල අග භාගයේ ඝාතනවලට වගකිව යුතු ය. කෙසේ වෙතත් විජය කුමාරතුංග ඝාතනය පිටුපස එක්සත් ජාතික පක්ෂයේ ජනාධිපති රණසිංහ ප්‍රේමදාස, ගාමිණී ලොකුගේ සහ ආරක්ෂක නියෝජ්‍ය අමාත්‍ය රන්ජන් විජේරත්න සිටි බවට ජනාධිපති කොමිෂන් සභා වාර්තාවේ නිගමනය වී තිබුණා. කුමාරතුංගගේ වැන්දඹු බිරිය වන චන්ද්‍රිකා බණ්ඩාරනායක කුමාරතුංග මහත්මිය ද මේ අදහස දරයි. ශ්‍රී ලංකාවේ අවමංගල්‍යයක් සඳහා වැඩිම පිරිසක් ඇදී ආවේ කුමාරතුංගගේ අවමංගල්‍යයටය. විජයගේ මිනී පෙට්ටිය විවෘත වූයේ අර්ධ වශයෙන් පමණි (ඝාතනයේදී සිදුවූ හානිය හේතුවෙන් හිස කොටස වසා ඇත). එජාප රජයට එරෙහිව විපක්ෂ කරළිය නියෝජනය කළත් 1988 පෙබරවාරි 21 වැනි දින කොළඹ නිදහස් චතුරශ්‍රයේදී අවසන් කටයුතු රාජ්‍ය අවමංගල්‍යයක් ලෙස පැවැත්විණි. එය ශ්‍රී ලංකාවේ රූපවාහිනී නාලිකාවක (ශ්‍රී ලංකා රූපවාහිනී සංස්ථාව මගින්) සජීවීව විකාශය වූ පළමු අවමංගල්‍ය උත්සවය විය. ඔහුගේ මරණය සැලවීමෙන් පසු පුද්ගලයන් 12 දෙනෙකු සියදිවි නසාගත් බව වාර්තා වේ. ඔහුගේ ඝාතන දිනය (1988 පෙබරවාරි 16) \"භයානක අඟහරුවාදා\" හෝ \"ශ්‍රී ලංකා ඉතිහාසයේ අඳුරුතම අඟහරුවාදා\" ලෙස පුළුල් ලෙස හැඳින්වේ. කුමාරණතුංග මහතාගේ වියෝව පිළිබඳව ශ්‍රී ලංකාවේ බොහෝ දෙනාගේ ශෝකය තවමත් පවතී.\n\n චිත්‍රපටකරණය\n\nඅවුරුදු\n\nචිත්රපටය\n\nකාර්යභාරය\n\nසටහන්\n\n1967\n\nමනමාලයෝ\n\nරංගනයේ මංගල දර්ශනය\n\n1969\n\nRomio Juliet Kathawak\n\nහන්තානේ කතාව\n\n1970\n\nප්‍රියංගා\n\n1971\n\nරන් ඔංචිල්ලා\n\nඅභිරහස\n\nකේසර සිංහයෝ\n\nහතරදෙනම සූරයෝ\n\nසමනල කුමාරියෝ සමග අපි කවදත් සූරයෝ\n\nබිඳුණු හදවත\n\nඒ වගේම චිත්‍රපට නිෂ්පාදකයෙක්\n\n1977\n\nMe Desa Kumatada\n\nEdath Sooraya Adath Sooraya\n\nවන රාජා\n\nආදරේ හිතනවා දක්කම\n\nතුෂාර\n\nසම්පත්\n\nහදින්නාත් තාරු\n\nDahakin Ekek\n\nහොන්දම වැලව\n\n1974\n\nසුසී\n\nඅහස් ගවුව\n\nදුලීකා\n\nසැණකෙළිය\n\nදෙව් රජු\n\nලලිත්\n\nඉංග්‍රීසි චිත්‍රපටය\n\n1975\n\nපෙම් කුරුල්ලෝ\n\nසිකුරුලිය\n\nලස්සන දවසක්\n\nසංගීතා\n\n1976\n\nප්‍රදීපේ මා වෙවා\n\nවාසනා\n\nදියමන්ති\n\nUnnath Dahai Malath Dahai\n\nAdarei Man Adarei\n\n1977\n\nසකුන්තලා\n\nහිතුවොත් හිතුවාමයි\n\nමරුවා සමග වාසේ\n\nමරු සිරා\n\nහරියනකොට ඔහොම තාමයි\n\nEya Den Loku Lamayek\n\nපෙම්බර මධු\n\n1978\n\nවිශ්මය\n\nකුණ්ඩල කේශි\n\nසඳවට රන් තරු\n\nඅනුපමා\n\nසේලිංගේ වලව්ව\n\nබඹරු ඇවිත්\n\nවික්ටර්\n\nසාලි\n\nකුමාර කුමාරියෝ\n\nඅහසින් පොළවට\n\n1979\n\nගහණියක්\n\nපොඩි මල්ලි\n\nහිඟන කොල්ලා\n\nමොණරතැන්න\n\nඑක හිත\n\nඅක්කේ මට අවසර\n\n1980\n\nරාජ දවසක්\n\nගංගා අද්දර\n\nආචාර්ය සරත් පතිරණ\n\nකරුමක්කාරයෝ\n\nකිඳුරු කුමාරි\n\nපැරා දිගේ\n\nචන්ද්‍රේ\n\nටක් ටික් ටුක්\n\nකාංචනා\n\n1981\n\nබැද්දේගම\n\nබාබුන්\n\nලෙනාඩ් වුල්ෆ්ගේ \"බද්දේගම\" ඇසුරින්\n\nගිතිකා\n\nඅංජන\n\nසූරියකාන්ත\n\nවාලම්පුරි\n\n1982\n\nයස ඉසුරු\n\nමිහිදුම් සිහින\n\nරහසක් නැති රහක්\n\nමහ ගෙදර\n\nකඩවුනු පොරොන්දුව (නව)\n\nසැම්සන්\n\nනෙවත හමුවෙමු\n\nපාරමිතා\n\n1983\n\nසමනල සිහින\n\nසිවු රංගනසේන\n\nපැස්ටා මිතුරෝ\n\nසඳමාලි\n\n1984\n\nකෝකිලා\n\nජය සිකුරුයි\n\nBinaree Saha Audu Banda\n\nවැල්ලේ තේනු මාලිගා\n\n1986\n\nදෙව්දූව\n\nපෙරලිකාරයෝ\n\nවිජේ/සැම්සන්\n\nද්විත්ව භූමිකාව\n\nජය අපිටයි\n\nගිම්හානේ ගී නාදේ\n\n1987\n\nයුගයෙන් යුගයට\n\nයුක්තියද සක්තියද\n\nකැවුළුව\n\nරාජා වෙදකාරයෝ\n\nරන්දම්වැල්\n\nObatai Priye Adare\n\nරවී\n\nඅහිංසා\n\n1989\n\nමමයි රාජා\n\nකඩපාතක චායා\n\nබදුලු කොච්චිය\n\nනොම්මාර 17\n\nවිජය\n\nවරදට දඬුවම්\n\nඒ වගේම චිත්‍රපට නිෂ්පාදකයෙක්\n\nරන්දෙණිගල සිංහයා\n\n1990\n\nදෙසේ මල් පිපිලා\n\nවිජය\n\nතන්හා ආශා\n\nවීර උදාර\n\nආගන්තුක පෙනුම\n\nක්‍රිස්තු චරිතය\n\nයේසුස් වහන්සේ\n\nසහරාවේ සිහිනය\n\nසරසවිය සම්මාන සඳහා\n\nහොඳම පසුබිම් ගායකයා'\n\n1991\n\nමධුසමය\n\n1993\n\nසූරයන් අතර වීරයා\n\n1995\n\nහිත හොන්ඩා සූරයෝ\n\n1998\n\nAya Obata Barai"
    },
    {
        "name": "මරියසෙල් ගුණතිලක",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "description": "මරියසෙල් ගුණතිලක යනු ශ්‍රී ලංකාවේ ප්‍රමුඛ පෙළේ ගායිකාවක් සහ සංගීත තරුවක්. ඇය ශ්‍රී ලංකාවේ පමණක් නොව එක්සත් රාජධානිය, ඇමරිකා එක්සත් ජනපදය, එක්සත් අරාබි එමීර් රාජ්‍යය, සිංගප්පූරුව සහ ඕස්ට්‍රේලියාව වැනි දුර බැහැර ප්‍රදේශවල ද ධාරිතාවයෙන් පිරුණු ශ්‍රවණාගාරවල රඟ දක්වා ඇත.\n\nමරියසෙල් ගුණතිලක උපන්නේ ශ්‍රී ලංකාවේ කොළඹ නුගේගොඩ ය. ඇය සිය සංගීත දිවිය ආරම්භ කළේ වයස අවුරුදු 7 දී ය. වයස අවුරුදු 10 දී මරියාසෙල් සිලෝන් ඔබ්සර්වර් සමස්ත ලංකා කුසලතා තරගයේ කනිෂ්ඨ අංශය ජයග්‍රහණය කළාය - එය ඇයට ශ්‍රී ලංකාවේ ජනප්‍රිය වූ 'ජූනියර් රිද්මියර්ස්' නම් වූ යොවුන් සංගීත කණ්ඩායමට සම්බන්ධ වීමට දොර විවර විය. ලංකා. දකුණු ආසියාවේ පැරණිතම ගුවන් විදුලි මධ්‍යස්ථානය වන රේඩියෝ සිලෝන් හි ගුවන් තරංග ඔස්සේ 1960 ගණන්වල ඔවුන් ප්‍රදර්ශනය කළ විට මෙම කණ්ඩායම අවධානයට ලක් විය. ගුවන් විදුලි නාලිකාව 1950 සහ 1960 ගණන්වල 'ගුවන් තරංග පාලනය කළ' නිසා රේඩියෝ සිලෝන් හි ඕනෑම නිරාවරණයක් දිවයිනේ තරුණ කලාකරුවන්ට විශාල රුකුලක් විය. මරියාසෙල්ගේ සංගීත දිවිය ඉහළට ගියේය.\n\nඇය කීර්තිමත් සම්භාව්‍ය ගිටාර් වාදකයෙකු වූ දිවංගත වින්ස්ටන් ජයවර්ධන විසින් ශාස්ත්‍රීය ගිටාර් වාදනය සහ එස්ටෙල් ද නීස් මහත්මියගෙන් ගායන සංගීතය හැදෑරුවාය. මරියසෙල් ගුණතිලක නුගේගොඩ ශාන්ත ජෝශප් කන්‍යාරාම පාසලට ඇතුළත් වූවාය.\n\n මහනුවර ලමිස්සි\n\nCeylon Observer Talent Contest ජයග්‍රහණය කිරීම මරියසෙල්ට විශාල ශක්තියක් විය. කොළඹ සන්ඩේ ඔබ්සර්වර් පුවත්පතට අනුව: 'එමරල්ඩ්ස්' සහ 'මිඩ්නයිට් මීස්ට්' වැනි සංගීත කණ්ඩායම් සමඟ සෙල්ලම් කිරීමට මෙය ඇයට වැඩි ධෛර්යයක් ලබා දුන්නේය. 1977 දී \"මහනුවර ලමිස්සි\" පටිගත කිරීම ඇයගේ වෘත්තීය ජීවිතයේ අතථ්‍ය හැරවුම් ලක්ෂ්‍යය විය. මෙම ගීතය ක්ෂණිකව ජනප්‍රිය වූ අතර මරියාසෙල් එම නමින් ප්‍රසිද්ධ විය.\n\nමෙම නව \"Kandy Lamissi\" ට මෙහි පමණක් නොව නේපාලයේ Kathmandu හි Soaltee Oberoi වැනි ඉහළම හෝටල්වලද රඟ දැක්වීමට තැනින් තැනට යාමට සිදු විය. එම වසරේම ඇය නුවරඑළියේදී හදිසි අනතුරකට ලක් වූ අතර එහිදී ඇයගේ කොඳු ඇට පෙළට සහ කරපටියට බරපතළ තුවාල සිදු විය. එවකට ඇගේ හිතවත් පංතියේ මිතුරිය වූ ක්‍රිස්ටීන් නඩරාජාගේ උපකාරය, දෙවියන් වහන්සේ කෙරෙහි ඇයගේ විශ්වාසය සහ ප්‍රජා යාඥාවන් නිසා ඇය එම අඳුරු කාල පරිච්ඡේදයෙන් මිදුණු බව මරියාසෙල් ප්‍රකාශ කළාය. රෝහලෙන් පිටව ගිය ක්ලැරන්ස් විජේවර්ධන, බයිලා අධිරාජ්‍යයා, එම්.එස්. ප්‍රනාන්දු, ස්ටැන්ලි පීරිස්, අජන්තා රණසිංහ, චන්ද්‍රාල් ෆොන්සේකා, \"ජිප්සීස්\" කණ්ඩායමේ සුනිල්/පියල් වැනි ජනප්‍රවාදවල පිහිට ලබා ගැනීමේ භාග්‍යය මරියාසෙල්ට හිමි විය. ක්ලැරන්ස් සහ අනෙකුත් අයගේ රචනා ඇයට සංගීත ලෝලීන් ආකර්ෂණය කර ගත් වෙනස් ශෛලියක් සහ නිරූපණයක් ලබා දුන්නේය. අජන්තාගේ \"සිහින නෙළුම් මල්\" රචනාව කැප කළේ ඇගේ පුතා වන ටෙෂාන් දැන් එංගලන්තයේ ඉගෙනුම ලබන නිසා.\n\n සංගීත ප්‍රභේදය\n\nමරියාසෙල් බටහිර පොප් සංගීතයේ සිට ශ්‍රී ලංකා බයිලා දක්වා සංගීත ප්‍රභේද රාශියකට සම්බන්ධ වී ඇත. ඇය මේ වන විට ප්‍රමුඛ පෙළේ බයිලා ගායිකාවක් ලෙස ප්‍රසිද්ධියට පත්වී සිටින්නේ ඇයගේ දැවැන්ත ජනප්‍රිය වූ 'මහනුවර ළමිස්සි' ලොව පුරා ගායනා කරමින්. ඇමරිකානු ෆුල්බ්‍රයිට් විශාරද, ලොස් ඇන්ජලීස් (යූසීඑල්ඒ) හි කැලිෆෝනියා විශ්ව විද්‍යාලයේ වාසනා කැලුම් ද මෙල් නිරීක්ෂණය කළේ: 'ස්ත්‍රී පුරුෂ භේදය' ද අධ්‍යයනය කිරීම අත්‍යවශ්‍ය කරුණක් බව මට හැඟෙන බැවින්, මරියාසෙල් වැනි බයිලා ගායක ගායිකාවන්ගේ නිර්මාණ ගුණතිලක සහ කොරින් අල්මේදා ද අගය කළ යුතුයි.’ ඇය පැවසුවාය.\n\nඇය ශ්‍රී ලංකාවේ ප්‍රමුඛ පෙළේ සංගීතඥයන් කිහිප දෙනෙකු සමඟ ද සහයෝගයෙන් කටයුතු කර ඇති අතර, ඔවුන් අතර ජිප්සීස් කණ්ඩායමේ සුනිල් පෙරේරා, එම්. ප්‍රනාන්දු, ඩැල්රීන් සුබී, ක්ලැරන්ස් විජේවර්ධන, ඇනස්ලි මාලේවන, ඩේමියන් වික්‍රමතිලක, මැක්සි රොසයිරෝ, ෂැනෙල් ප්‍රනාන්දු, උමාරා සිංහවංශ, අශාන්ති ද අල්විස් සහ රාජ් සෙනෙවිරත්න.\n\n2003 වසරේ සන්ඩේ ඔබ්සර්වර් පුවත්පත සමඟ සම්මුඛ සාකච්ඡාවකට එක්වෙමින් ශ්‍රී ලංකාවේ සුපිරි තරුව ඇගේම අරගල සහ කීර්තියට පත්වීම ගැන කතා කළේ: 'වසර 35ක් මම සංගීත ක්ෂේත්‍රයේ රැඳී සිටීම සහ මම කවුද සහ මම කුමක්ද යන්නයි. වඩාත්ම දුෂ්කර දේ. මම ඉහළට පැමිණීමට මුහුණ දුන් අරගල නිසා එය ප්‍රීතිමත් හැඟීමකි.'\n\nකොළඹ අයිලන්ඩ් පුවත්පත සඳහන් කළේ, 'මරියසෙල් ගුණතිලක නම් මහනුවර ලමිස්සි චිත්‍රපට ශිල්පිනිය විදේශගතව සිටින ශ්‍රී ලාංකිකයන් අතර වැඩි ඉල්ලුමක් ඇති තවත් දේශීය කලාකාරිනියකි. ඇය මෙල්බර්න්, ලන්ඩන්, මැදපෙරදිග, කැනඩාව සහ බොහෝ විදේශීය නගරවල නිරන්තරයෙන් දක්නට ලැබේ. ශ්‍රී ලංකා සංගම් පවතින තැන. විදේශයන්හි ඇයගේ ජනප්‍රියත්වය ඇයගේ බහුශ්‍රැතභාවයට හේතු විය හැක, ඇයට බොහෝ ගීත පහසුවෙන් හැසිරවිය හැකි විය - එය සිංහල, ඉංග්‍රීසි, හින්දි හෝ දෙමළ වේවා. මරියාසෙල්ට සිය ප්‍රේක්ෂකයින් සමඟ සුහදව අදහස් හුවමාරු කිරීමේ හැකියාව ද ඇත. ඒ වගේම බොහෝ දෙනෙක් ඇගේ විලාසිතාවට කැමතියි.'\n\n ක්රිස්තියානි ඇදහිල්ල\n\nමරියාසෙල් 2009 දී කැප වූ කිතුනුවකු බවට පත් විය. අයිලන්ඩ් පුවත්පතට අනුව: 'මරියාසෙල් ආගමට බෙහෙවින් ඇලුම් කරන අතර දෙවියන් වහන්සේ ඇගේ මිතුරිය සහ ගැලවුම්කරුවා කර ඇත.' ඇය කොළඹ මහජන පල්ලියට සම්බන්ධ වූවාය. මරියාසෙල් පැවසුවේ: 'මම මගේ මුළු ජීවිත කාලයම ගායනා කළ නමුත් දැන් මගේ හදවතේ ගායනය තිබේ. මම ගායනා කරන විශිෂ්ටතම ගීතය මගේ ප්‍රේක්ෂකයින් ලෙස දෙවියන් වහන්සේ සමඟයි.'\n\n2010 දී මරියසෙල් ගුණතිලක දකුණු ආසියාවේ විනෝදාස්වාද ලෝකයේ වසර 42 ක් සැමරීය."
    },
    {
        "name": "සුනිල් සාන්ත",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1915 අප්‍රේල් 14",
        "Death": "1981 අප්‍රේල් 11\n\n(වයස අවුරුදු 66)",
        "description": "සුනිල් සාන්ත (සිංහල:සුනිල් සාන්ත; 14 අප්‍රේල් 1915 - 11 අප්‍රේල් 1981) ශ්‍රී ලංකාවේ කීර්තිමත් සහ බලගතු නිර්මාපකයෙකු, ගායකයෙකු සහ ගීත රචකයෙකි. 1940 දශකයේ මැද භාගයේ සිට අග භාගයේ සහ 1950 ගණන්වල මුල් භාගයේ දී ඔහු සිංහල සංගීතය සහ ජන ගී සංවර්ධනයෙහිලා ප්‍රධාන විය. ඔහු 1956 සහ 1960 දී ලෙස්ටර් ජේම්ස් පීරිස්ගේ රේඛාව සහ සංදේශය සඳහා ආදරණීය හඬපට රචනා කළේය. පසුව නැවත පැමිණීමේදී ඔහු පර්යේෂණාත්මක කෘති කිහිපයක් නිෂ්පාදනය කළේය.\n\nජීවිතය සහ වෘත්තිය\n\nමුල් ජීවිතය (1915-1945)\n\nසුනිල් සාන්ත උපන්නේ 1915 අප්‍රේල් 14 වැනිදා සිංහල අලුත් අවුරුදු දිනයේ ජාඇල දෙහියගත ප්‍රදේශයේය. ඔහුගේ දෙමාපියන් දෙදෙනාම ඔහුට වයස අවුරුදු දෙකට පෙර මිය ගිය අතර සාන්ත හැදී වැඩුණේ ඔහුගේ ආච්චි විසිනි. ළාබාල වියේදීම ඔහු ජනප්‍රියත්වයට පත්වූයේ ගමේ නාට්‍යයක දුටුගැමුණු රජුගේ චරිතය රඟපාමිනි. එක් ගැමියෙක් ඔහුව බැටරි බලයෙන් ක්‍රියාත්මක කරන ආලෝකවත් මාලයකින් සරසා ඇත. ඔහු අධ්‍යාපනය ලැබුවේ කීර්තිමත් ගාල්ල ශාන්ත ඇලෝසියස් විද්‍යාලයෙනි.\n\nසාන්ත පාසල් හැර යාමේ සහතික පත්‍ර විභාගයෙන් දිවයිනේ ප්‍රථමයා ලෙස සමත් වූ අතර තරුණ වියේදී තම පන්තියේ වැඩිම ලකුණු ලබාගෙන වීරරත්න සම්මානයෙන් පිදුම් ලැබීය. 1933 දී ඔහු ගුරු අවසන් විභාගය අවසන් කර ගල්වාරි ගල්කිස්ස පාසලේ ගුරුවරයෙකු ලෙස වැඩ ආරම්භ කළේය. සාන්ත එහි සේවය කරන අතරතුර දක්ෂිණ පාසල් සංගීත තරගයෙන් පිට පිටම ජයග්‍රහණ තුනක් පාසලට ගෙන ආවේය. 1939 දී ඔහු අතරමැදි ගාන්දර්ව විභාගය සමත් වී ශාරීරික පුහුණුව පිළිබඳ සහතිකයක් ලබා ගත්තේය. ඔහු පියානෝව සහ ගිටාර් වාදනයටත් ඉගෙන ගත්තේ එකල. ඔහු මෙම කාලය තුළ \"හැම්ලට්\" ඇතුළු නාට්‍ය කිහිපයක් රඟපාමින් නිෂ්පාදනය කළේය.\n\n1940 දී සාන්ත ඉගැන්වීම අත්හැර සංගීතය හැදෑරීමට ශාන්තිනිකේතනයට ගියේය. ඊළඟ වසරේ සාන්ත භාත්ඛණ්ඩේ සංගීත ආයතනයට ඇතුළත් වූ අතර 1944 දී විශාරද උපාධිය ලබා ගැනීමට කටයුතු කළේය. ඔහු සිතාර් සහ ගායනයේ පළමු අංශයෙන් පළමුවැනියා ලෙස අවසන් විභාගය සමත් වූ අතර එසේ කළ පළමු ඉන්දියානු නොවන ආසියානු ජාතිකයා විය. පසුව ඔහු \"සුනිල් සාන්ත\" යන නම ලබා ගත්තේය. ඉන්දියාවේ අධ්‍යාපනය ලබන කාලය තුළ ඔහු ශ්‍රී ලංකාවේ පුවත්පත්වලට නිතිපතා දායක විය.\n\nරේඩියෝ සිලෝන් (1946–1952)\n\n1946 මාර්තු 2 වන දින කුමාරතුංග ගුණ සමරු උත්සවය සඳහා සාන්තට ගායනාවක් පැවැත් වූ අතර රේඩියෝ සිලෝන් සඳහා පටිගත කරන ලෙස ඉල්ලා සිටියේය. ඉදිරි වසර හය තුළ ඔහුට \"ඕලු පිපිලා\" (එවකට රේඩියන් සිලෝන් හි පටිගත කළ පළමු ගීතය), \"හඳපානේ\", \"හෝ ගා රැල්ල නෑගේ\", \"බෝවිටියා දන් පලුකන් වරේ\" ඇතුළු ජනප්‍රිය ගීත වැලක් ලැබෙනු ඇත. \"සුවද රෝස මල් නෙලා\", \"කෝකිලයන්ගේ\", \"මිහිකතනාවල\". සාන්ත ඔහුගේ ගීත තුළින් ඔහුගේ සිංහල උරුමය අවධාරණය කළේ ඉංග්‍රීසි වෙනුවට සිංහලෙන් ගායනා කිරීමට මිස ඉන්දියාවේ හින්දුස්ථානි සහ දෙමළ ගීත පිටපත් නොකිරීමටය. කඩිසර ගීත රචකයෙකු වන ශාන්තා හුබර්ත් දිසානායක, මුනිදාස කුමාරතුංග, රයිපියෙල් තෙන්නකෝන්, අරිසෙන් අහුබුදු පියතුමා වැනි ගී පද රචකයින් විසින් රචනා කරන ලද ගීත ගායනා කළේය. මර්සලින් ජයකොඩි.\n\n1952 දී සන්තාට රේඩියෝ සිලෝන් තහනම් කරන ලද්දේ ඉන්දියානු සංගීතඥ රතන්ජංකර් සඳහා විගණනය කිරීම ප්‍රතික්ෂේප කිරීමෙන් පසුව, සංස්ථාව විසින් දකුණු ඉන්දියාවෙන් ඔවුන්ගේ මධ්‍යස්ථානවල සංගීත අධ්‍යක්ෂණය අධීක්ෂණය කිරීම සඳහා ගෙන එන ලදී. එම වසරේ ඔහු පාසල් ගුරුවරියක් වන බර්නඩෙට් ලීලාවතී ජයසේකර සමඟ විවාහ විය.\n\nපසුකාලීන ජීවිතය\n\nරේඩියෝ සිලෝන් ආයතනයෙන් සේවයෙන් පහකිරීමෙන් පසු ශාන්තට මුදල් ගැටලු ඇති විය. ඔහුගේ ගීත පොත් සොරකම් කරන ලදී, ඔහුගේ ගීත ප්‍රකාශන හිමිකම් කඩකරන්නන් විසින් කැමැත්තෙන් හෝ කර්තෘභාගයකින් තොරව විකුණා ඇත. ඔහු ඉදිරි වසර කිහිපය තුළ ඡායාරූපකරණය, ඇඳුම් විකිණීම සහ ඉලෙක්ට්‍රොනික උපකරණ වැනි විවිධ වෙළඳාම් කිරීමට උත්සාහ කළේය.\n\n1953 දී සාන්ත මරදාන නිව්ටන් ගොඩනැගිල්ලේ කුඩා පාසලක් ආරම්භ කළේ සිසුන් 10 දෙනෙකුට නොමිලේ ඉගැන්වීමට පොරොන්දු වෙමිනි. ඔහු බොහෝ විට සෙසු කලාකරුවන්ට සහ පොරොන්දු වූ දක්ෂයින්ට උදව් කළේය. ඔහු ආනන්ද සමරකෝන්ගේ දුක්ඛිත තත්ත්වය ගැන පුවත්පත්වලට ලියා ජාතික ගීයේ නිර්මාපකයා වෙත අවධානය යොමු කිරීමට උත්සාහ කළේය. සුනිල්ගේ ප්‍රසංගවලට වයලීනය වාදනය කළ ඇල්බට් පෙරේරාට (පසුව ඩබ්ලිව්.ඩී. අමරදේව ලෙසින්) පිහිටක් අවශ්‍ය වූ මොහොතක සුනිල් ඔහුට පානදුරේ ඔහුගේ සංගීත පන්ති දෙකක් දුන්නේ උගන්වමින් ජීවත් වීමටය. අමරදේව වැඩිදුර අධ්‍යාපනය සඳහා ඉන්දියාවට යැවීමට සුනිල් ද මුදල් එකතු කළේය.\n\n1955 දී මාධ්‍යවේදී ඩී.බී. ධනපාල සාන්තගේ දුක්ඛිත තත්ත්වය හෙළි කිරීමේ ව්‍යාපාරයක් ආරම්භ කළ අතර ඔහුගේ තීරු ලිපියෙන් යම් මුදලක් රැස් කළේය.\n\nලංකාදීප\n\n.\n\n1967 අධ්‍යක්ෂ ජනරාල් නෙවිල් ජයවීර මහතා සාන්තට නැවත ජාතික ගුවන්විදුලි සේවයට එන්න කිව්වා. සාන්ත වැඩ කළේ ඩබ්ලිව්.ඩී අමරදේව සහ එච්. රූපසිංහ කලාකරුවන් විගණනයට.\n\nසාන්ත 1970 දී ඔහු ජීවත් වූ කුලී නිවසින් නෙරපා හැරීම නිසා ඔහුගේ මාමාගේ නිවසට පදිංචියට ගියේය.\n\nනමින් වාර්තාවක් 1977 දී\n\nසුනිල් ගී\n\n නිෂ්පාදනය කරන ලදී. n 1980 නමින් වාර්තාවක්\n\nසීගිරිල් ගී\n\n නිෂ්පාදනය කරන ලදී. ස්වර හතරක් පමණක් යොදා ගනිමින් තනු යොදා සුනිල් විසින් රචනා කරන ලද සහ රචනා කරන ලද ගීත සමූහයක් මෙහි අඩංගු විය. පද රචනය සීගිරි කුරුටු ගී (සීගිරි ග්‍රැෆිටි) මත පදනම් විය. ශ්‍රී ලාංකේය සම්ප්‍රදායික බෙර සහ වෙනත් වාද්‍ය භාණ්ඩ යොදා ගනිමින් අපූර්ව හඬක් නිර්මාණය කිරීම මෙම ගීතවල විශේෂත්වයකි.\n\nසාන්ත 1981 අප්‍රේල් 11 වන දින හෘදයාබාධයකින් මිය ගියේ ඔහුගේ පුත් ජගත් අද්භූත තත්වයන් යටතේ පිහිනුම් තටාකයක ගිලී මිය ගිය පසුවය."
    },
    {
        "name": "මොහිදීන් බේග්",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1919 දෙසැම්බර් 5",
        "Death": "1991 නොවැම්බර් 4\n\n(වයස අවුරුදු 71)",
        "Star sign": "ධනු ලග්නය",
        "Instruments:": "හඬ",
        "description": "මොහිදීන් බේග්\n\n (1919-1991) යනු අද දක්වාම ජනප්‍රියත්වයට පත් ඔහුගේ බෞද්ධ භක්ති සංගීතය සඳහා ප්‍රසිද්ධ ශ්‍රී ලාංකික සංගීතඥයෙකි. තමිල්නාඩුවේ සාලෙම් සිට ශ්‍රී ලංකාවට සංක්‍රමණය වූ නමුත් හයිඩ්‍රබාදි මුස්ලිම් සම්භවයක් ඇති මුස්ලිම් ජාතිකයෙකි. ඔහු රටේ කලා ඉතිහාසයේ ඉතා බලගතු බහු සංස්කෘතික/බහු ආගමික චරිතයක් ලෙස සැලකේ. බේග් සංගීත ක්‍ෂේත්‍රයට පිවිසියේ ඔහුගේ පුත් ඉෂාක් විසිනි, ඔහු ද ඔහුගේ පියා තරම් හොඳින් හඳුනා නොගත් නමුත් සැලකිය යුතු සාර්ථකත්වයක් අත්කර ගත්තේය. Baig සමඟ යුගලය කර ඇත\n\nඑච්.ආර්. ජෝතිපාල\n\n, ජී.එස්.බී. රාණි පෙරේරා, ලතා වල්පොල, සුජාතා අත්තනායක සහ ජමුනා රාණි ඇතුළු පිරිසක්. ඔහු සමඟ යුගල ගායනා කළ එකම ශ්‍රී ලාංකිකයා ද ඔහු විය\n\nලතා මංගේෂ්කාර්\n\n.\n\nMohideen Baig ගේ වඩාත් ප්‍රසිද්ධ හා වඩාත්ම ආදරය කරන ලද යුගල ගීත ශ්‍රී ලාංකේය සිනමා පුරාවෘත්තය, නිළිය සහ ගායිකාව සමඟ ගායනා කරන ලදී.\n\nරුක්මණී දේවි\n\n.\n\nජීවිතය සහ වෘත්තිය ඉන්දියාවේ තමිල්නාඩුවේ උපත ලැබූ බේග් 1932 දී ශ්‍රී ලංකාවට සංක්‍රමණය වූ අතර, 1934 දී කේ.කේ. රාජලක්ෂ්මි සමඟ යුගල ගීතයක කරුණා මුහුදේ නම් ගිලීලා ඔහුගේ පළමු ගීතය පටිගත කළේය. ඔහු 1947 දී දෙවන සිංහල චිත්‍රපටය වන අශෝකමාලාවෙන් පසුපෙළ ගායකයෙකු ලෙස ආරම්භ විය.\n\nබේග් බුද්ධං සරණං, මායා, ගිරිහෙල් මුදුනේ, ආදර නදිය ගලා, පෙම් මල් මාලා, වැල්ල සිඹින රැල්ල, අන්නා සුදෝ, තනිව උපන්නේ, සහ ලෝකේ සිහිනයක් වගෙයි වැනි ගීතවලින් කීර්තියක් අත්කර ගත්තේය. මෙම ජනප්‍රියත්වය රටේ පළමු නිදහස් දින උත්සවය සහ 1974 නොබැඳි සමුළුව වැනි කීර්තිමත් සිදුවීම්වලට පෙනී සිටීමට හේතු විය. 1956 දී අගමැති\n\nඑස්.ඩබ්ලිව්.ආර්.ඩී. බණ්ඩාරනායක\n\n බේග්ට විශිෂ්ට පුරවැසිභාවයක් පිරිනමන ලදී.\n\nබේග් 1983 දී සහ 1987 දී නැවතත් කලාශුරි සම්මානය දිනා ගත්තේය.\n\nDeathBaig ඇසේ සුද ඉවත් කිරීමේ ශල්‍යකර්මයේදී අනපේක්ෂිත ආසාදනයකින් මිය ගියේය. ඉස්ලාමීය සම්ප්රදායන් අනුගමනය කරමින්, ඔහුගේ අවමංගල්යය දිනක් ඇතුළත සංවිධානය කරන ලදී."
    },
    {
        "name": "තාරික් හිස්නි",
        "info": "ශ්‍රී ලාංකික නිර්මාපකයෙකු සහ ගායකයා",
        "Intro": "ශ්‍රී ලාංකික නිර්මාපකයෙකු සහ ගායකයා",
        "Is": "සංගීතඥයෙක්\n\nනිර්මාපකයෙක්\n\nවාර්තා නිෂ්පාදකයා\n\nගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "ව්යාපාරික\n\nසංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1990 අගෝස්තු 29, පුත්තලම, පුත්තලම දිස්ත්‍රික්කය, වයඹ පළාත, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 31 යි",
        "Star sign": "කන්‍යා ලග්නය",
        "Instruments:": "පියානෝව\n\nඉලෙක්ට්රොනික යතුරු පුවරුව\n\nහඬ",
        "Profiles": "",
        "description": "තාරික් හිස්නි\n\n, සරලව දන්නා සහ බැර කර ඇත\n\nතාරික්\n\n, ශ්‍රී ලාංකික නිර්මාපකයෙකු සහ ගායකයෙකි, ප්‍රධාන වශයෙන් ඉන්දියානු සංගීත ක්ෂේත්‍රය සඳහා සේවය කරයි.\n\nමුල් ජීවිතය සහ අධ්‍යාපනය තාරික් උපත ලැබුවේ ශ්‍රී ලංකාවේ වයඹ පළාතේ පුත්තලමේ ය. කුඩා කාලයේ සිටම ගායකයෙකු ලෙස ඔහු දක්ෂතා පෙන්වූවා. ඔහුගේ මුල් කාලයේ ඔහු කැරෝකී කලාකරුවෙකු ලෙස ගීත ගායනා කළේය. ඔහු සංගීතය රචනා කිරීමට ද උනන්දුවක් ඇති කළේය. ඔහු පිළිගෙන ඇත\n\nයුවන් ශංකර් රාජා\n\n,\n\nඒආර් රහ්මාන්\n\n හා\n\nකාර්තික්\n\n ඔහුගේ ආශ්වාදයන් ලෙස.\n\nතාරික් කර්නාටක සංගීතය, බටහිර සංගීත න්‍යාය සහ පියානෝව ඉගෙන ගත්තේය.\n\nවෘත්තීය ජීවිතය 2016 දී, තාරික් සංගීතය රචනා කිරීමට පටන් ගත්තේය. එම වසරේම ඔහු සිය පළමු ඇල්බමය නිකුත් කළේය.\n\nIzhaar-e-Ishq\n\n, හින්දි භාෂාවෙන්. ඔහු පසුබිම් ගායකයින් සමඟ සහයෝගයෙන් කටයුතු කළේය\n\nයාසින් නිසාර්\n\n සහ ශ්‍රීෂා මෙම ඇල්බමයේ \"Bin Tere\" ගීතය සඳහා. මෙම ගීතය නිකුත් වූ විගස ඉන්දියානු උප මහද්වීපයේ සහ මැදපෙරදිග රටවල තරුණයින් අතර ප්‍රදර්ශනය වී ඇත. එසේම මෙම ඇල්බමයේ ගීත චෙන්නායි, බැංගලෝර් සහ රියාද් ඇතුළු විවිධ ස්ථානවල පටිගත කර ඇත.\n\n2017 දී, Tariq ඔහුගේ පළමු දෙමළ ගීතය \"Hey Penne\" සත්‍යප්‍රකාශ් සමඟ සහයෝගයෙන් නිකුත් කළේය. 2019 දී, තාරික් රචනා කිරීම කෙරෙහි වැඩි අවධානයක් යොමු කරන බැවින් ශබ්ද පට සහ පසුබිම් ලකුණු සඳහා වැඩ කිරීමට පටන් ගත්තේය.\n\nගීත රචකයෙකු ලෙස ගායකයෙකු ලෙස ඩිස්කෝග්‍රැෆි"
    },
    {
        "name": "ලහිරු පෙරේරා",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්, සංගීතඥයෙක් සහ සංගීත නිෂ්පාදකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්, සංගීතඥයෙක් සහ සංගීත නිෂ්පාදකයෙක්",
        "A.K.A.": "ලා සිග්නෝර්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1984 අප්‍රේල් 18, ශ්‍රී ලංකාව, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 37 යි",
        "Star sign": "මේෂ",
        "Profiles": "",
        "description": "ලහිරු පෙරේරා\n\n (සිංහල:\n\nලහිරු පෙරේරා\n\n; උපත 1984 අප්‍රේල් 18) ඔහුගේ වේදිකා නාමයෙන් ද හැඳින්වේ\n\nලා සිග්නෝර්\n\n ශ්‍රී ලාංකේය ගායකයෙක්, සංගීතඥයෙක් සහ සංගීත නිෂ්පාදකයෙක් වන අතර ඔහු ඔහුගේ 2008 විශිෂ්ටතම ජනප්‍රිය ගීතය වන \"රම්බරී\" සමඟින් ජනප්‍රිය විය. ඔහු ඉපදී හැදී වැඩුණේ උඩුගම්පොල කෙහෙල්බද්දර ප්‍රදේශයේය.\n\nතනි ගීතයක් නිකුත් කර ඇත"
    },
    {
        "name": "ඇනස්ලි මාලේවන",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Instruments:": "හඬ",
        "description": "ඇනස්ලි මාලවන\n\n හෝ\n\nමාලේවන\n\n (\n\n[ˈænəsli ˈmaːləvənə]\n\n) (සිංහල: ඇනස්ලි මාලේවන) ක්ලැරන්ස් විජේවර්ධන සමඟ රත්නපුරයෙන් (ඔහුගේ උපන් ගම) ඔහුගේ සංගීත ගමන ආරම්භ කළේය. 1966 දී ඔවුන් Moonstones නමින් කණ්ඩායමක් පිහිටුවා ගත්හ. ඇනස්ලි මාලවන ශ්‍රී ලාංකේය සංගීතඥයෙකි.\n\nජීවිතය සහ වෘත්තිය මාලේවන රත්නපුරයේ (ශ්‍රී ලංකාවේ දකුණු-මැද නගරයක්) උපත ලැබූ අතර කොළඹ අගනුවර ශාන්ත ජෝශප් විද්‍යාලයට ඇතුළත් විය. ඉස්කෝලේ ඇරිලා එනකොට මුණගැහුණා\n\nක්ලැරන්ස් විජේවර්ධන\n\n, සහ දෙදෙනා Moonstones කණ්ඩායම පිහිටුවා ගත්හ. 1960 ගණන්වල මුල් භාගයේදී, සඳකඩ පහණ විජේවර්ධන විසින් රචනා කරන ලද සහ මාලේවන විසින් ගායනා කරන ලද ගීත ගායනා කිරීමට පටන් ගත්තේය (ඔවුන්ගේ පළමු පහර\n\nඅඹ නන්දා\n\n - ඔවුන්ගේ සම්බන්ධතාවයේ මුල් දිනවල ක්ලැරන්ස්ගේ බිරිඳගේ නිවසේ වරක් වැඩ කළ සේවිකාව ගැන ලියූ ගීතයක්).\n\nසඳකඩ පහණ මූලික වශයෙන් විජේවර්ධනගේ අද්විතීය රචනා නිසා, සඳකඩ පහණ දශකයකට ආසන්න කාලයක් පුරා ජනප්‍රිය ශ්‍රී ලාංකීය සංගීතයේ ආධිපත්‍යය දැරූ අතර අවසානයේ 1960 දශකයේ අගභාගයේදී බිඳී ගියේය. Moonstones ප්‍රචාරක මිනිසා ශ්‍රී සඟබෝ කොරයා විසින් කළමනාකරණය කරන ලද අතර ජනප්‍රිය රේඩියෝ සිලෝන් විකාශකයා විසින් උපදේශකත්වය ලබා දෙන ලදී.\n\nවර්නන් කොරියා\n\n සහ ඔහුගේ මස්සිනා\n\nවිජය කොරයා\n\n. ඔවුන්ගේ සංගීතය ප්‍රථම වතාවට රේඩියෝ සිලෝන් ඉංග්‍රීසි සේවාවලත් පසුව ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවේත් ප්‍රදර්ශනය විය. 1960 දශකය පුරාවටම රේඩියෝ සිලෝන් හි විකාශනය වූ ප්‍රතිඵලයක් ලෙස ඒවා ගෘහ නාමයන් බවට පත් විය. ඇනස්ලි මාලේවන සමකාලීන බයිලාවේ දක්ෂයකු ලෙස ප්‍රසිද්ධියට පත් විය.\n\n1960, 1970 සහ 1980 දශකවල ශ්‍රී ලංකාවේ බොහෝ සංගීත ලෝලීන්ගේ තොල් මත 'මූන්ස්ටෝන්ස්' සහ 'සුපර් ගෝල්ඩන් චයිම්ස්' ගීත තිබුණා - සංගීතඥයන් ඔවුන්ගේ උච්චතම ස්ථානයේ සිටි අතර ඇනස්ලි ජනප්‍රියත්වයේ හිනිපෙත්තටම පැමිණ තිබුණි. දිවයිනේ සංගීත ලෝකයේ.\n\nසුපර් ගෝල්ඩන් චයිම්ස් මාලේවන සහ විජේවර්ධන මිතුරන් ලෙස සිටි අතර 1970 දශකයේදී නැවත එක් වී කණ්ඩායමක් පිහිටුවා ගත්හ.\n\nසුපර් ගෝල්ඩන් චයිම්ස්\n\n - මෙම කණ්ඩායම, ඒ හා සමානව, ඇතුළත් ජනප්‍රිය ගීත මාලාවක් නිෂ්පාදනය කරනු ඇත\n\nඋඩරට නිලිය\n\n (\n\nඋඩරට නර්තන ශිල්පියා\n\n),\n\nසිහින පැතුම්\n\n (\n\nසිහින තුළ\n\n),\n\nවන බඹරෝ\n\n (\n\nකැලෑ/වල් මී මැස්සන්\n\n), හා\n\nසතුට සෙනසුම\n\n (\n\nප්රීතිමත් හැඟීම්\n\n)\n\n1978 දී මාලේවන විවාහ වී සංගීතයෙන් විශ්‍රාම යන බව ප්‍රකාශ කරන තෙක් සුපර් ගෝල්ඩන් චයිම්ස් තවත් වසර අටක් රඟ දැක්වීය. විශ්‍රාම ගියද, මාලේවන 1988 දී තනි කලාකරුවෙකු ලෙස නැවත පැමිණ, විශේෂයෙන්ම ශ්‍රී ලංකාවේ නිකුත් කරන ලද සංයුක්ත තැටි සඳහා ගීත පටිගත කිරීම දිගටම කරගෙන ගියේය.\n\nසුපර් චයිම්ස් මාලේවන විශ්‍රාම දිවියෙන් සමුගත්තේ නැවතත් සංගීත ලෝකයට පිවිසීමටය. 2005 දී ඔහු සංගීත කණ්ඩායම පිහිටුවා ගත්තේය\n\nඇනස්ලි සහ සුපර් චයිම්ස්\n\n.\n\nමාලේවන පවසන පරිදි: \"විශේෂයෙන්ම පසුගිය වසරේ පැවති Super Golden Chimes Reunion ප්‍රසංගයෙන් පසුව එය සංගීත ක්ෂේත්‍රයේ දිගුකාලීන අවශ්‍යතාවයක් විය. Super Golden Chimes සමඟ දිගටම කරගෙන යාමට මගේ රසික රසිකාවියන්ගෙන් සහ සුභ පතන්නන්ගෙන් මට දැඩි පීඩනයක් එල්ල විය. සමහර සාමාජිකයන් විදේශගතව සිටින නිසාත් තවත් සමහරු විවිධ කණ්ඩායම්වල ක්‍රීඩා කරන නිසාත් මට Super Golden Chimes යන නම භාවිතා කිරීමට අවශ්‍ය නොවීය.\"\n\nමාලේවන සහ ක්ලැරන්ස් ඔවුන්ගේ දශක තුනක වෘත්තීය ජීවිතය තුළ ගායනා කරන ලද ගීත, ඔවුන්ගේ අද්විතීය සංගීත ශෛලිය සැකසීමට ඔවුන්ට බලපෑම් කිරීමට දායක වූ බවට පහන් සිළු කණ්ඩායම විසින් මෑතකදී ගෞරවයට පාත්‍ර විය. ඇනස්ලි මාලේවන ඉතා ගෞරවාදරයට පාත්‍ර වූ පටිගත කිරීම් ශිල්පියෙකු ලෙසත් ප්‍රවීණ සංගීතවේදියෙකු ලෙසත් කීර්තියේ හිනිපෙත්තටම පැමිණ ඇත. ඔහුගේ සමීපතම මිතුරා වූ නැසීගිය ක්ලැරන්ස් විජේවර්ධන සමඟ ඔවුන් දකුණු ආසියාවේ සංගීත ලෝකයේ ඉහළම ස්ථානයක සිටියහ. විජයවර්ධන සහ මාලේවන යනු ශ්‍රී ලංකාවේ වඩාත්ම ඉල්ලුමක් තිබූ සංගීතඥයන් දෙදෙනෙකි.\n\nඔවුන්ගේ ගීත දශක ගණනාවක් තිස්සේ රේඩියෝ සිලෝන්/ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාවේ ඉංග්‍රීසි සේවයේ සහ සිංහල සේවයේ ප්‍රස්ථාරවල ඉහළින්ම සිටියේය. ඇනස්ලි මාලේවන රූපවාහිනියේ ද අනන්තවත් පෙනී සිට ඇත.\n\nඔහුගේ හඬ ලන්ඩන් වැසියන්ට බීබීසී රේඩියෝව ලන්ඩන් 206 හරහා 'ලන්ඩන් සවුන්ඩ්ස් ඊස්ටර්න්' ගුවන් විදුලි වැඩසටහනෙන් සහ එක්සත් ජනපදයේ සහ ඕස්ට්‍රේලියාවේ ප්‍රජා ගුවන් විදුලියෙන් අසා ඇත.\n\nYouTube හි ඇනස්ලි මාලේවනට සවන් දෙන්න:"
    },
    {
        "name": "තාරක මහේෂ්",
        "info": "ශ්‍රී ලාංකික නිර්මාණකරුවෙක්",
        "Intro": "ශ්‍රී ලාංකික නිර්මාණකරුවෙක්",
        "Known for": "ඇල්බම කලාකරු: zuoiouz, Forneybybeek, Fire Nations, Sensa 2020, Neegalle",
        "A.K.A.": "වැක්වැල්ල ගමගේ තාරක මහේෂ් පියරත්න, තාරක මහේෂ් පියරත්න, ...",
        "Is": "නිර්මාණකරු\n\nකලාකරු\n\nකර්තෘ\n\nසංගීතඥයෙක්\n\nගායකයා\n\nනළුවා\n\nYouTuber\n\nගී පද රචකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Gender": "පිරිමි",
        "Birth": "1997 පෙබරවාරි 20, නවගමුව",
        "Age": "අවුරුදු 24 යි",
        "Residence": "කඩුවෙල",
        "Family": "මව:\n\nතිලකා ජයංගනී\n\nපියා:\n\nපියරත්න",
        "Stats": "උස:\n\n175 සෙ.මී",
        "Education": "පන්නිපිටිය ධර්මපාල විද්‍යාලය\n\nG6-A/L\n\n2008-2016\n\nප්‍රාථමික විද්‍යාලය බෝමිරිය\n\nG1-5\n\n2003-2007",
        "Notable Works": "zuoiouz\n\n2020\n\nForneybybeek\n\n2020\n\nගිනි ජාතීන්\n\n2020\n\nසෙන්සා 2020\n\n2020\n\nනීගල්ල\n\n2020\n\nශ්‍රී ලංකා රියදුරු බලපත්‍රයක් ලබා ගන්නේ කෙසේද?\n\n2021",
        "Profiles": "",
        "description": "තාරක මහේෂ්\n\n ශ්‍රී ලංකාවේ නිදහස් ග්‍රැෆික් නිර්මාණකරුවෙකි, සංගීත නිර්මාණකරණයේ සහ ප්‍රචාරණයේ පළපුරුද්ද ඇත. තාරක මහේෂ්\n\n 1997 පෙබරවාරි 20 වැනි දින ශ්‍රී ලංකාවේ නවගමුවේදී උපත ලැබීය.වැක්වැල්ල ගමගේ\n\nතාරක මහේෂ්\n\n පියරත්න පොදුවේ\n\nතාරක මහේෂ්\n\n, (සිංහල: තාරක මහේෂ්, දෙමළ: தாரக මහේෂ්) යනු ශ්‍රී ලාංකේය ලේඛකයෙක්, නිර්මාණකරුවෙක්, කලාකරුවෙක්, නිර්මාණකරුවෙක්, දානපතියෙක්, සමාජ මාධ්‍ය පෞරුෂයක් සහ අන්තර්ජාල ව්‍යවසායකයෙකි. තාරක පන්නිපිටිය ධර්මපාල විද්‍යාලයෙන් අධ්‍යාපනය අවසන් කර වාණිජ විෂය ධාරාවෙන් උසස් පෙළ හැදෑරුවේ ව්‍යාපාර සංඛ්‍යා ලේඛන සමඟිනි. (ඉහළ බෝමිරිය ප්‍රාථමික විද්‍යාලයේ 1-5 ශ්‍රේණිය) තාරක මහේෂ්\n\n හි නිර්මාතෘ/අධ්‍යක්ෂක ලෙස වඩාත් ප්‍රසිද්ධය\n\nටීඑම් TSOFT\n\n (2011 සිට ආරම්භක සමාගමක් පිරිනැමෙන නිෂ්පාදන සහ සේවා) සහ එහි ආරම්භකයන්ගෙන් එක් අයෙකි\n\nTeamGplus\n\n (2014 සිට කණ්ඩායම් ක්‍රියාකාරකම් කරන සමාජ සමාජය). ඔහු පරිගණකකරණය, දෝශ නිරාකරණය, උපකාර කිරීම, ක්‍රීඩකයා, ශිෂ්‍යයා, කළමනාකරණය, නිර්මාණකරු, සමාජ ජාලකරණය, ක්‍රීඩකයා, තොරතුරු තාක්‍ෂණය සහ සමාජ වැඩ කරයි. තාරක මහේෂ්\n\n නිල සත්‍යාපිත කලාකරු නාලිකා ඇත\n\nYouTube\n\n,\n\nYouTube Music\n\n,\n\nSpotify\n\n,\n\nඩීසර්\n\n,\n\niTunes\n\n,\n\nපැන්ඩෝරා\n\n,\n\nMusixmatch\n\n &\n\nඇමේසන්\n\n.අවසාන,\n\nතාරකා\n\n උපදේශන දැනුම සහ අදහස් ලබා දීම සහ ගැටළු විසඳීම සමඟ කණ්ඩායම්, ආරම්භක සමාගම් සහ ව්‍යාපාරවල සමහර ව්‍යාපෘති සමඟ වැඩ කරයි. වශයෙන්\n\nඔහුගේ භූමිකාව ඔහු\n\n නිර්වචනය කිරීම, සොයා ගැනීම, සැලසුම් කිරීම සහ නියමිත වේලාවට ලබා දීම\n\nතාරකා\n\n ඔහුගේ ගණිතය, ව්‍යාපාර සංඛ්‍යාලේඛන සහ තොරතුරු සහ තාක්ෂණික දැනුම සමඟ අන් අයට උපකාර කරයි. 7 වැනි ශ්‍රේණියේ සිට පාසල් ජීවිතයේදී ඔහු ගණිතයට දක්‍ෂ වූ අතර 2016 වසරේ අග සිට දුෂ්කර අධ්‍යයන ප්‍රශ්න පිළිබඳව උගන්වමින් සිටියේය. ඒවගේම ඔහු දේවල් ඉගෙන ගන්නා ආකාරය සහ ඒවා කර්මාන්තයේ කාර්යක්‍ෂමව භාවිතා කරන ආකාරය වැනි අලුත් දෙයක් ඉගෙන ගැනීමට උත්සාහ කරයි."
    },
    {
        "name": "එඩ්වඩ් ජයකොඩි",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1952 අප්‍රේල් 6, කෑගල්ල",
        "Age": "අවුරුදු 69 යි",
        "description": "එඩ්වඩ් ජයකොඩි (සිංහල:එඩ්වඩ් ජයකොඩි) යනු ශ්‍රී ලාංකික සංගීතඥයෙක්, ගායකයෙක් සහ තනු නිර්මාපකයෙකි. ජයකොඩි සිංහල චිත්‍රපට සහ රූපවාහිනී කතාමාලා සිය ගණනක් සඳහා සංගීතය අධ්‍යක්ෂණය කර ඇති අතර ළමා වැඩසටහන් සඳහා (\"කොප්පර කොප්පර\") ගීත රාශියක් ද රචනා කර ඇත.\n\nජයකොඩි 1987 වසරේ හොඳම ගායකයා ලෙස ගෙදර බුදුන් අම්මා චිත්‍රපටය වෙනුවෙන් ස්වර්ණ සංඛ සම්මානයෙන් පිදුම් ලැබීය. 1979 සහ 1980 හොඳම සංගීත අධ්‍යක්‍ෂවරයා ලෙස නිදානේ සහ අපරාදය සහ දඬුවම.ජීවිතය සහ වෘත්තිය යන නාට්‍ය සඳහා ඔහු සම්මාන ලැබීය.\n\nළමා අවධිය\n\nජයකොඩි 1952 අප්‍රේල් 6 වන දින ශ්‍රී ලංකාවේ කෑගල්ල හෙට්ටිමුල්ලේදී දොන් රෆියල් ජයකොඩි සහ වික්ටෝරියා ජයකොඩිගේ හයවැනි දරුවා ලෙස ජයකොඩි ආරච්චිගේ දොන් එඩ්වඩ් තිමති ජයකොඩි උපත ලැබීය. ඔහුගේ පවුල කතෝලික විය. ජයකොඩි බණ්ඩාරනායක කනිෂ්ඨ විද්‍යාලයෙන් මූලික අධ්‍යාපනය ලැබූ අතර ද්විතීයික අධ්‍යාපනය ලැබුවේ හිදී\n\nශාන්ත මරියා විද්‍යාලය\n\n කෑගල්ලේ. බණ්ඩාරනායක යන අතරතුර පල්ලියේ ගායන කණ්ඩායමට සම්බන්ධ වූ ඔහු ශාන්ත මරියා විද්‍යාලයේ එච්. සමරපාල ගුරුවරයා යටතේ සංගීතය ඉගෙන ගත්තේය.\n\nසංගීතයේ වැඩ කරන්න\n\n1968 සිට 1976 දක්වා කාලය තුළ ජයකොඩි මැලිබන් ගුවන්තොටිල්ල සහ ආධුනික සංගීත වැඩසටහන් සඳහා සහභාගී විය. 1976 වසරේ රජයේ සංගීත විද්‍යාලයට (දැනට කැලණිය විශ්වවිද්‍යාලයේ සෞන්දර්ය අධ්‍යාපන පීඨය) ඇතුළත් වූ ඔහු එම කාලය තුළ ජනප්‍රිය සංගීතඥයන් විසින් පවත්වනු ලැබූ සංගීත වැඩසටහන්වලට සහභාගි විය. එකල ඔහු කැසට් පට නිකුත් කිරීමට පටන් ගත් අතර ඔහුගේ වෘත්තීය ජීවිතය ආරම්භ විය.\n\nඔහු 1980 දශකයේ මැද භාගයේ කොළඹ නාලන්දා විද්‍යාලයේ සංගීත ගුරුවරයා විය.\n\nජයකොඩිගේ ඇල්බමය\n\nදේදුන පාලම\n\n 2003 අප්‍රේල් 6 වන දින නිකුත් කරන ලදී."
    },
    {
        "name": "ක්ලිෆ් ෆොනෙන්ඩර්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා\n\nගීත රචකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Death": "2000 නොවැම්බර් 21",
        "description": "ක්ලිෆ් ෆොනැන්ඩර් යනු අග්නිදිග ආසියාවේ සහ ලාස් වේගාස් හි ප්‍රසංග කළ ශ්‍රී ලාංකික සංගීත ian යෙකි (උපත කොළඹ). ක්ලිෆ් 2000 නොවැම්බර් 21 දින මිය ගියේය. වෘත්තීය ජීවිතය\n\nක්ලිෆ් හැදී වැඩුණේ කොළඹ වන අතර 1950 ගණන්වලදී ඔහු ලංකාව වටා සමාජ ශාලාවල සහ නැටුම්වල රඟ දැක්වීමට පටන් ගත්තේය.\n\nදකුණු ආසියාවේ පැරණිතම ගුවන් විදුලි මධ්‍යස්ථානය වන රේඩියෝ සිලෝන් (දැන් ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාව) ක්ලිෆ්ට ඔහුගේ පළමු නිරාවරණය ලංකාව තුළ සහ ඉන්දියාව ඇතුළු දකුණු ආසියාව පුරා ලබා දුන්නේය. විකාශකයින් වන වර්නන් කොරියා, ජිමී භාරුචා සහ ටිම් හෝෂින්ටන් ඔහුගේ ගීත වාදනය කළ අතර ඔවුන්ගේ ගුවන් විදුලි සංදර්ශනවල ඔහු සමඟ සම්මුඛ සාකච්ඡා කළහ.\n\nක්ලිෆ් පසුව හොංකොං පදනම් කරගත් 'The Fabulous Echoes' කණ්ඩායමට සම්බන්ධ විය. ඔවුන් හොංකොං, පිලිපීනය, මැලේසියාව, සිංගප්පූරුව, ඉන්දුනීසියාව සහ ජපානය යන රටවල රසික පිරිසක් ගොඩනඟා ගත්හ. Fabulous Echoes ඇමරිකා එක්සත් ජනපදයේ ලාස් වේගාස් හි වාදනය කරමින් ජාත්‍යන්තර නිරාවරණයක් ලබා ගත් අතර, මී පැක් සාමාජිකයින් වන ෆ්‍රෑන්ක් සිනාට්‍රා, ඩීන් මාටින් සහ සැමී ඩේවිස් ජූනියර් සමඟ එලා ෆිට්ස්ජෙරල්ඩ් සහ විශිෂ්ට 'සැච්මෝ' ලුවී ආම්ස්ට්‍රෝං සමඟ රඟ දැක්වීය. The Fabulous Echoes The Ed Sullivan Show හි සිදු කරන ලද්දේ එඩ් විසින් Thunderbird Lounge හි ක්‍රියා කරන අයුරු දැකීමෙන් පසුවය.\n\nCliff Foenander The Fabulous Echoes පසු ඔහුගේ සංගීත දිවිය දිගටම කරගෙන ගියේය. ඔහු ඕස්ට්‍රේලියාවේ මෙල්බර්න් හි පදිංචි විය. ෆොනැන්ඩර් 2000 නොවැම්බර් 21 වැනිදා ඕස්ට්‍රේලියාවේදී මිය ගියේය.\n\nඔහු ඕස්ට්‍රේලියාවේ සිටින කාලය තුළ ඔහුගේ කටහඬ සැබවින්ම මුහුකුරා ගිය අතර ඔහු මෙල්බර්න් හි සහ ඕස්ට්‍රේලියාවේ වෙනත් ස්ථානවල බොහෝ විනෝදාස්වාදකයෙකු විය. ඔහු ප්‍රමුඛ ඕස්ට්‍රේලියානු සංගීත කණ්ඩායම් ගණනාවක ප්‍රධාන ගායකයා විය. මේ වන විට ඕස්ට්‍රේලියාවේ ශ්‍රී ලාංකික සංක්‍රමණිකයන් විශාල සංඛ්‍යාවක් සිටි අතර ක්ලිෆ් ප්‍රධානියා වීම නිසා රාත්‍රී භෝජන සංග්‍රහයක් සහ සාදයක් සඳහා සෑම විටම ඉල්ලුමක් තිබුණි.\n\n පවුලේ\n\nක්ලිෆ්ගේ බෑණනුවන් වන රොබින් ෆොනැන්ඩර් ඕස්ට්‍රේලියාවේ රඟ දක්වන අතර සීකර්ස් ඇන්ඩ් ද නිව් සීකර්ස් හි ආරම්භක සාමාජිකයෙකු වූ ජන සංගීත කලාකරු කීත් පොට්ගර් සමඟ සංයුක්ත තැටි කිහිපයක් සහ 'ෆුර්දර් ඩවුන් ද රෝඩ්' ගැමි සංගීත ගීතයක් නිකුත් කර ඇත."
    },
    {
        "name": "මිග්නෝන් ප්‍රනාන්දු",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1943 මැයි 9, කොළඹ",
        "Age": "අවුරුදු 78 යි",
        "description": "මිග්නෝන් ප්‍රනාන්දු යනු ශ්‍රී ලාංකික ගායිකාවකි, ජනප්‍රිය \"ජෙට්ලයිනර්ස්\" කණ්ඩායමේ කොටසකි. මුල් ජීවිතය\n\nවයස අවුරුදු හතේදී මිග්නෝන් රේඩියෝ සිලෝන්හි ටැලන්ට් තරඟයෙන් ජයග්‍රහණය කළාය.\n\nනීතිය පිළිබඳ ඇයගේ උනන්දුව සංගීතයට ඇති ආශාව ඉක්මවා ගියේය, බටහිර සම්භාව්‍ය සංගීතය, කථනය සහ නාට්‍ය පිළිබඳ විධිමත් පුහුණුවක් ලබා ඇත. මෙය ඇයගේ ලොකුම ශක්තිය සහ ඇගේ සංගීත ජීවිතයට විශිෂ්ට පදනමක් විය.\n\n ජෙට්ලයිනර්ස්\n\n1965 දී, Mignonne සහ ඇයගේ කණ්ඩායම වන The Jetliners කළමනාකරු ටෝනි ප්‍රනාන්දුගේ මගපෙන්වීම යටතේ ක්ෂණික සාර්ථකත්වයක් ලබා ගත් අතර පසුව ඇයගේ සැමියා බවට පත් වූ අතර ඔවුන්ගේ ජනප්‍රියත්වය වැඩි විය. රේඩියෝ සිලෝන්, ඇගේ සංගීතය දේශීය ප්‍රේක්ෂකයන්ට පමණක් නොව දකුණු ආසියාව පුරාවටම හඳුන්වා දුන්නේය. සමූහයේ මුල් අවදියේදී ජෙට්ලයිනර්ස් කොළඹ ගාලු මුවදොර හෝටලයේ පිහිටි කොකනට් ග්‍රෝව් රාත්‍රී සමාජ ශාලාවේ තරු බිල්පත් ලබා ගත්තේය.\n\n1969 දී, EMI Records UK, සහ Keith Prowse Music London විසින් අත්සන් කරන ලද පළමු ශ්‍රී ලාංකිකයා බවට ඇය පත්විය. ලංකා ගීතය 'මංගල ගීතය' (මංගල මොහොත) KPM විසින් ප්‍රකාශන හිමිකම ලබාගත් ඇයගේ පළමු ගීතය විය.\n\nඇයගේ \"Love Don't Let Me Down\" ගීතය ලෝක ජනප්‍රිය ගීත උළෙලේ තානාපති කාර්යාලයේ සම්මානය දිනාගත්තා. තවත් මුල් සංයුතියක් වන \"Someday My Love\" ගීතයේ උළෙලේදී නිර්මාපකයා සහ රංගන ශිල්පියා සඳහා වූ Matsushita සම්මානය සහ විශේෂ ජූරි සම්මානය දිනා ගත්තේය.\n\nග්‍රීසියේ ඇතන්ස් නුවර පැවති 5 වැනි ඔලිම්පියාඩ් ඔලිම්පියාඩ් තරගයේ අවසන් මහා තරගය සඳහා \"ඔබ නිසා\" සිංහල රචනාවක් තෝරාගෙන එහි රන් පදක්කම දිනා ගන්නා ලදී. \"පොල් මිනිසා\" ටෝකියෝ හි පැවති ලෝක ජනප්‍රිය ගීත උළෙලේ අවසන් වටයට පිවිසියේය, ගායිකාවක්/රචිකාවක් එසේ කළ පළමු අවස්ථාව මෙයයි."
    },
    {
        "name": "J. A. මිල්ටන් පෙරේරා",
        "info": "ශ්‍රී ලාංකේය පසුබිම් ගායකයා",
        "Intro": "ශ්‍රී ලාංකේය පසුබිම් ගායකයා",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1929 මැයි 9",
        "Death": "1991 ඔක්තෝබර් 24\n\n(වයස අවුරුදු 62)",
        "description": "J. A. Milton Perera (1938- October 24, 1991) යනු 1960 සහ 1970 ගණන්වල ශ්‍රී ලාංකේය සිනමාවේ ප්‍රමුඛ පෙළේ පසුබිම් ගායකයෙකි.\n\nදක්ෂ තබ්ලා වාදකයෙකු වූ තබ්ලා පොඩි අප්පුහාමි නොහොත් ජේ.ඒ. එඩ්වින් පෙරේරාගේ පුත් මිල්ටන් උපත ලැබුවේ 1938 මැයි 5 වැනිදාය. තම පියාගේ ආභාෂය ඇතිව මිල්ටන් තරුණ වියේදීම තබ්ලාව වාදනය කිරීමට ප්‍රවීණ විය.\n\n1940 දී මිල්ටන් රේඩියෝ සිලෝන් සඳහා ඔහුගේ පළමු ගීතය වන \"ඇලෙහි බැඳි ජීවිතය\" ගායනා කළේය. එය මොහොමඩ් සාලි තනුවක් වටා ලියා ඇත්තේ ඇලෝයි ගුණවර්ධන විසිනි. ඉන්පසුව \"පොඩි කාලේ අපි දෙන්න\", \"ඔබ වැවේ වැව පහන මගේ\", \"සිකුරු ලිය කොමල ලිය\" සහ \"කල්‍යාණියේ\" වැනි ජනප්‍රිය ගීත කිහිපයක්ම ඔහු ගුවන් විදුලියේ ජනප්‍රිය විය.\n\nමිල්ටන් පසුපෙළ ගායනයට පිවිසියේ කුරුළු බැද්දේ (1961) ගීතයක් සමඟිනි. වසර 30ක ක්‍ෂේත්‍රය තුළ ඔහු ගාමිණී ෆොන්සේකා, ජෝ අබේවික්‍රම, ටෝනි රණසිංහ, විජය කුමාරතුංග, ආනන්ද ජයරත්න, ඩී.ආර්.නානායක්කාර, ඇන්තනි සී.පෙරේරා, ස්ටැන්ලි පෙරේරා වැනි රංගන ශිල්පීන්ට අදට වෙඩිය හෙට හොන්දයි, වැනි චිත්‍රපටවල හඬ ලබා දුන්නේය. ධීවරයෝ, යටගිය දවස, අල්ලපු ගෙදර, බයිසිකල් හොරා, දරු දුක, සාරවිට, අටවෙනි පුදුමය, චණ්ඩියා සහ දෙයියන්ගේ තීණ්ඩුව.\n\nමිල්ටන් මිය ගියේ 1991 ඔක්‌තෝබර් 24 වැනිදා."
    },
    {
        "name": "කසුන් කල්හාර",
        "info": "සංගීතඥයෙක්",
        "Intro": "සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1981 නොවැම්බර් 3, රාජගිරිය",
        "Age": "අවුරුදු 40 යි",
        "description": "කසුන් කල්හාර ජයවර්ධන (සිංහල: කසුන් කල්හාර ) (උපත 3 නොවැම්බර් 1981) යනු ශ්‍රී ලාංකික ගායකයෙක්, සංගීතඥයෙක් සහ වාර්තා නිෂ්පාදකයෙකි. කසුන් ඔහුගේ සංගීත දිවිය තුළ හරිත නිම්නයේ, රැඩිකල් ප්‍රේමය සහ රොමෑන්ටික ඔපෙරා ලෙස ඇල්බම තුනක් නිකුත් කර ඇත. ඔහු ශ්‍රී ලංකාවේ විශාලතම සහ වැඩියෙන්ම අලෙවි වන සංගීත කලාකරුවන්ගෙන් කෙනෙකි. චරිතාපදානය\n\nකසුන් ශ්‍රී ලංකාවේ රාජගිරියේ 1981 නොවැම්බර් 3 වන දින උපත ලැබීය. ඔහුගේ මව දිවංගත මාලනී බුලත්සිංහල ප්‍රවීණ ගායන ශිල්පිනියක වූ අතර ඔහුගේ පියා H.M ජයවර්ධන ද සංගීතවේදියෙකි.\n\n2000 වසරේ ඉන්ද්‍රචාප ලියනගේ සහ 2000 ආනන්ද විද්‍යාලයේ මිතුරු මිතුරියන් සමඟින් ඔහුගේ සංගීත දිවිය ආරම්භ විය. මේ වන විට ඔහුගේ සංගීත දිවියට ඔහුගේ මව විශාල සහයෝගයක් ලබා දුන් අතර තම පුතා තබන සෑම පියවරක් ගැනම ඉතා ආඩම්බර විය. වරක් පුවත්පත් සම්මුඛ පරීක්ෂකවරියක් ඇගෙන් ඇසුවේ \"ඔබේ ජීවිතයේ අමතක නොවන දිනය කුමක්ද?\" එවිට ඇය පිළිතුරු දුන්නේ \"මගේ පුත් කසුන් කල්හාරගේ ප්‍රථම සංගීත ප්‍රසංගයෙන් පසුව (ආත්‍රෝක්ෂාවේ තරංග) මාස්ත්‍රෝ ප්‍රේමසිරි කේමදාස බදාගෙන ප්‍රාර්ථනා කළ දිනයේ දී කේමදාසගේ එම උණුසුම් වැළඳගැනීමෙන් කසුන්ට සැබෑ දක්ෂතාවයක් සහ පැහැදිලි අනාගතයක් ඇති බව සහතික විය.\n\n\"Kasun Kalhara: Live in Concert\", \"Kasun Kalhara Unforgettable Live in Concert\", \"The Black Red White Concert\", \"Kasun Kalhara in Culture Shock\" සහ \" වැනි අනෙකුත් කලාකරුවන් සමඟ සහයෝගයෙන් ඒකපුද්ගල ප්‍රසංග ගණනාවක් පවත්වා ඇත. Love U: Live in Concert\".\n\nKasun Kalhara in Culture Shock (2013) සහ Kasun Kalhara LoveU (2016) මෙම ප්‍රසංග දෙක ශ්‍රී ලංකා ඉතිහාසයේ වැඩිම පිරිසක් සහභාගී වූ සංගීත සංදර්ශනවලින් එකක් බවට පත් වූ අතර එම අවස්ථා දෙක සඳහාම නෙළුම් පොකුණ මහින්ද රාජපක්ෂ රඟහල වෙත රසික රසිකාවියන් 5,000කට අධික පිරිසක් රැස්ව සිටියහ.\n\n පෞද්ගලික ජීවිතය\n\nකසුන් නදී කම්මල්වීර සමඟ විවාහ වී සිටින අතර ඔහුට පුතෙකු සිටී (දනු කල්හාර).\n\nඩිස්කෝග්‍රැෆි\n\nඇල්බම\n\nහරිත නිම්නයේ\n\n (2001)\n\nරැඩිකල් ප්‍රේමය\n\n (2005)\n\nරොමෑන්ටික ඔපෙරා\n\n (2008)\n\nවෙනත් කලාකරුවන් සමඟ\n\nආදර මල් වල\n\n ඉන්ද්‍රචාප ලියනගේ එක්ක\n\nආත්මාභිමානයයි\n\n ඉන්ද්‍රචාප ලියනගේ එක්ක\n\nආදරණිය වස්සානය (උරේෂා රවිහාරි සමඟ)\n\nPamaawee Pipuna (ඉන්දිකා උපමාලි සමඟ)\n\nරාත්‍රිය මනරම් (නිරෝෂා විරාජිනී සමඟ)\n\nසමගි සමාදාන (මාලනී බුලත්සිංහල සමඟ)\n\nසඳ අහිමි (ප්‍රදීපා ධර්මදාස සමඟ)\n\nShuunya Wuu Nagaraye (සමිතා මුදුන්කොටුව සමඟ)\n\nවීණාවී උරතලයේ (ඉන්ද්‍රචාපා ලියනගේ සමඟ)\n\nසඳ එළිය (සඳ එළිය)\n\n(ඉන්ද්‍රචාප ලියනගේ සමඟ)\n\nසිහිනයට තරම්\n\n(ප්‍රතිභා ප්‍රභා සමග)\n\nමලකයි කියා\n\n(කුෂානි සඳරේකා සමග)\n\nසාරා සඳේ\n\n(කුෂානි සඳරේකා සමග)\n\nආදරේ (ආදරණීය කතාවක් චිත්‍රපට ගීතය)\n\n(කුෂානි සඳරේකා සමඟ)\n\nAhasin Eha (ආදරණීය කතාවක් චිත්‍රපට ගීතය)\n\n(උරේෂා රවිහාරි)\n\nකේවල\n\nMage Diwi Pana Nala Rakinne (සිංහල ගීය)\n\nමා බලවත් කරන සමිදේ (සිංහල ගීය)\n\nසඳ මිතුරි (2009)\n\nමීදුම් දුමාරයේ (2009)\n\nගණිත මල් සේනා (2011)\n\nMata Kiya Denna (2011)\n\nAdarema Geethayak (2013)\n\nකඩදාසි ඔරු (2015)\n\nලොව දුටුවේ අම්මා (2015)\n\nලිහිණියේ (2015)\n\nඉතින් හදමු අපි අලුත් රටක් (ඉතින් හදමු අපි අලුත් රටක්)\n\nඅලුත් රටක් හදමු\n\n2015 ශ්‍රී ලංකා ජනාධිපතිවරණයේදී නව ප්‍රජාතන්ත්‍රවාදී පෙරමුණේ (ශ්‍රී ලංකා) ජයග්‍රහණය වෙනුවෙන් රූකාන්ත ගුණතිලක සමඟින් නිෂ්පාදනය කරන ලදී.\n\nශ්‍රී ලංකා ක්‍රිකට් තේමා ගීතය (2016)\n\nවරමලේ (2016)\n\nMe Obata Ahenawada (Adaraneeya Kathawak Movie Song 2016)\n\nVasilissa (2016)\n\nඅලයේ ඝාත (2016)\n\nසජීවී සංදර්ශන\n\n'හරිත නිම්නයේ' (2001)\n\n'රැඩිකල් ප්‍රේමය' (2005)\n\nරොමැන්ටික් ඔපෙරා (2008)\n\n'කසුන් කල්හාර ඉන්ද්‍රපචප සහ නාද්‍රෝ සමඟ සංස්කෘතික කම්පනයෙන්' (දිනය - සැප්තැම්බර් 7, 2013)\n\n'සුවි සඳ රෑ - සංගීත සංදර්ශනය' (දිනය - සැප්තැම්බර් 9, 2014)\n\n'4U Concert with Indrachapa Liyanage, Nadeeka Guruge & Nadeeka Jayawardena' (දිනය - ඔක්තෝබර් 24, 2015)\n\n'Love U Concert (2016) with Rookantha Gunathilake, Indrachapa Liyanage, Nadeeka Jawardhana & Umaria sinhawansa' (දිනය - පෙබරවාරි 14, 2016)\n\n'සඳමඬල - මාලනීගේ හඬ - සන්ධ්‍යා බුලත්සිංහල සමඟ සංගීත සංදර්ශනය' (දිනය - මාර්තු 29, 2016)\n\n'සරසවි අසපුව නිරෝෂා විරාජිනී සමඟ' (දිනය - 2016 මැයි 29)\n\n'සඳමඬල 2 - මාලනීගේ හඬ - සන්ධ්‍යා බුලත්සිංහල සමඟ සංගීත සංදර්ශනය' (දිනය - ජූනි 11, 2016)\n\n'රූකාන්ත ගුණතිලක සමඟ එපික් කතා මාලාව' (දිනය - 2016 ජූලි 8)\n\n'අමරකසුනාම්බර අමරසිරි පීරිස් සමඟ' (දිනය - 2016 ජූලි 10)\n\n'සඳමඬල 3 - මාලනීගේ හඬ - සන්ධ්‍යා බුලත්සිංහල සමඟ සංගීත සංදර්ශනය' (දිනය - ජූලි 31, 2016)\n\n'4U Concert II: Indrachapa Liyanage, Nadeeka Guruge & Nadeeka Jayawardena සමග' (දිනය - සැප්තැම්බර් 24, 2016)\n\n'INK Concert with Indrachapa Liyanage' (දිනය - ඔක්තෝබර් 29, 2016)\n\n'Ecoustica Concert with Indrachapa Liyanage, Nadeeka Guruge & Nadeeka Jayawardena' (දිනය - දෙසැම්බර් 3, 2016)\n\n'සමනල් සිහිනය ඉන්ද්‍රචාප ලියනගේ සමඟ ප්‍රසංගය' (දිනය - දෙසැම්බර් 29, 2016)\n\n'Romanthika Handawa with Nadeeka Guruge and Nadeeka Jayawardana' (දිනය - ජනවාරි 15, 2017)\n\n'සියපත් ස්වරා සමග නිරෝෂා විරාජිනී සහ ටී.එම්. ජයරත්න' (දිනය - 2017 ජනවාරි 21)"
    },
    {
        "name": "ශිහාන් මිහිරංග බෙනට්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "සංගීතඥයෙක්\n\nගායකයා\n\nනිර්මාපකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1985 මාර්තු 18",
        "Age": "අවුරුදු 36 යි",
        "Profiles": "",
        "description": "ශිහාන් මිහිරංග (සිංහල: ශිහාන් මිහිරංග; උපත 18 මාර්තු 1985), ශ්‍රී ලාංකික ගායකයෙක්, තනු නිර්මාපකයෙක් සහ ගීත රචකයෙකි. ඇමරිකන් අයිඩල් හා සමාන ශ්‍රී ලංකාවේ පිළිම වැඩසටහනක් වන සිරස සුපර්ස්ටාර් හි පළමු වාරයේ ඔහු පස්වන ස්ථානයට පත්විය. ඔහු ඔහුගේ පළමු ඇල්බමය Dreams of Shihan 2006 දී නිකුත් කළේය. පසුව 2008 දී ඔහු ඔහුගේ දෙවන ඇල්බමය වන Dreamz 2 - My Life නිකුත් කළේය. සිරස සුපර් ස්ටාර් සීසන් 1 හි 5 වැනි ස්ථානයේ සිටියද ශිහාන් සුපර් ස්ටාර් පිටියේ යොවුන් ගායක ගායිකාවන් අතර ජනප්‍රියම චරිතයක් වූ අතර ශිහාන් ශ්‍රී ලංකාවේ තාරුණ්‍යයේ සිහින කොල්ලා ලෙස හැඳින්වේ. සහ පසුබිම\n\nශිහාන් උපත ලැබුවේ 1985 මාර්තු 18 වැනිදා ටිරෝන් බෙනට් සහ නිලූ මල්ලිකාට දාව. ඔහුගේ පියා, ටිරෝන් බෙනට් ශබ්ද ඉංජිනේරුවෙකු වන අතර, කලින් බහරේනයේ සේවය කළේය. ඔහුට ශානිකා මිහිරවි නම් සහෝදරියක් සිටී. ඔහු ඉගෙන ගත්තේ කඳාන ද මැසනොද් විද්‍යාලයේ.\n\n විවාහ\n\nශිහාන් ගිෂ්නි ක්ලෙමෙන්ටා සිල්වා සමඟ විවාහ වූයේ 2012 ජනවාරි 25 වැනිදාය.ඔවුන්ගේ ආදර කතාව මීට වසර 9කට පෙර ආරම්භ වූ බව වාර්තා වන අතර එය විවාහ මංගල්‍යය දක්වාම මාධ්‍යයට රහසක්ව තිබුණි.\n\nවිවාහ උත්සවය හැඳල නායකකන්ද ශාන්ත මරියා දේවස්ථානයේදී පැවැත්විණි. මෙම සිදුවීම මාධ්‍ය අවධානයෙන් ඈත් කර තැබීමට පෙම්වතුන්ගේ අරමුණ වී තිබූ බව වාර්තා වේ. ක්ලෙමෙන්ටා යනු ශිහාන්ගේ පාසලේ පී.ටී.අයි කාරයෙක් වන උපාලි සිල්වාගේ දියණියයි. මංගල ඡායාරූපකරණය සිදු කළේ දයාන් විතාරණ විසිනි.\n\nමෙම යුවළට පුතුන් දෙදෙනෙක් සිටින අතර වැඩිමහල් පුත්‍රයා Shihan Kenneth Yarsh වන අතර බාලයා Shihan Glen Marsh වේ. .\n\n සංගීත වීඩියෝ සහ නර්තන නිර්මාණය\n\nශිහාන් ඔහුගේ පළමු ගීත වීඩියෝව නිකුත් කළේය\n\nAda Thaniyen maa\n\n ඒක ලංකාවේ ලොකු හිට් එකක් වුනා. පසුව එය 2007 දෙරණ මියුසික් වීඩියෝ සම්මාන උළෙලේ ජනප්‍රියම මියුසික් වීඩියෝ සම්මානය දිනා ගත්තේය. පසුව ඔහු ඔහුගේ ඇල්බම දෙකේ ජනප්‍රිය ගීත කිහිපයක් සඳහා වීඩියෝ නිකුත් කළේය. ඔහුගේ මියුසික් වීඩියෝ වගේ\n\nසෙව්වන්දියේ\n\n,\n\nසුලගක් වෙල\n\n,\n\nMata Nelaganna Bari\n\n,\n\nවස්සානේ\n\n,\n\nAe obama dai\n\n,\n\nමිහිරවියේ\n\n හා\n\nObage mathaken\n\n ශ්‍රී ලංකාවේ ජනප්‍රියම මියුසික් වීඩියෝ අතර විය.\n\nපසුව ඔහු සිංහල චිත්‍රපට කිහිපයකටම ගායනයට පිවිසියේය. ඔහු චිත්‍රපටයේ ප්‍රධාන පසුබිම් ගායකයා විය\n\nසුවඳ දනුන ජීවිතේ\n\n. චිත්‍රපටයේ ඔහුගේ ගීත ශ්‍රී ලංකාවේ ජනප්‍රිය ජනප්‍රියත්වයට පත්විය. පෙරද මෙවු සිනා, රොන් සුවඳ දෙන මල් සහ සිත් මල් හැඟුම් පොපියන යාමේ වැනි. ඔහු ගීතය සඳහා පසුබිම් ගායනය කළා,\n\nRaya Pibidee\n\n \"සුපර් සික්ස්\" චිත්රපටයේ.\n\nතුළ\n\nසිරස සුපර්ස්ටාර්\n\n වාරය 4 නැවත නම් කරන ලදී\n\nපරම්පරාව 4\n\n, නිරෝෂා පෙරේරා සමඟින් ශිහාන් වැඩසටහන මෙහෙයවීය.\n\nYawwane Sihina Yata Daelwune\n\nඔහු සිරස සුපර්ස්ටාර් 4 වන පරම්පරාවේ තේමා ගීතයද ගායනා කළේය.\n\nඔහුගේ ඩ්‍රීම්ස් ඔෆ් ෂිහාන් ඇල්බමය 2006 වසරේ ජනප්‍රියම ඇල්බමය සම්මානය දිනා ගත්තේය.\n\n සන්නාම තානාපති\n\nඔහු දැනට Mobitel Smart 5 සහ Ceylon Biscuits Limited හි Tiara Rollo කේක් සඳහා සන්නාම තානාපති ලෙස කටයුතු කරයි.\n\n ඇල්බම\n\nශිහාන්ගේ සිහින\n\n2006\n\nDreamz 2 - මගේ ජීවිතය\n\n2008\n\n ඛණ්ඩ ලැයිස්තුගත කිරීම\n\nDreamz of Shihan ඇල්බමයට ගීත ඇතුළත් විය\n\nනැත.\n\nශීර්ෂය\n\nදිග\n\n1.\n\n\"ඒ සොඳුරු සමනල් වියේ\"\n\n(ඇල්බම අනුවාදය)\n\n04.48\n\n2.\n\n\"අද තනියෙන් මා\"\n\n(2009 දෙරණ මියුසික් වීඩියෝ සම්මාන උළෙලේ වසරේ ජනප්‍රියම වීඩියෝව ලෙස ගීත වීඩියෝව හිමි විය.)\n\n04.26\n\n3.\n\n\"ආසා ගැටෙන\"\n\n(ඇල්බම අනුවාදය)\n\n04.16\n\n4.\n\n\"හිත හදන වෙලවේ\"\n\n(ඇල්බම අනුවාදය)\n\n03.47\n\n5.\n\n\"නෙතු කඩහළෙන තරුවක් වගේ\"\n\n(ඇල්බම අනුවාදය)\n\n03.56\n\n6.\n\n\"ඔබ දුටුවා කෑම වේලක්\"\n\n(ඇල්බම අනුවාදය)\n\n7.\n\n\"ඔබේ සෙනෙහෙ දෙවතින්\"\n\n(ඇල්බම අනුවාදය)\n\n04.15\n\n8.\n\n\"සිතින් පතන්න මා\"\n\n(ඇල්බම අනුවාදය)\n\n03.45\n\n9.\n\n\"සුදෝ සුදු ආදරේ\"\n\n(ඇල්බම අනුවාදය)\n\n10.\n\n\"සුදු රෝස මල් වටිල තිබ්බා\"\n\n(ඇල්බම අනුවාදය)\n\n ඛණ්ඩ ලැයිස්තුගත කිරීම\n\nDreamz 2-My Life ඇල්බමයට ගීත ඇතුළත් විය\n\nනැත.\n\nශීර්ෂය\n\nගී පද\n\nසංගීතය\n\nදිග\n\n1.\n\n\"ආදර හැඟුමට ඉදදෙන්න\"\n\n(Album Version. Ceylon Biscuits Limited හි චොක්ලට් සන්නාමය සඳහා වාණිජ පිටපතක් නිෂ්පාදනය කරන ලදී.)\n\nනන්දන වික්‍රමගේ\n\nරුක්ෂාන් මාර්ක්\n\n03.24\n\n2.\n\n\"ජීවිතේ පුර\"\n\n3.\n\n\"කියන්නේපා\"\n\n(ඇල්බම අනුවාදය)\n\n4.\n\n\"මතකයි හිත හාදුව එදා\"\n\n(ඇල්බම අනුවාදය)\n\n04.28\n\n5.\n\n\"මතකයි ඔබේ මුවේ සිනා\"\n\n(ඇල්බම අනුවාදය)\n\n04.09\n\n6.\n\n\"ඔබ ගියා\"\n\n(ශිහාන්ගේ පළමු ඇල්බමයේ මෙම ගීතයේ මන්දගාමී අනුවාදයක් අඩංගු වේ. දෙවන ඇල්බමයේ ගීතය රොක් ගණයට අයත් වේ.)\n\n7.\n\n\"මට නැල ගන්න බෙරී\"\n\n(ඇල්බම අනුවාදය)\n\nනන්දන වික්‍රමගේ\n\nරුක්ෂාන් මාර්ක්\n\n03.34\n\n8.\n\n\"ඔබද මා\"\n\n(ඇල්බම අනුවාදය)\n\n04.51\n\n9.\n\n\"පාය නීල අඹරේ\"\n\n(ඇල්බම අනුවාදය)\n\nනන්දන වික්‍රමගේ\n\nනලින් පෙරේරා\n\n03.58 කි\n\n10.\n\n\"පිනි බිංදු\"\n\n(ඇල්බම අනුවාදය)\n\nනන්දන වික්‍රමගේ\n\nරූකාන්ත ගුණතිලක\n\n11.\n\n\"පිනි පොද වැටෙන අරුණැල්ලේ\"\n\n(ඇල්බම අනුවාදය)\n\n04.23\n\n12.\n\n\"මිහිරවියේ\"\n\n(ඇල්බම අනුවාදය)\n\nනන්දන වික්‍රමගේ\n\nතේජා ඉද්දමල්ගොඩ\n\n04.00\n\n13.\n\n\"සින මල් කැකුළු පුබුදා\"\n\n(ඇල්බම අනුවාදය)\n\n04.28\n\n14.\n\n\"සුළඟක් වෙල\"\n\n(ඇල්බම අනුවාදය)\n\nනන්දන වික්‍රමගේ\n\nනලින් පෙරේරා\n\n04.12\n\n තනි ගීතයක් නිකුත් කර ඇත\n\nSolo Tracks\n\nනැත.\n\nශීර්ෂය\n\nදිග\n\n1.\n\n\"මා දෑසේ වේදනා (ප්‍රතිනිර්මාණය)\"\n\n(Solo Track Version)\n\n04.28\n\n2.\n\n\"මගේ හිතට ඇය දෙනුන\"\n\n(Solo Track Version)\n\n04.30\n\n3.\n\n\"මම දිහා බාලන් ලෙස\"\n\n(Solo Track Version)\n\n03.24\n\n4.\n\n\"පෙරද මව් සිනා (චිත්‍රපට ගීතය)\"\n\n(Solo Track Version)\n\n04.13\n\n5.\n\n\"රොන් සුවද දෙන (උරේෂා රවිහාරි ගායන ශිල්පිනිය සමඟ චිත්‍රපට ගීතයක් ලෙස යුගලය)\"\n\n(Solo Track Version)\n\n04.00\n\n6.\n\n\"ර සිහිනෙන් (ගායක නාමල් උඩුගමගේ මුල් ගීතයේ ප්‍රතිනිර්මාණය)\"\n\n(Solo Track Version)\n\n03.45\n\n7.\n\n\"වස්සානේ\"\n\n(Solo Track Version)\n\n03.40\n\n8.\n\n\"හතර කේන්දරේ\"\n\n(Solo Track Version)\n\n03.30\n\n9.\n\n\"රාය පිබිදී (සුපර් සික්ස් හි චිත්‍රපට ගීතය)\"\n\n(Solo Track Version)\n\n03.31\n\n10.\n\n\"ඔබ කෞරුද\"\n\n(Solo Track Version)\n\n04.39\n\n11.\n\n\"තනියෙන් ඉපදුනු නිසා\"\n\n(Solo Track Version)\n\n03.26\n\n12.\n\n\"රිදවාන ජීවිතේ\"\n\n(Solo Track Version)\n\n04.11\n\n13.\n\n\"මගේ වෙල ළඟ උන්නු ඔය\"\n\n(Solo Track Version)\n\n03.20\n\n14.\n\n\"යව්වනේ සිහින යට දෙල්වූනේ\"\n\n(Solo Track Version (සිරස සුපර්ස්ටාර් තේමා ගීතය – 4 පරම්පරාව))\n\n03.35\n\n15.\n\n\"එස් දෙක පියාන (රූකාන්ත ගුණතිලක ගීතයේ ප්‍රතිනිර්මාණය)\"\n\n(Solo Track Version)\n\n04.12\n\n16.\n\n\"අහසම රිදවා ( නිරෝෂා විරාජිනී සමග ජෝධා අක්බර් ටෙලිනාට්‍ය තේමා ගීතය )\"\n\n(Solo Track Version)\n\n02.40\n\n17.\n\n\"සෙනෙහේ අම්මාගේ (කසුන් කල්හාර, නිරෝෂා විරාජිනී සහ උමාරියා සිංහවංශ සමගින්)\"\n\n(Solo Track Version)\n\n04.04\n\n18.\n\n\"දෛවය අපේ\"\n\n(Solo Track Version)\n\n03.52\n\n19.\n\n\"ඔබගේ මතකන්\"\n\n(Solo Track Version)\n\n03.59\n\n20.\n\n\"ඇති මාව රේවතුවා\"\n\n(Solo Track Version)\n\n03.46\n\n21.\n\n\"දිනක මගේ\"\n\n(Solo Track Version)\n\n"
    },
    {
        "name": "ඇන්ටන් ජෝන්ස්",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Death": "2016 ජනවාරි 31",
        "description": "ඇන්ටන් ජෝන්ස් (සිංහල: ඇන්ටන් ජෝන්ස්) යනු ශ්‍රී ලාංකික සංගීතඥයෙකි. ඔහු සිංහල බයිලා හි ප්‍රධාන චරිතයක් වූ අතර \"මිණි ගවුම\" සහ \"උයල පිහල\" ඇතුළු ජනප්‍රිය ගීත කිහිපයක් තිබුණි. ජෝන්ස් කැසට් පට 37ක් සහ සීඩී තැටි අටක් නිකුත් කර ඇති අතර බොහෝ විට ඔහුගේ ගීතවල සමකාලීන සිදුවීම් වලට මුහුණ දුන්නේය. ඔහුගේ නවතම ඇල්බමය වන සෙබේ සිද්ධි ශ්‍රී ලංකාවට බලපෑ සුනාමියේ ප්‍රතිවිපාක ගැන සාකච්ඡා කළේය.\n\nඔහු 2016 පෙබරවාරි 21 වන දින මිය ගියේය. ජීවිතය සහ වෘත්තිය\n\nදළ විශ්ලේෂණය\n\nජෝන්ස් බර්ගර් පවුලෙන් උපත ලැබූ අතර හැදී වැඩුණේ අලුත්කඩේ ශාන්ත සෙබෙස්තියන් වීදියේ ය. ඔහු 1950 ගණන්වල මුල් භාගයේදී වොලී බැස්ටියන්ගේ මඟ පෙන්වීම යටතේ සංගීතයට පිවිසියේය. 1958 දී ඔහු රේඩියෝ සිලෝන් උත්සවයක් සඳහා සජීවී ප්‍රේක්ෂකයින් ඉදිරියේ පළමු වරට රඟ දැක්වීය.\n\nඔහුගේ සංගීත දිවියේ කාලසීමාව තුළ ජෝන්ස් රාජ්‍ය බැංකුවක ඉංග්‍රීසි ස්ටෙනෝග්‍රැෆර් ලෙසද සේවය කළේය. ඔහු වසර 35 ක සේවා කාලයක් සම්පූර්ණ කරමින් 1997 දී විශ්‍රාම ගියේය.\n\nපෞද්ගලික ජීවිතය\n\nජෝන්ස් විවාහ වී සිටින්නේ අයිරිස් ජෝන්ස් සමඟ වන අතර ඔහුට පුතුන් දෙදෙනෙකු සහ දියණියන් දෙදෙනෙකු සිටී. ඔහුගේ පුතුන් වන ටිරෝන් සහ ජූඩ් ජීවත් වන්නේ ප්‍රංශයේ පැරිස් නුවරය."
    },
    {
        "name": "රුක්මණී දේවි",
        "info": "ඉන්දියානු නිළියක්",
        "Intro": "ඉන්දියානු නිළියක්",
        "Was": "ගායකයා\n\nනළුවා",
        "From": "ශ්රී ලංකාව",
        "Type": "චිත්‍රපටය, රූපවාහිනිය, වේදිකාව සහ ගුවන්විදුලිය\n\nසංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1923 ජනවාරි 15, නුවරඑළිය",
        "Death": "1978 සැප්තැම්බර් 25, ජා-ඇල\n\n(වයස අවුරුදු 55)",
        "Family": "කලත්රයා:\n\nඑඩී ජයමාන්න",
        "description": "රුක්මණී දේවි (1923 ජනවාරි 15 ​​- 1978 ඔක්තෝබර් 28) ශ්‍රී ලාංකේය ගායිකාවක් සහ නිළියක් වූ අතර, ඇය බොහෝ විට \"ශ්‍රී ලංකාවේ නයිටිංගේල්\" ලෙසින් ප්‍රශංසාවට ලක් වූවාය. වේදිකාව හරහා රිදී තිරයට පැමිණි ඇය මියයන විට චිත්‍රපට 100කට ආසන්න ප්‍රමාණයක රඟපා තිබුණි. ගායනයට සමාන ආශාවක් මෙන්ම මධුර කටහඬක් ඇති ඇය ග්‍රැමෆෝන් යුගයේ ශ්‍රී ලංකාවේ ප්‍රමුඛතම ගායිකාව විය. ඇයගේ අභාවයෙන් පසු ඇය 1979 සරසවිය සම්මාන උළෙලේදී සරසවිය 'රණ තිසර'- Life Time Achievement Award සම්මානයෙන් පිදුම් ලැබුවාය.\n\nරුක්මණී දේවි, 1923 ජනවාරි 15 ​​වන දින ශ්‍රී ලංකාවේ නුවරඑළියේ රම්බොඩේදී දෙමළ කොළඹ චෙට්ටි ක්‍රිස්තියානි පවුලක ඩේසි රාසම්මා ඩැනියෙල්ස් ලෙස උපත ලැබුවාය. දෙවනුව, පස් දෙනෙකුගෙන් යුත් පවුලක, ඇගේ පියා ජෝන් ඩැනියෙල් වතුකරයක සේවය කළ අතර ඇගේ මව හෙලන් රෝස් ගුරුවරියකි.\n\nකොළඹ හැදී වැඩුණු ඇය ශාන්ත මැතිව් පාසලෙන් මුල් අධ්‍යාපනය ලබා වැල්ලවත්ත ශාන්ත ක්ලෙයාර් පාසලට ගියාය.\n\nකුඩා දැරියක ලෙස ඩැනියෙල්ස් ගායනා කිරීමට හා නැටීමට සහජ දක්ෂතාවයක් පෙන්නුම් කළේය. වයස අවුරුදු හතේදී ඇය නත්තල් කැරොල් ගායනා කිරීමට තෝරා ගන්නා ලදී. ගායනයට, නැටීමට මෙන්ම රංගනයට ද ඇයගේ හැකියාව ගැන පැහැදුණු ඇය නත්තල් නාට්‍යයක් වන ‘The Shoemaker's Wife’ හි ප්‍රධාන චරිතයක් නිරූපණය කිරීමට තෝරා ගන්නා ලදී.\n\nවේදිකා නාට්‍යය පුහුණු කර ඉදිරිපත් කළේ වැල්ලවත්ත ශාන්ත ක්ලෙයාර් පාසල විසිනි.\n\nඇය ඉතා උනන්දුවෙන් මේ චරිතය රඟපාන අයුරු දුටු නාට්‍ය නිෂ්පාදකවරයකු වූ වෝල්ටර් අබේසිංහ ඇයගේ ‘රාමායනය’ නාට්‍යයේ ‘සීතා’ ගේ ප්‍රධාන චරිතය නිරූපණය කිරීමට ඇයට ආරාධනා කරන ලෙස ඇගේ පියාගෙන් අවසර ඉල්ලා සිටියේය. මේ අනුව, 1935 දී යන්තම් වයස අවුරුදු 12 දී ඇය 'සිංහල නාට්‍ය සභාව' ඉදිරිපත් කළ මෙම වේදිකා නාට්‍යයේ රඟපෑවාය.\n\nබී.ඒ.ඩබ්ලිව්.ජයමාන්න විසින් ආරම්භ කරන ලද \"මිනර්වා ඩ්‍රැමැටික් ක්ලබ්\" විසින් නිෂ්පාදනය කරන ලද නාට්‍යවල රඟපාමින් සිටියදී ඇය සමඟ ඇති සමීප ඇසුරේ ප්‍රතිඵලයක් ලෙස ඇය ආදරය කළ ප්‍රවීණ නාට්‍යකරුවෙකු, නළුවෙකු සහ ගායකයෙකු වන එඩී ජයමාන්න සමඟ විවාහ වූවාය. ඔවුන් පදිංචිව සිටියේ මීගමුව අඟුරුකාරමුල්ලේ \"ජය රුක්\" හි ය.\n\n වෘත්තීය\n\nමෙය දශක හතරක් පුරා දිවෙන කීර්තිමත් වෘත්තියක ආරම්භය සනිටුහන් කළේය. ඇයගේ රංගනයන් පිරී ඉතිරී ගිය ප්‍රේක්ෂකයින් විසින් බෙහෙවින් අගය කරන ලද හෙයින්, සුප්‍රසිද්ධ නාට්‍යකරුවෙකු වන ඩික් ඩයස් ඔහුගේ වේදිකා නාට්‍ය දෙකක් වන \"ජන කිහරණය\" සහ \"මායාවතී\" සඳහා ඇයව තෝරා ගත්තේය. චාල්ස් ඩයස්ගේ 'මායාවතී' චිත්‍රපටයේ මායාවතී බවට පත් වූ ඇය, රෝමියෝ ජුලියට්ගේ සිංහල අනුවර්තනයක ජුලියට් ලෙසින්, ඒ සියල්ලේම ප්‍රධාන කාන්තා චරිතය රඟපාමින්, ඇය දැන් වේදිකා නාට්‍යවලින් පිරී ඉතිරී ගොසිනි.\n\nමාස්ටර් සමඟින් ඇය විසින් සුප්‍රසිද්ධ \"සිරි බුද්ධගයා විහාරේ\" ගීතයේ පළමු හඬ පටය සමඟින්\n\n\"එච්. ඩබ්ලිව්. රූපසිංහ\"\n\n.\n\n 1938 දී ඇය ජනතාවගේ හදවත් දිනාගත් අතර ඇය නිළියකගේ සිට ගායිකාවක් බවට පත් වූ නිළියකගේ වෘත්තීය ජීවිතය හැඩගස්වා ගත්තාය. මෙම ගීතය N-9300 අංකය සහිත HMV 78 rpm (ග්‍රැමෆෝන්) පටිගත කරන ලද අතර 1939 දී HMV සඳහා දේශීය නියෝජිතයන් වන Cargills Ltd විසින් නිකුත් කරන ලදී.\n\nඇයගේ ගායන දිවිය වේදිකාවෙන් රිදී තිරයට ගමන් කරන විට ඇයගේ අද්විතීය හඬ බොහෝ සංගීත අධ්‍යක්ෂවරුන් ආකර්ෂණය කර ගත්තේය.\n\nඇගේ නම ඩේසි ඩැනියෙල්ගේ සිට සුප්‍රසිද්ධ 'රුක්මණී දේවි' ලෙස වෙනස් වූයේ ද මේ කාලයේදීය. \"රුක්මණී දේවි\" යන නම ඇතිවූයේ කෙසේද යන්න ගැන සිතීමේ පන්ති දෙකක් තිබේ. එක් පාසලකට අනුව දිවංගත එච්.ඩබ්ලිව්.රූපසිංහ විශාරදයා මෙම නම නිර්මාණය කළ අතර අනෙකා විශ්වාස කරන්නේ ජයන්ත වීරසේකර සහ 90 ගණන්වල පසුවන මයිකල් සන්නස් ලියනගේ එය නිර්මාණය කළ බවයි.\n\nමීගමුවේ \"මිනර්වා ඩ්‍රැමැටික් ක්ලබ්\" නිර්මාතෘ බී.ඒ.ඩබ්ලිව්.ජයමාන්න රුක්මණීව ඔහුගේ 'පෙනීම', 'කඩවුණු පොරොන්දුව', 'ඉරනම වෙනස් කිරීම, 'පරාජය වූ අරමුණ', 'පළායන ප්‍රතික්ෂේප කිරීම', වැනි රසවත් විශේෂාංග සහිත නාට්‍යවල කැපී පෙනෙන චරිත නිරූපණය කිරීමට රුක්මණීව කැඳවාගෙන ගියේය. Fanatic Faith', 'Grisly Guardian', 'Hasty Decision' සහ අවසාන වශයෙන් 'Irangani'. ඉහත සඳහන් කළ නාට්‍ය ඉංග්‍රීසි හෝඩිය අනුගමනය කළේය.\n\nජනප්‍රිය ‘කඩවුණු පොරොන්දුව’ (කඩවුණු පොරොන්දුව) නාට්‍යය චිත්‍රපටයකට අනුවර්තනය කළේ බී.ඒ.ඩබ්ලිව්.ජයමාන්න විසිනි. මෙය 1947 ජනවාරි 21 තිරගත වූ ප්‍රථම සිංහල චිත්‍රපටයයි - කඩවුණු පොරොන්දුව. මෙම චිත්‍රපටයේ 'රංජනී'ගේ චරිතය හරහා සිය සිනමා ජීවිතය ආරම්භ කළ රුක්මණී දේවි ප්‍රථම දේශීය සිනමා නිළිය බවටද පත්විය. මෙසේ ආරම්භ වූ ඇයගේ සිනමා ජීවිතය දශක තුනකට අධික කාලයක් පුරා පැතිර ගියේය.\n\nඅනුව\n\nශ්‍රී ලංකා සිනමා වංශය\n\n (පිටු 637 – 638) ලියා ඇත්තේ නුවන් නයනජිත් කුමාර විසිනි\n\nකඩවුනු පොරොන්දුව\n\n 1947 දී\n\nඅරා සොයිසා\n\n 1984 වසරේ රුක්මණී දේවි මියයන තුරුම චිත්‍රපට 99ක විවිධ චරිත නිරූපණය කර ඇත.\n\nඒ තරමටම දක්ෂ ගායිකාවක් වන ඇය චිත්‍රපට සඳහා ගායනා කළ අමරණීය ගීත කිහිපයකි\n\nසන්ධ්‍යාවේ ශ්‍රියා\n\n 'කඩවුණු පොරොන්දුව' සඳහා,\n\nපින්සර මගේ සොයුර\n\n 'කපති ආරක්ෂාව' සඳහා,\n\nගල කන්දෙනි\n\n, හා\n\nමොරනාව ප්‍රේමේ හදේ\n\n 'වැරදුන් කුරුමානම' සඳහා,\n\nනින්දේ රෑ යහනේ\n\n 'පෙරළෙන ඉරණම' සඳහා,\n\nමාවිල පෙන vi Rupe\n\n 'කැල හඬ' සඳහා,\n\nපෙම් සිහින ලෝකේ මායා\n\n 'මාතාභෙදය' සඳහා,\n\nMelavi Yanna Hada Mage\n\n 'දෛව යෝගය' සඳහා,\n\nසුව දෙන සිත සනසුම්\n\n 'ලදළු' සඳහා සහ\n\nදොයි දොයි පුතා\n\n 'අහසින් පොළවට' වෙනුවෙන්.\n\n1975 දී රුක්මණී මිටන් මල්ලවාරච්චි සමඟ \"පෙම් රජතහනේ\" ගායනා කළාය.\n\nහැටේ දශකයේ මැද භාගයේදී ඇය දිවංගත නෙවිල් ප්‍රනාන්දුගේ නායකත්වයෙන් යුත් 'ලොස් කැබෙලෙරෝස්' සිංහල කැලිප්සෝ සංගීත කණ්ඩායමට සම්බන්ධ වූවාය. ඔවුන් 'මල්බර හිමිදිරියේ', 'මැණිකේ ඔබේ සිනාවේ' සහ 'සඳක් නැගේ' වැනි ජනප්‍රිය සිංහල ගීත පටිගත කර ඇත.\n\nදකුණු ආසියාවේ පැරණිතම ගුවන් විදුලි මධ්‍යස්ථානය වන රේඩියෝ සිලෝන් ගුවන් විදුලි නාලිකාවේ ද රුක්මණී දේවි කැපී පෙනුණි.\n\n මරණ\n\nරුක්මණී දේවි 1978 ඔක්තෝබර් 28 දින තුඩැල්ල ශාන්ත මරියා දේවස්ථානය අසලදී සිදුවූ ඛේදජනක රිය අනතුරකින් මිය ගියාය. ඇය මාතර උයන්වත්ත ප්‍රදේශයේ සංගීත සංදර්ශනයකට සහභාගි වී ආපසු යමින් සිටියාය. ඇගේ අවමංගල්‍ය උත්සවයට ඉතා විශාල පිරිසක් පැමිණ සිටියහ. චිත්‍රපට නිෂ්පාදකයින් සහ නාට්‍යකරුවන්, මිතුරන්, දේශපාලනඥයන්, ඥාතීන් සහ ඇයගේ ආදරණීය රසික රසිකාවියන්.\n\nඇය ශ්‍රී ලාංකේය කලාකරුවා වූ වඩාත් කීර්තිමත් කලාකරුවා වූ අතර ඇය සිහිකර පිළිරුවක් ජාඇල කණුවන හන්දියේ ඉදිකරන ලද්දේ ඇය තවමත් ශ්‍රී ලාංකේය ජන හදවත් තුළ සහ සිත් තුළ ජීවත් වන බැවිනි. මීගමුවේ රුක්මණී දේවි කෞතුකාගාරය පිහිටි මාර්ගය ද රණසිංහ ප්‍රේමදාස ජනාධිපතිවරයා විසින් 1990 ඔක්තෝම්බර් 28 වන දින 'රුක්මණී දේවි මාවත' ලෙස නම් කරන ලදී.\n\n සම්මාන\n\n1976 සමාරම්භක ජනාධිපති සම්මාන උළෙලේදී 'අහසින් පොළවට' චිත්‍රපටයේ 'දොයි දොයිය පුතා' ගීතය වෙනුවෙන් හොඳම පසුබිම් ගායකයා.\n\n1956 වසරේ 'ලංකාදීප' පුවත්පත මගින් පවත්වන ලද 'දීපසික' සම්මාන උළෙලේ 'කැලෑ හඳ' වෙනුවෙන් හොඳම නිළිය සම්මානය.\n\n1955 දී ‘දිනමිණ’ පුවත්පත මගින් පවත්වන ලද ‘පාඨක තරඟයේ’ වැඩි ඡන්ද 16,221 කින් හොඳම නිළිය ලෙස තේරී පත් විය.\n\n ජනප්රිය සංස්කෘතිය තුළ\n\nඇය ජනප්‍රිය ඉන්දියානු චිත්‍රපට සඟරාවක් වන \"ෆිල්ම්ෆෙයාර්\" හි කවර පිටුවේ සිටි එකම ශ්‍රී ලාංකික නිළිය වූ අතර 1958 දී ෆිල්ම්ෆෙයාර් හි \"මගේ කැමැත්ත සහ අකමැත්ත\" හි ද පෙනී සිටියාය. Toyota Hi-ace First පරම්පරාවේ මාදිලිය ශ්‍රී ලංකාවේ හඳුන්වනු ලබන්නේ 'රුක්මණී මාදිලිය' ලෙසිනි, මන්ද ඇය මාරක අනතුරට ලක්වන විට එකක ගමන් කරමින් සිටි බැවිනි.\n\n සොහොන් බිමට පහර දීම\n\n2011 අගෝස්තු 12 වැනිදා මීගමුවේ හිටපු නගරාධිපතිවරයකු සහ පාර්ලිමේන්තු මන්ත්‍රීවරයකු වූ ආනන්ද මුණසිංහ මහතා ඇයගේ රසිකයකු වූ ශ්‍රියානි මහත්මිය විසින් ඇයගේ සොහොන මත ඉදිකරන ලද රුක්මණී දේවිගේ ප්‍රතිමාව ඉවත් කිරීම සම්බන්ධයෙන් මීගමුව පොලිසිය විසින් චෝදනා කොට අත්අඩංගුවට ගත් බව කියනු ලැබේ. අචල දිසානායක. නාඳුනන අපරාධකරුවන් පිරිසක් විසින් රුක්මණී දේවිගේ සොහොනට පහරදීමක් ලෙස ජනප්‍රිය මාධ්‍ය කිහිපයක් මෙය පුම්බා දැමූ අතර 2011 අගෝස්තු 14 වැනි දින මීගමුවේදී මෙම සිද්ධියට එරෙහිව විරෝධතා රැළියක්ද සංවිධානය කර තිබුණි.කෙසේ වෙතත් පසුව හෙළිවූයේ ආනන්ද මුණසිංහ මහතාද වන බවයි. බර්නාඩ් ඇලෝසියස් ජයමාන්නගේ බෑනා (බී.ඒ.ඩබ්ලිව්. ජයමාන්න) සැබැවින් ම මෙම සොහොනේ වත්මන් හිමිකරු වන අතර ඔහු විසින් රුක්මණී දේවිගේ නිසි පිළිරුවක් ඉදිකිරීම සඳහා පිළිරුව ගලවා දමා ඇත්තේ මීට පෙර ඉදිකරන ලද ප්‍රතිමාව සුන්දරත්වයට අගෞරවයක් වූ බැවිනි සහ රුක්මණී දේවියගේ පෙනුම.\n\nමිහිදන් කර ඇති සොහොන රුක්මණී දේවිය ජයමාන්න පවුලේ පරම්පරාගත පවුල් ඉඩම වන අතර ඇගේ සියලුම මාමණ්ඩි එහි තැන්පත් කර ඇත. ඉදිකරන ලද සොහොන් ගලෙහි මෙය දැකගත හැකි අතර පවුලේ අය සතු ඔප්පු හිමිකමෙහි එය පැහැදිලි වේ. \"ශ්‍රියානි අචලා දිසානායක මහත්මිය\" විසින් ඉදිකරන ලද ප්‍රතිමාව ඇයට අහිමි වී ගිය කීර්තිය නැවත ජීවත් කරවීම සඳහා ලාභ ප්‍රචාරණයක් විය. ඇය ගෙදර අයගෙන් අනුමැතිය ගත්තේවත් ගෙදර අයට දැනුම් දුන්නේවත් නැහැ. ඇය මෙම ප්‍රහාරක කතාව ගොතන ලද්දේ නීතියෙන් සහ ප්‍රචාරණයෙන් නිවැරදි පුද්ගලයන්ට \"අනුග්‍රහයන්\" සපයමිනි\n\n වෙනත් චිත්රපට\n\nඅබුදස්සේ කැලේ (1968)"
    },
    {
        "name": "නිමල් මෙන්ඩිස්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "ගායකයා\n\nසංගීතඥයෙක්\n\nගීත රචකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1934 මාර්තු 29",
        "Death": "2015 අප්‍රේල් 16\n\n(වයස අවුරුදු 81)",
        "description": "නිමල් මෙන්ඩිස්\n\n (1934-2015) ශ්‍රී ලාංකේය ගායකයෙක් සහ ගීත රචකයෙක් වූ අතර, බීබීසී රූපවාහිනී වැඩසටහනට පෙනී සිටි ශ්‍රී ලාංකික සංගීතඥයන් අතලොස්සෙන් කෙනෙකි.\n\nPops හි ඉහළම\n\n (1968) මෙන්ඩිස් මහා බ්‍රිතාන්‍යයේ කාර්ය සාධන හිමිකම් සංගමයේ සහ යාන්ත්‍රික ප්‍රකාශන හිමිකම් සුරැකීමේ සංගමයේ දිගුකාලීන සාමාජිකයෙකි. මෙන්ඩිස් 1950 ගණන්වල අගභාගයේදී දකුණු ආසියාවේ ගුවන් තරංග ආධිපත්‍යය දැරූ රේඩියෝ සිලෝන් විසින් සොයා ගන්නා ලදී. \"කැන්ඩියන් එක්ස්ප්‍රස්\" ඇතුළු මෙන්ඩිස්ගේ ගීත ආරම්භයේ සිටම මෙම මධ්‍යස්ථානය විසින් සහාය දක්වන ලදී, ඒවා දකුණු ආසියාවේ ජනප්‍රිය ගීත බවට පත් කළේය: කෙතරම්ද යත් ඉන්දියානු උප මහාද්වීපය පුරා සිටින ශ්‍රාවකයින් ඔහුගේ ගීත ඉල්ලා රේඩියෝ සිලෝන් වෙත ලිවීය. මෙන්ඩිස් සම්බන්ධ වී සිටියේය. ඔහුගේ මුල් ළමාවියේ සිට සංගීතය සමඟින්, වසර ගණනාවක් ලන්ඩනයේ ජීවත් වූ අතර නිතර ශ්‍රී ලංකාවට පැමිණ ඇත. ඔහු තම බිරිඳ රංජනී සමඟ වසර පහක් තිස්සේ ප්‍රංශයේ නිරිතදිග ප්‍රංශයේ චරන්ටේ හි ලී පැරඩිස් හි ද වාසය කර ඇත. මෙන්ඩිස් රංජනී සමඟ 2010 දී මිය යන තෙක් වසර 33 ක් විවාහ වූ අතර, මෙන්ඩිස් මීඩියා ප්‍රොඩක්ෂන් ආයතනය පවත්වාගෙන ගිය පෝල්මරි නම් එක් පුතෙකු සිටී. 2004 සුනාමි ව්‍යසනයෙන් විපතට පත් වූවන්ට උපකාර කිරීම සඳහා ගීතයක් රචනා කිරීමට මෙන්ඩිස් පෙලඹුණේය. මෙය ඕස්ට්‍රේලියාවේ, ශ්‍රී ලංකාවේ සහ එක්සත් රාජධානියේ පටිගත කර ඇති අතර, පාර්ලිමේන්තු මන්ත්‍රී ලින්ඩා පර්හැම් විසින් අනුග්‍රහය දක්වන ලද 638 වැනි මුල් දින යෝජනාවේදී බ්‍රිතාන්‍ය පාර්ලිමේන්තුව විසින් පැසසුමට ලක් කරන ලදී. චරිතාපදානය මුල් වසර: 1950-1960s මෙන්ඩිස් බ්‍රිතාන්‍යයේ ගීත 22 ක් ප්‍රකාශයට පත් කර ඇති අතර චිත්‍රපට සඳහා සංගීතය ලියා ඇත. ලංකාවේ. \"කිස් කිස් කිස්\" යනු මෙන්ඩිස්ගේ පළමු ගීතය බ්‍රිතාන්‍යයේ පටිගත කරන ලද අතර කොලොම්බියා ලේබලය මත මේරි මාෂල් විසින් ගායනා කරන ලදී. \"Kandyan Express\", \"Cherry Blossom Tree\", \"Oh My Lover\", \"Butterfly in the Rain\", \"Shampagne Blues\", \"Goodnight Kisses\" පනස් ගණන්වල අග භාගයේ ශ්‍රී ලංකාවේ අංක එකේ ජනප්‍රිය ගීත විය. නර්තනය\", සංගීත භාණ්ඩයක්, බටහිර ඔහුගේ දෙවන කොටස විය. ජර්මනියේ ෆ්‍රීඩෙල් බර්ලිප් සහ ඔහුගේ වාද්‍ය වෘන්දය විසින් පටිගත කරන ලද එය රේඩියෝ ලක්සම්බර්ග් හි අංක දෙක බවට පත්විය. එය එක්සත් ජනපදයේ ද නිකුත් කරන ලදී.\n\nකළු මුතු සහ කොළ දියමන්ති\n\n බ්‍රිතාන්‍යයේ ජන කණ්ඩායමක් වන One Two and Three විසින් Decca සඳහා LP මත මෙන්ඩිස්ගේ ගීත අටක් ඇත. මෙම ඇල්බමය දැන් එකතුකරන්නන්ගේ අයිතමයකි.මෙන්ඩිස් ජනප්‍රිය BBC රූපවාහිනී සංගීත වැඩසටහනේ පෙනී සිටියේය\n\nPops හි ඉහළම\n\n ඔහුගේ ගායන සහකරු සැන්ඩ්‍රා එඩීමා සමඟ 1968 දී ආරාධිත කලාකරුවන් ලෙස ඔහුගේ \"ෆීල් ලයික් අ ක්ලෝවුන්\" ගීතය සමඟින්. \"රේන්බෝ ලෑන්ඩ්\" වාර්තාවේ B-පැත්ත ප්‍රාන්තවල A-සයිඩ් වූ අතර අද (2013) එය බටහිර මනෝවිද්‍යාත්මක පාෂාණ ප්‍රජාවේ එකතුකරන්නන්ගේ අයිතමයක් බවට පත්ව ඇත. ඒවා ද ගීතය සමඟින් ප්‍රදර්ශනය විය\n\nබීට් ක්ලබ්\n\n එම වසරේ ජර්මනියේ. ඔරිජිනල් ඩේව් බෲබෙක් ක්වාටෙට් සමඟ බාස් වාදකයෙකු වූ ඉයුජින් රයිට් මෙන්ඩිස්ගේ ගීත පහක් ඔහු පමණක් බාස් වාදනය කරමින් සංවිධානය කර පටිගත කළේය. ඔහු විදුලි ගිටාරය, බාස් සහ පියානෝ සමඟ තවත් එක් ගීතයක් වන \"සිංදු මාලු\" ද සකස් කර නිෂ්පාදනය කළේය. ඒවා ගායනා කරන ලද්දේ Sandra Edema විසිනි. 1970s Mendis ලන්ඩනයේ බොහෝ විට අධ්‍යාත්මික ස්වභාවයෙන් යුත් ගීත ගණනාවක් පටිගත කරන ලදී. ඔහු නමින් කුරුසියේ මාර්ගය පිළිබඳ විනාඩි විස්සක ශ්‍රව්‍ය වාර්තා චිත්‍රපටයක් ද කළේය\n\nපැෂන් වාර්තාව\n\n; නමින් තවත් ශ්‍රව්‍ය වාර්තා චිත්‍රපටියක්\n\nපාරුකරු\n\n බ්‍රිතාන්‍ය යටත් විජිත සමයේ සිට ශ්‍රී ලංකාවේ තේ වතු කම්කරුවන් සහ ගොවියා පිළිබඳ ඔවුන්ගේ ඉතිහාසය සොයා ගනිමිනි. ඔහු ද ලිවීය\n\nජීවන පාන්\n\n ශ්‍රී ලංකාවේ දිව්‍ය සත්ප්‍රසාද සම්මේලනය සඳහා. මෙන්ඩිස් ශ්‍රී ලාංකේය චිත්‍රපට සඳහා අමතක නොවන ගීත කිහිපයක් ලියා ඇත, විශේෂයෙන් \"මාස්ටර් සර්\" චිත්‍රපටය සඳහා\n\nකළු දිය දහර\n\n (\"කළු වතුර තීරුවක්\"), එහිදී නීලා වික්‍රමසිංහ මාතෘකා අනුපිළිවෙලින් එය ඉටු කළාය. \"මාස්ටර් සර්\" යටත් විජිත ශ්‍රී ලංකාව ගැන, ශ්‍රමයේ ගරුත්වය පිළිබඳ කතාවක් - සමාජ සාධාරණත්වය පිළිබඳ කතාවකි. මෙම ගීතය ඉංග්‍රීසි (මෙන්ඩිස් සහ සැන්ඩ්‍රා එඩීමා විසින්) සහ සිංහල යන දෙඅංශයෙන්ම පටිගත කරන ලදී (නෙවිල් ප්‍රනාන්දු විසිනි; පද රචනය කරුණාරත්න අබේසේකර විසින් සිංහලට පරිවර්තනය කරන ලදී). මෙම ගීතය වසර තිහකට වැඩි කාලයක් ශ්‍රී ලංකාවේ ජනප්‍රියව පැවතියේ, බොහෝ දුරට නීලා වික්‍රමසිංහගේ ඉංග්‍රීසි අනුවාදයේ සංගීත සැකැස්ම (කාල අත්සන, රිෆ්ස් ආදිය) මත පදනම් වූ ජනප්‍රිය අනුවාදයේ ප්‍රතිඵලයක් ලෙසය.\n\nගංගා අද්දර\n\n (\"ගඟේ ඉවුර අසල\"), ඔගස්ටස් විනයාගරත්නම් විසින් සිංහලට පරිවර්තනය කරන ලද අතර, එම නමින්ම (සුමිත්‍රා පීරිස් විසින් අධ්‍යක්ෂණය කරන ලද) චිත්‍රපටය සඳහා විජය කුමාරණතුංග විසින් ගායනා කරන ලද ද ජනප්‍රියය. පහර\n\nරන් ටිකිරි සිනා\n\n එය එම චිත්‍රපටිය සඳහාම ලියා වික්ටර් සිල්වා සහ නිරාෂා පෙරේරා විසින් ගායනා කරන ලදී. 2013 දී සුරේන්ද්‍ර පෙරේරා විසින් ගායනා කරන ලද \"ගඟ අද්දර\" ගීතයේ නව අනුවාදයක් එම නමින්ම ටෙලිනාට්‍ය මාලාවක තේමා ගීතය ලෙස භාවිතා කරන ලදී. \"උපුල් නුවන්\" 1978 ලෙස්ටර් ජේම්ස් පීරිස් චිත්‍රපටය සඳහා රචනා කරන ලද තවත් සම්භාව්‍ය විය\n\nමළවුන් සඳහා සුදු මල්\n\n. ශ්‍රී ලංකාවේ උතුරු හා නැඟෙනහිර යුද කලාපවල තම දෙමාපියන් සමඟ රූගත කිරීම් කරන විට ඔහුට වයස අවුරුදු හතකි. මෙන්ඩිස් වේදිකා නාට්‍යයක් ද කළා\n\nඑය මම වන දෙයයි\n\nශ්‍රී ලාංකික සංගීතඥයන් සමඟ; එහි විශේෂත්වය වූයේ එම වසරේ ජනවාර්ගික කෝලාහල පාදක කරගත් \"ජූලි '83\" ගීතයයි. ඔහු එයාර් ලංකා සඳහා ශ්‍රව්‍ය කැසට් දෙකක් ද කළේය.\n\nපාරාදීසයේ රසයක්\n\n, සහ අනෙක ලංකා සංචාරක මණ්ඩලය සඳහා-\n\nශ්‍රී ලංකාවේ වන්දනා ස්ථාන\n\n.1990s-2015 මෙන්ඩිස් පවුල විසින් ශ්‍රව්‍ය වාර්තා චිත්‍රපටයක් නිකුත් කරන ලද Mediaeye Music Lanka (PVT) Ltd. නමින් ඔවුන්ගේම ව්‍යවසායයක් පිහිටුවා ගත්හ.\n\nයුද්ධය මගේ රටයි\n\n, 2000 දී, ශ්‍රී ලංකාවේ ජනවාර්ගික ගැටුම 1994 දක්වා ලුහුබැඳ යමින්. මෙම සීඩී තැටියේ වසර දාහතක් පුරා ආඛ්‍යාන, දේශපාලන සහ වෙනත් පුද්ගලයින් සමඟ සම්මුඛ සාකච්ඡා, ගීත සහ කවි ඇතුළත් ලේඛනාගාර තොරතුරු අඩංගු විය. ඔහුගේ පුත් පෝල්මරි සමඟ මෙන්ඩිස් දිගටම කරගෙන ගියේය. CD සහ DVD මත ගීත, ශ්‍රව්‍ය වාර්තා චිත්‍රපට සහ චිත්‍රපට ද්‍රව්‍ය සම්පාදනය කරන්න. Mediaeye හරහා, ඔවුන් සිරස සුපර්ස්ටාර් (ශ්‍රී ලංකාවේ ඇමරිකානු අයිඩල්/Xfactor) වැනි ව්‍යාපෘතිවල වැඩ කරමින් සහ රටේ බොහෝ තරුණ කලාකරුවන් සමඟ අන්තර් ක්‍රියා කරමින් ශ්‍රී ලංකාවේ විවිධ විශාල සංවිධාන සමඟ සමීපව කටයුතු කළහ. 2009 දී ඔවුන් ශ්‍රී ලංකන් ගුවන් සේවය සඳහා සමාගමේ නව නිල ඇඳුම් ප්‍රදර්ශනය කරමින් මිනිත්තු දහයක කෑල්ලක් සම්පූර්ණ කළහ. මෙය මෙන්ම 2011 වසරේ සහ 2013 නත්තල් සමයේ ගුවන් සමාගම විසින් බෝඩිං වීඩියෝවක් ලෙස භාවිතා කරන ලද Generation 4 (Sirasa Superstars හතරේ) විසින් මෙන්ඩිස්ගේ \"And A Star\" ගීතයකි. මෙන්ඩිස් විසින් සුමිත්‍රා වෙනුවෙන් ගීත තුනක් ලිවීය. පීරිස්ගේ \"වෛෂ්ණවී\" චිත්‍රපටිය මෙන්ම පසුබිම් සංගීතයද, පෝල්මරි විසින් සංවිධානය කර නිෂ්පාදනය කරන ලදී. 2013 දී ඔහු ප්‍රථම වරට සිංහල බ්ලූස් ගීතය වන \"ගැහැණු ළමයින්\" ලිවීය, එය ගායනා කළේ අමිල සඳරුවන් විසිනි. එය සිංහලට පරිවර්තනය කළේ මෙන්ඩිස්ගේ නව ලිපි කිහිපයක් ද පරිවර්තනය කර ඇති දුමින්ද අලහේන්ද්‍ර විසිනි. මෙම ගීතය සඳහා සංගීත වීඩියෝව නිෂ්පාදනය කරන ලද්දේ ශ්‍රී ලංකා ඩිජිටල් චිත්‍රපට ආයතනයේ සිසුන් විසිනි. මෙන්ඩිස් 2015 අප්‍රේල් 16 වන දින කොළඹ මාලඹේ පෞද්ගලික රෝහලකදී වයස අවුරුදු 81 දී මිය ගියේය. Television documentaries Dawn of Terror\n\n, මෙන්ඩිස්ගේ පළමු වාර්තා චිත්‍රපටය, රටේ ජනවාර්ගික ගැටුම කෙරෙහි අවධානය යොමු කළ අතර, එය යුද විරෝධී චිත්‍රපටයක් ලෙස සැලකේ. එය ශ්‍රී ලංකාවේ සමාජය සහ ආගමික මධ්‍යස්ථානය සඳහා සාදන ලද අතර VHS හි නිෂ්පාදනය කර තිබියදීත්, එක්සත් රාජධානියේ කොන්කෝඩ් වීඩියෝ සහ චිත්‍රපටය විසින් බෙදා හැරීම සඳහා ගෙන ඇත. Shattered Pearl\n\n ශ්‍රී ලංකාවේ යුද්ධයෙන් පීඩාවට පත් කාන්තාවන් සහ \"ජීවත්වීමේ අයිතිය\" ලන්ඩනයේ චැනල් 4 රූපවාහිනිය සඳහා සාදන ලදී. එය එවකට බ්‍රිතාන්‍ය රූපවාහිනියේ ශ්‍රී ලාංකිකයන්ගේ ප්‍රධාන චිත්‍රපටයක් විය. එය ලෝකයේ බොහෝ රටවල ප්‍රදර්ශනය කර ඇත.කාන්තාවන් තිදෙනෙක් කතා කරති\n\n බ්‍රිතාන්‍යයේ \"19 වැනි වගන්තිය\" සඳහා අදහස් දැක්වීමේ සහ ප්‍රකාශනයේ නිදහස මත සාදන ලදී. Mediaeye ද සංස්කරණය කරන ලදී\n\nZ Zero Concern සඳහා\n\n ළමා සමාජය සඳහා ලන්ඩනයේ නිවාස නොමැති දරුවන් මත. සෑම තැනකම ජලය\n\n, බංගලිදේශයේ රූගත කරන ලද, කාන්තාවන් සහ ජල කළමනාකරණය, CAFOD සඳහා සාදන ලදී. Blessed Are the Poor\n\n බ්‍රිතාන්‍යයේ සහ දකුණු ඉන්දියාවේ දරිද්‍රතාවය සහ මිනිසුන් තම ජීවිත වෙනස් කිරීමට ගන්නා ධනාත්මක උත්සාහය සංසන්දනය කරයි. මෙම වාර්තා චිත්‍රපටය මෙතෝදිස්ත ජාත්‍යන්තරය සඳහා නිර්මාණය කරන ලද්දකි. මීඩියා ප්‍රධාන බ්‍රිතාන්‍ය රූපවාහිනී නිෂ්පාදන තුනක පර්යේෂකයන් ලෙස ද සේවය කර ඇත. ඔවුන්ගේ වාර්තා චිත්‍රපට තුනක් ඉතාලියේ මොන්ටිකාටිනි චිත්‍රපට උළෙලේදී:\n\nකැඩුණු මුතු ඇටය\n\n,\n\nසෙලාන් පාරාදීසයට\n\n, හා\n\nමරා දැමීම නවත්වන්න පටන් ගන්න සිංදු කියන්න\n\n (ගීත තුනක් මත පදනම් වූ). සිංහල ගීත වාර්තා චිත්‍රපටයක් ලෙස ඉදිරිපත් කළ පළමු අවස්ථාව එය විය."
    },
    {
        "name": "කමල් අද්දරආරච්චි",
        "info": "ශ්‍රී ලංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1962 පෙබරවාරි 5, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 59 යි",
        "description": "කමල් අද්දරආරච්චි\n\n - කමල් අද්දරආරච්චි (උපත අද්දරආරච්චිගේ ගුණේන්ද්‍ර කමල් 1962 පෙබරවාරි 5) යනු සම්මානලාභී ශ්‍රී ලාංකේය චිත්‍රපට සහ ටෙලිනාට්‍ය නළුවෙකු, ගායකයෙකු සහ ඉදිරිපත් කරන්නෙකු වේ. ඔහු ගාමිණී ෆොන්සේකාගේ 1981 චිත්‍රපටයෙන් නළුවෙකු ලෙස සිය මංගල දර්ශනය ආරම්භ කළේය\n\nසාගරයක් මැද\n\n, ඔහු තවමත් පාසැලේ ශිෂ්‍යයෙකුව සිටියදී. 1970 දශකයේ අග භාගයේ සිට ඔහු බොහෝ චිත්‍රපට සහ ටෙලිනාට්‍යවල විවිධ චරිත නිරූපණය කර ඇත.\n\nචිත්‍රපට 40කට, ටෙලිනාට්‍ය 20කට සහ වේදිකා නාට්‍ය 6කට අධික ප්‍රමාණයක රඟපා ඇති අද්දරආරච්චි, එහි සෝබනාගේ චරිතය වෙනුවෙන් සරසවිය හොඳම නළුවාට හිමි සම්මානය දිනා ගත්තේය.\n\nඅග්නිදාහය\n\n 2002 දී ඔහු ගායකයෙකු ලෙස 1993 දී දමයන්ති ජයසූරිය සමඟ යුගලයක් වූ \"උන්මාදවු\" චිත්‍රපටයේ ඇතුළත් විය.\n\nසප්ත කන්යා\n\n. ඔහු පළමු වාර තුනේ සත්කාරකයා ද විය\n\nසිරස සුපර්ස්ටාර්\n\n, රියැලිටි වැඩසටහනක් සහ පළමු වාරයේ\n\nහිරු මෙගා ස්ටාර්ස්\n\n. එච්.ආර්.ජෝතිපාල ගේ \"මල් පිබිදෙන එක වසන්ත සමයක\" ගයද්දී BMICH එකේදිත් ඔහුට ලොකු වැටීමක් සිදුවුණා."
    },
    {
        "name": "ටී එම් ජයරත්න",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1944 අප්‍රේල් 13",
        "Age": "අවුරුදු 77 යි",
        "Star sign": "මේෂ",
        "Education": "මලියදේව විද්‍යාලය",
        "Instruments:": "හඬ",
        "description": "තෙන්නකෝන් මුදියන්සේලාගේ ජයරත්න\n\n, ලෙසද හැඳින්වේ\n\nටී.එම්. ජයරත්න\n\n (සිංහල:ටි.එම්.ජයරත්න) (උපත 1944 අප්‍රේල් 13) ශ්‍රී ලංකාවේ දොඩන්ගොඩ ප්‍රදේශයේ ජනප්‍රිය ශ්‍රී ලාංකික ගායන ශිල්පියෙක් සහ වයලීන වාදකයෙකි.\n\nඔහු 1978, 1979, 1980 සහ 1987 වසරවල ශ්‍රී ලංකාවේ ජනාධිපති සම්මානය ලබා ඇත. 2006 දී රයිගම් ටෙලි සම්මාන උළෙලේ හොඳම ගායකයා ලෙස ජයරත්න සම්මානයෙන් පිදුම් ලැබීය.\n\nජීවිතය සහ වෘත්තීය දළ විශ්ලේෂණය ජයරත්න ඉගෙන ගත්තේ කුරුණෑගල මලියදේව විද්‍යාලයේ. ඔහු ගායනයට යොමු වූයේ ගුවන්විදුලි සංස්ථාවේ ජන හා පර්යේෂණ අංශයේ ප්‍රධානියා වන සී.ජේ.එස්. ගුවන්විදුලිය හරහා ප්‍රචාරය කිරීමට \"ගාන තෙල් සදුන්\" ඇතුළත් සිංහල ජන ගී කිහිපයක් ගායනා කරන ලෙස ඔහුගෙන් ඉල්ලා සිටියේ කුලතිලකය. ඔහු සිය පළමු ගීතය පටිගත කළේ 1970 දීය.\n\nජයරත්න පසුපෙළ ගායකයෙකු ලෙස ආරම්භ වූයේ සුනිල් ආරියරත්න විසින් රචනා කර සංගීතවත් කළ \"ළහිරු දහසක්\" ගීතයෙනි.\n\nප්‍රේමසිරි කේමදාස\n\n. 1978 දී ඔහු සිය පළමු කැසට් පටය නිකුත් කළේය\n\nතරංග වෙළුම - 01\n\n. මේ වන විට ඔහු චිත්‍රපට 79 කට ස්වර්ණමය හඬ ලබා දී ඇත. මේ චිත්‍රපට අතරින් බඹරු ඇවිත් ඔෆ්\n\nධර්මසේන පතිරාජ\n\n සහ හංස විලක්\n\nධර්මසිරි බණ්ඩාරනායක\n\n ශ්‍රී ලංකා ඉතිහාසයේ මෙතෙක් බිහි වූ හොඳම චිත්‍රපට ලෙස සැලකේ.\n\n1980 දී ජයරත්න සුනිලා අබේසේකර සමඟ \"හෙමින් සැරේ පියා විදා\" චිත්‍රපටිය සඳහා යුගලය ගායනා කළේය.\n\nහංස විලක්\n\n. ගීතය ලිව්වේ\n\nධර්මසේන පතිරාජ\n\n විසින් සංගීතය සමඟ\n\nප්‍රේමසිරි කේමදාස\n\n ඒ වගේම ලංකාවේ ජනප්‍රිය ගීතයක් වුණා. සමඟ ඔහුගේ යුගල\n\nනීලා වික්‍රමසිංහ\n\n විශාල ජනප්‍රිය ගීත බවටද පත් විය. එසේම ඔහු සමහර ගීත සඳහා සංගීතය නිර්මාණය කර ඇතත් ඔහු දක්ෂ ගායන ශිල්පියෙකු ලෙස කීර්තියක් අත්කර ගත්තේය.\n\nපෞද්ගලික ජීවිතය ජයරත්න මාලිනී ජයරත්න සමඟ විවාහ වී දරුවන් දෙදෙනෙකු සිටී. ඔහුගේ පුත් ඉසුරු ජයරත්න ද ගායකයෙකි."
    },
    {
        "name": "Gresha Schuilling",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1983",
        "Age": "අවුරුදු 38 යි",
        "Instruments:": "හඬ",
        "description": "ග්‍රේෂා ෂුලිං\n\n (උපත 1983, කොළඹ) ශ්‍රී ලාංකික සංගීතඥයෙකි. ඇය දකුණු ආසියාවේ ජනප්‍රිය සංගීත ලෝකයෙන් නැගී එන තරුවක් ලෙස පිළිගෙන ඇත.\n\nඇය ශ්‍රී ලංකාවේ කීර්තිමත් සංගීත පවුලකින් පැවත එන්නකි. ග්‍රේෂා සෞදි අරාබියේ ජෙඩාහි කොන්ටිනෙන්ටල් පාසලෙන් සහ ශ්‍රී ලංකාවේ අධ්‍යාපනය ලබා ඇත. ඇය සෞදි අරාබියේ සිටියදී සංගීතයට සම්බන්ධ වූ අතර ඇගේ පාසලේ 'බැට්ල් ඔෆ් ද බෑන්ඩ්ස්' තරඟයකින් පවා ජයග්‍රහණය කළාය.\n\nඇය නැවත ශ්‍රී ලංකාවට පැමිණි පසු ඇය අපොස උසස් පෙළ හැදෑරීමෙන් පසු ජනප්‍රිය සංගීතයට ඇය පසුපස යාමට තීරණය කළාය.\n\nCold Cold Night Christmas SingleGresha ඇගේ මංගල නත්තල් ගීතය 'Cold Cold Night' පටිගත කර ඇත. නත්තල් ගීතය ලියා ඇත්තේ ශ්‍රී ලංකාවේ උපන් කීර්තිමත් ගායක/ගීත රචකයෙකු වන පිය පුතු දෙපළ විසිනි\n\nනිමල් මෙන්ඩිස්\n\n සහ ඔහුගේ පුත් පෝල් මාරි මෙන්ඩිස්. 'සීතල සීතල රාත්‍රිය' 2007 නොවැම්බර් මාසයේදී එක්සත් රාජධානියේ Media Eye Music විසින් නිකුත් කරන ලදී.\n\n2007 නත්තල් ප්‍රස්ථාරවල අංක 1 ස්ථානයට පැමිණීමට Gresha Schuilling උත්සාහ කළ බව BBC පවසයි.\n\nGresha Schuilling ඇයගේ මංගල ඇල්බමය කොළඹදී පටිගත කරන අතර එය 2008 ගිම්හානයේදී නිකුත් කිරීමට නියමිතව තිබුණි. ලන්ඩනයේ Media Eye Music විසින් ඇයගේ 'Cold Cold Night' නත්තල් ගීතය mediaeyeproductions වෙබ් අඩවිය හරහා බාගත කිරීම සඳහා නිකුත් කරන ලදී.\n\nඇය නිමල් මෙන්ඩිස් සම්භාව්‍ය ශ්‍රී ලාංකේය චිත්‍රපටය වන 'ගඟ අද්දර' වෙතින් පටිගත කර ඇත. මුල් ගීතය පටිගත කරන ලද්දේ ශ්‍රී ලාංකේය සිනමා තරුව වන දිවංගත විසිනි\n\nවිජය කුමාරතුංග\n\n. ‘ගඟ අද්දර’ ඇගේ කුළුඳුල් ගීත ඇල්බමය නිකුත් කරනවා.\n\nඔටිසම් පිළිබඳ ශ්‍රී ලංකා තානාපතිනි ග්‍රේෂා ෂූලිං ඔටිසම් පිළිබඳ ශ්‍රී ලංකා තානාපතිනිය ලෙස ඔටිසම් දැනුවත් කිරීමේ ව්‍යාපාරය එක්සත් රාජධානිය සහ ශ්‍රී ලංකාව විසින් පත් කරන ලදී. ඇයගේ දූපත් නිවසේ ඔටිසම් සහ ඇස්පර්ජර් සින්ඩ්‍රෝමය ඇති සියලුම මිනිසුන්ගේ ජීවිතවලට වෙනසක් කිරීමට ඇය අධිෂ්ඨාන කර ඇත. ග්‍රේෂා මෙම තත්ත්වය පිළිබඳව දැනුවත් කරමින් සිටී - ශ්‍රී ලංකාවේ ළමුන් 39,000 ක් ඔටිසම් වර්ණාවලියේ සිටින බව ඇස්තමේන්තු කර ඇත.\n\nග්‍රේෂා මෙසේ පැවසුවාය: “ඔටිසම් යනු මොළයේ වර්ධන ආබාධයක විශේෂණ පදය මිස පුද්ගලයෙකු යනු කවුරුන්ද යන්න පිළිබඳ අර්ථ දැක්වීමක් නොවේ! ඩවුන් සින්ඩ්‍රෝමය හෝ සිස්ටික් ෆයිබ්‍රෝසිස් වලට වඩා බහුලව මෙම ආබාධය පිළිබඳව ඔබ සහ අන් අය දැනුවත් කරන්න. ගැහැණු ළමයින්ට වඩා පිරිමි ළමයින් තුළ එය සිව් ගුණයකින් වැඩි වන අතර මෑත වසරවල උපත ලබන සෑම දරුවන් 250 දෙනෙකුගෙන්ම එක් අයෙකු ලෙස එය බහුලව දක්නට ලැබේ. ඔටිසම් පිළිබඳ දැනුවත්භාවය වැඩි කිරීමට අපට කළ හැකි සෑම දෙයක්ම කිරීමට දක්ෂතා සහ අවස්ථාව ලබා දී ඇති පුද්ගලයින් වශයෙන් අපගේ යුතුකමයි. මේ කාරණයෙහි අවිද්‍යාව ප්‍රමෝදයෙන් දුරු වන්නේය.”"
    },
    {
        "name": "එම් එස් ප්‍රනාන්දු",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1936 මාර්තු 4",
        "Death": "9 අප්රේල් 1994\n\n(වයස අවුරුදු 58)",
        "Star sign": "මීන",
        "Instruments:": "හඬ",
        "description": "මහගමගේ සැම්සන් ප්‍රනාන්දු\n\n, ලෙස වඩාත් ප්රසිද්ධ\n\nඑම් එස් ප්‍රනාන්දු\n\n (සිංහල:\n\nඑම්. එස්. ප්‍රනාන්දු\n\n, 4 මාර්තු 1936 - 9 අප්‍රේල් 1994) ශ්‍රී ලාංකික බයිලා ගායකයෙකි. ඔහු බයිලා සංගීතය දියුණු කිරීමේ ප්‍රධාන ක්‍රීඩකයෙකු වන අතර \"බයිල චක්‍රවර්ති\" (බයිලා අධිරාජ්‍යයා) ලෙස පොදුවේ හඳුන්වන ශ්‍රී ලාංකික ප්‍රේක්ෂකයින් අතර පුළුල් ලෙස ජනප්‍රිය විය.\n\nප්‍රනාන්දු මහතාට ශ්‍රී ලංකා ජනාධිපතිවරයා විසින් පිරිනමන ස්වර්ණ නෙළුම් සම්මානය ඇතුළුව ඔහුගේ දීර්ඝ වෘත්තීය ජීවිතය තුළ සම්මාන රැසක් හිමි විය\n\nවිලියම් ගොපල්ලව\n\n 1973 දී සහ විවිධ බයිලා තරඟ වලින් රිදී කුසලාන 159 කට වඩා වැඩි ප්‍රමාණයක් ඔහු ඇතුළු විය. ඔහු භාෂා පහකින් ගායනා කිරීමට සමත් වූ අතර නර්තනය ඔහුගේ රංගනයට ඇතුළත් කළේය. ප්‍රනාන්දු එංගලන්තය, ප්‍රංශය, ඕස්ට්‍රේලියාව, කැනඩාව, සිංගප්පූරුව සහ මැදපෙරදිග යන රටවල ශ්‍රී ලාංකීය ප්‍රේක්ෂකයින් වෙත ප්‍රසංග කළේය.\n\nචරිතාපදානය දළ විශ්ලේෂණය ප්‍රනාන්දු 1936 දී මොරටුවේදී ලැරොන් ප්‍රනාන්දු සහ ලිලී ගෝමස් ට දාව මාර්තු 4 වැනි දින උපත ලැබීය. ඔහු ගල්කිස්ස ශාන්ත අන්තෝනි විද්‍යාලයට සහ දෙහිවල ක්‍රිස්තු දේවස්ථානයට ඇතුළත් විය. ප්‍රනාන්දු ප්‍රවීණ සංගීතවේදී J. A. සත්‍යදාසන් යටතේ ඉගෙනුම ලැබුවා. ඔහු ගායකයෙකු ලෙස ආරම්භ වූයේ පුෂ්පරාණි ආරියරත්න සමඟ කළ \"මලක් කඩ කොන්දේ ගසල\" යුගලයෙනි. ඒක ලිව්වේ කරුණාරත්න අබේසේකර.\n\nමෙම ගීතය ජනප්‍රිය වූ අතර ප්‍රනාන්දුට පසුබිම් ගායකයෙකු වීමට ඉඩ සැලසීය. ඔහු විසින් ක්‍ෂේත්‍රයේ පළමු වරට ගායනා කළ \"සිලි සිලියේ නව සුවඳක්\" ගීතයද සාර්ථක විය. ප්‍රනාන්දු අවසානයේ චිත්‍රපට 150කට අධික ප්‍රමාණයකට සිය හඬ ලබා දෙනු ඇත. ඔහු චිත්‍රපට 25 කට අධික සංඛ්‍යාවක සහ ටෙලි නාට්‍ය කිහිපයක පෙනී සිටිමින් රංගන ජීවිතයක් ද හඹා ගියේය\n\nඋදාගිර\n\n.\n\nපුද්ගලික ජීවිතය ප්‍රනාන්දු ටියුලින් ප්‍රනාන්දු සමඟ විවාහ වූ අතර ඔහුට දරුවන් 7 දෙනෙකු සිටී (සුසිල් ප්‍රනාන්දු, ටෙලිනා ප්‍රනාන්දු, ශාන්ත ප්‍රනාන්දු, සරත් ප්‍රනාන්දු, සුජිත ප්‍රනාන්දු, සුනිමල් ප්‍රනාන්දු, සුජීව ප්‍රනාන්දු) සහ මුණුබුරන් දහසය දෙනෙක් (අයේෂා කල්පනී, කඳන්දෝෂ් ප්‍රනාන්දු, ෆොර්නන්සිනාල් ප්‍රනාන්දු, ෆොර්නන්සිනාල් ප්‍රනාන්දු, ක්‍රිස් ෆ්‍රැන්සිස්, රණෙන් ෆ්‍රැන්සිස්, බ්‍රිට්නි ෆ්‍රැන්සිස්, මහීකා ප්‍රනාන්දු, ශානක ප්‍රනාන්දු, සෞම්‍ය ප්‍රනාන්දු, සුදේශ් ප්‍රනාන්දු, රංගි ප්‍රනාන්දු, නිලංක ප්‍රනාන්දු, නයෝමි ප්‍රනාන්දු, සුමල් ප්‍රනාන්දු, සිනවි සිල්මිණි ප්‍රනාන්දු)"
    },
    {
        "name": "එච්.ආර්. ජෝතිපාල",
        "info": "ශ්‍රී ලංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1936 පෙබරවාරි 12, බ්‍රිතාන්‍ය ලංකාව",
        "Death": "1987 ජූලි 7, කොළඹ, කොළඹ දිස්ත්‍රික්කය, බස්නාහිර පළාත, ශ්‍රී ලංකාව\n\n(වයස අවුරුදු 51)",
        "Star sign": "කුම්භ ලග්නය",
        "description": "හෙට්ටිආරච්චිගේ රෙජිනෝල්ඩ් ජෝතිපාල (සිංහල: එච්.අර්.ජෝතිපාල; 12 පෙබරවාරි 1936 - 7 ජූලි 1987) යනු සිංහල සිනමාවේ ප්‍රබල පසුබිම් ගායකයෙකි. ඔහු ඔපෙරා ගායකයෙකු ලෙසද කටයුතු කළේය. ඔහු 1987 ජූලි මාසයේදී වයස අවුරුදු 51 යි මාස 5 දී මිය ගියේය. ජෝතිපාල එඩී ජයමාන්න, ආනන්ද ජයරත්න, ගාමිණී ෆොන්සේකා, විජය කුමාරණතුංග, සනත් ගුණතිලක, ටෝනි රණසිංහ, රවීන්ද්‍ර රන්දෙණිය ඇතුළු ශ්‍රී ලංකාවේ තරුණ පරපුරේ නළු නිළියන් රැසකට සිය හඬ අවදි කළේය.\n\nචරිතාපදානය\n\nළමා අවධිය\n\nජෝතිපාල ශ්‍රී ලංකාවේ මාතර දකුණේ මධ්‍යම පාන්තික පවුලක පළමු දරුවා විය. ඔහු මරදාන ශාන්ත ලෝරන්ස් විද්‍යාලයට සහ දෙමටගොඩ ශාන්ත ජෝන් විද්‍යාලයට ඇතුළත් විය. ජෝතිපාල තම පවුලට ගුවන් විදුලියක් නොතිබූ නිසා සංගීතය ඇසීමට තේ කඩවලට ගියේය. ඔහු Vintor Blosem සමඟ විවාහ විය. ඔවුන්ට දියණියන් 4 දෙනෙක් සිටිති.\n\nඔහු \"H. R\" යන මුලකුරු වලින් ප්‍රසිද්ධියට පත් වූ අතර, සෑම වයස්, ප්‍රජාවක් සහ පවුල්වල අයට ඔහු දක්වන කරුණාව නිසා \"හිතවත් ජෝතිපාල\" යන අර්ථය ඇති \"හදවත රත්තරං ජෝතිපාල\" ලෙස ආදරය කරන ලදී.\n\nජෝතිපාල ප්‍රථම වරට පසුබිම් ගායකයෙකු ලෙස සිරිල් පී\n\nසුරතලී\n\n, 1956 දී \"සිරියමේ සාර\" ගායනය. ඊට පෙර ඔහු දිවංගත සිරිසේන විමලවීරගේ ගීතයක් පටිගත කර ඇත.\n\nපොඩි පුතා\n\n. චිත්‍රපටයේ ඉන්දීය චිත්‍රපට නිර්මාපකයෙකු ජෝතිපාලගේ කටහඬ ප්‍රමාණවත් ලෙස නොසැලකීම නිසා ගීතය අවසන් සටහනට ඇතුළත් වූයේ නැත.\n\nජෝති පවසා ඇත්තේ ඔහු සිය මිතුරන් සමඟ නැරඹීමට ගිය විට ජීවිතය නැති කර ගැනීමට කල්පනා කළ බවයි\n\nපොඩි පුතා\n\n සහ ඔහුගේ ගීතය ඇතුළත් කර නැති බව දැනගත්තා. පසුව කවදාද\n\nසුරතලී\n\n නිෂ්පාදක ජබීර් ඒ කාදර්ට චිත්‍රපටිය සඳහා ඔහුව සලකා බැලීම සඳහා ඔහුගේ ගීතයක් ඇසීමට අවශ්‍ය විය, ජෝතිපාල වාර්තාවක් නිර්මාණය කිරීමට ප්‍රමාණවත් මුදලක් ඔහු සතුව නොතිබූ නිසා එම යෝජනාව බොහෝ දුරට සමත් විය. ඔහුට උදව් කළේ ප්‍රවීණ සංගීතවේදී ස්ටැන්ලි ඕමාර් විසින් ඔහුට රුපියල් 35 ක මුදලකට මුදල් යෙදවූ අතර එය එවකට විශාල මුදලක් විය. ජෝතිපාලගේ \"සිරියමේ සාර\" චිත්‍රපටයේ ගීතය තවමත් ශ්‍රී ලංකාව තුළ ජනප්‍රියව පවතී, ටී.ආර්.ගේ අධ්‍යක්ෂණය යටතේ ජනප්‍රිය අංකය පටිගත කර ඇත. තාත්තා ඉන්දියාවේ වහිනි ස්ටුඩියෝ එකේ.\n\nජෝතිපාල ශ්‍රී ලංකාවේ කීර්තිමත් අධ්‍යක්ෂවරුන් රැසක් සමඟ කටයුතු කර ඇත. ජෝතිපාලට ඔහුගේ වෘත්තීය ජීවිතයේ මුල් අවධියේදී ප්‍රවීණ චිත්‍රපට නිෂ්පාදක ලෙස්ටර් ජේම්ස් පීරිස් සමඟ චිත්‍රපටයේ වැඩ කිරීමට අවස්ථාව ලැබුණි.\n\nසංදේශය\n\n. ප්‍රවීණ ගී පද රචක අරිසෙන් අහුබුදු විසින් රචනා කරන ලද ප්‍රවීණ සුනිල් සාන්තයන් විසින් රචනා කරන ලද \"පුරුතුගීසිකාර\" ගීතය ජෝතිපාල විසින් මෙම චිත්‍රපටිය සඳහා ගායනා කරන ලදී.\n\nසාර්ථකත්වය\n\nජෝතිපාල හැටේ දශකයේ අග භාගයේ සහ හැත්තෑව දශකයේ ඔහු රඟපාන්නට පටන් ගත් යුගයේ නිර්මාණය වූ චිත්‍රපටවල අවිවාදිත තේරීම විය. ජනප්‍රිය හින්දි ගීතවල, විශේෂයෙන් මොහොමඩ් රාෆිගේ තනුවලට ගායනා කිරීම සම්බන්ධයෙන් ජෝති විවේචනයට ලක් වුවද, ඔහු ගායනා කළේ පණ්ඩිත් ඩබ්ලිව්.ඩී. අමරදේව, පී.වී. නන්දසිරි, ප්‍රේමසිරි කේමදාස, සරත් දසනායක සහ මිල්ටන් මල්ලවාරච්චි.\n\nවැනි ජනප්‍රිය ජනප්‍රිය චිත්‍රපට ඇතුළුව ඔහු සිය ගණනක චිත්‍රපටවල ගායනා කළේය\n\nකස්තුරි සුවඳ\n\n,\n\nතුෂාර\n\n,\n\nස්වීප් ටිකට්\n\n,\n\nහිත හොන්ඩා මිනිහෙක්\n\n,\n\nකවුඩා රාජා\n\n,\n\nHondata Hondai\n\n,\n\nවාසනා\n\n,\n\nසංගීතා\n\n සහ වෙනත් අය. සම්මානලාභී ගායකයා ඇතුළු චිත්‍රපටවල අමතක නොවන චරිත කිහිපයක් ද ඉටු කළේය\n\nඇතුල්වීම තහනම්\n\n,\n\nසුලලිතා සෝබනි\n\n,\n\nසුජීව\n\n,\n\nසූකිරි කෙල්ල\n\n,\n\nඅභිරහස\n\n,\n\nබෝනික්කා\n\n,\n\nශාන්ති\n\n සහ ඔහුගේම නිෂ්පාදනය\n\nසුමිතුරෝ සහ \"ඔබයි මමයි\".\n\nජෝතිපාල මිය ගියේ 1987 ජූලි මුල් සතියේය.\n\nඔහුගේ ගීතවල හින්දි තනු භාවිතය\n\nජෝතිපාල ඔහුගේම ගෞරවයෙන් ඉතා දක්ෂයෙකු වුවද, ජනප්‍රිය හින්දි ගීතවල, විශේෂයෙන් මොහොමඩ් රාෆිගේ තනුවලට ගායනා කිරීම සම්බන්ධයෙන් ඔහු විවේචනයට ලක්විය.\n\nමරණ\n\nඔහුගේ මරණයට දින දෙකකට පෙර, 1987 ජූලි 5 වන දින, දිවංගත ජනාධිපති රණසිංහ ප්‍රේමදාස මහතාගේ දේශප්‍රේමී ව්‍යාපෘතියක් වන \"ගම් උදාව\" සඳහා ඔහු සහභාගී වූ අතර, ඔහුගේ අවසන් විවෘත වේදිකාවේ ගායනා කළේය. නමුත් ගායනයේදී ඔහුට වේදනාවක් දැනුණත් ගායනය සාර්ථකව අවසන් කළා. ඊළඟ දවසේ ඔහු රෝහලට ඇතුළත් කළා. ජෝතිපාල 1987 ජූලි 7 වැනිදා රත්නම් පෞද්ගලික රෝහලේදී මිය ගියේය. ඔහුගේ මරණයට හේතුව මත්පැන් නිසා අක්මාව අකර්මණ්‍ය වීම බව පැවසේ. \"ඔහු නිතරම අපේ රෝහලට ආවා. ඔහු විශාල මත්පැන් ලෝලියෙක්. අපි ඔහුට කාලයෙන් කාලයට කිව්වා තවදුරටත් බොන්න එපා කියලා,\" එවකට රෝහලේ සේවය කළ හෙදියක් වන රම්‍යා ෆ්ලෙමින් ඔහුගේ මරණයෙන් පසු ප්‍රකාශ කර තිබේ. රම්‍යා ෆ්ලෙමින් දැඩි සත්කාර ඒකකය භාරව සිටි අතර ඇයට එන්නට ඇමතුම ලැබෙන විට නිවසේ සිට ඇත. මීට පෙර රෝහල සමඟ ඇති වූ ආරවුල් හේතුවෙන් ඇය ඇතුළු වීම ප්‍රතික්ෂේප කළ නමුත් පසුව ඇය පැමිණ සිටියාය. ඔහු විශාල මිනිසෙක් ලෙස උපුටා දක්වා ඇත, මුළු ඇඳම උඩට ගෙන ඔහු පානය කර ඇති අධික මත්පැන් නිසා ඔහුගේ බඩ තදින් විශාල විය. ඔහුට ද කැක්කුමක් තිබුණි. ජෝතිපාලගේ මරණය ආරංචි වීමත් සමඟ ජනතාව රත්නම් පෞද්ගලික රෝහල වටකර ගත්හ. යුනියන් චතුරශ්‍රය රසික රසිකාවියන්ගෙන් පිරී ගිය අතර ඇතැමුන් ජෝතිපාලගේ බැල්මක් දැකීමට පමණක් රෝහලේ ගේට්ටුවෙන් උඩින් පැන්නා.\n\nඑතුමාගේ ගුණානුස්මරණය වෙනුවෙන් රටපුරා නොයෙකුත් ක්‍රියාකාරකම් තවමත් ක්‍රියාත්මකයි."
    },
    {
        "name": "උරේෂා රවිහාරි",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1979 ජූලි 26, නුගේගොඩ, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 42 යි",
        "Star sign": "ලියෝ",
        "description": "උරේෂා රවිහාරි වික්‍රමසිංහ\n\n, (උපත 1982 ජූලි 26; උරේෂා රවිහාරී [සිංහල] ලෙස), ශ්‍රී ලාංකේය ගීත ගායිකාවකි. ශ්‍රී ලාංකේය සිංහල සිනමාවේ ප්‍රමුඛ පෙළේ පසුබිම් ගායිකාවක් ලෙස සැලකෙන රවිහාරි අඛණ්ඩව වසර තුනකදී හොඳම ගායන ශිල්පියා සඳහා වන සරසවිය සම්මාන ඇතුළු දේශීය චිත්‍රපට සහ රූපවාහිනී උළෙලවලදී සම්මාන රැසක් දිනා ඇත.\n\nපෞද්ගලික ජීවිතය ඇය 1982 ජුනි 26 නුගේගොඩ උපත ලැබුවාය. ඇයගේ පියා ධර්මශ්‍රී වික්‍රමසිංහ ශ්‍රී ලංකා ගුවන් විදුලි සංස්ථාවේ (SLBC) කීර්තිමත් නිවේදකයෙකි. ඇගේ මව චන්ද්‍රා වික්‍රමසිංහ. රවිහාරිට එක සහෝදරයෙක් ඉන්නවා, ඔහු අවුරුදු දෙකක් බාලයි. ඇය නුගේගොඩ සමුද්‍රදේවි බාලිකා විද්‍යාලයෙන් අධ්‍යාපනය නිමකර පසුව මිලාගිරිය ශාන්ත පාවුළු බාලිකා විද්‍යාලයෙන් අධ්‍යාපනය හැදෑරුවාය. ඇය සංගීතයට මෙන්ම නර්තනයට ද දක්ෂ වූවාය.\n\nඇය විවාහ වී සිටින්නේ පානදුර රෝහලේ වෛද්‍යවරයකු වන රුචිර නදීර සමඟයි. 2012 ජනවාරි මාසයේ Galle Face Hotel හි විවාහ උත්සවය පැවැත්විණි. මෙම යුවළට සසෙන් ප්‍රවිවේක් නම් එක් පුතෙක් සිටී. රුචිර දික්කසාද වී ඇති අතර ඔහුට ඔහුගේ පළමු විවාහයෙන් එක් පුතෙක් සිටී.\n\nවෘත්තීය ජීවිතය ඇගේ වෘත්තීය ජීවිතය ආරම්භ වන්නේ ඉතා කුඩා වයසේදීය. එහිදී ඇය අසල්වැසි නිවසක ප්‍රවීණ ගායිකා සුජාතා අත්තනායක විසින් පවත්වන ලද සංගීත පන්තිවලට සවන් දීමට පුරුදුව සිටියාය. ඉන්පසු ඇය ඇගේ පන්තිවලට සහභාගී වෙමින් සංගීතය සහ වාචික පුහුණුව ඉගෙන ගැනීමට පටන් ගත්තාය. වයස අවුරුදු 8 දී ඇය චිත්‍රපටය සමඟින් සිය මංගල පසුබිම් ගායනය කළාය\n\nශක්ති ඔබයි අම්මේ\n\n ඇයගේ ගුරුවරිය වන සුජාතා අත්තනායක සහ ටෝනි හසන් සමඟ.\n\nවයස අවුරුදු 9 දී ඇය ඇගේ පළමු ඇල්බමය නිකුත් කළාය\n\nසුරතල් නංගියේ\n\n. ඇය සිංහල සහ හින්දි ගීත දෙකම සමඟින් බොහෝ අවස්ථාවන් පැවැත් වූ අතර ඇගේ දෙවන ඇල්බමය ලෙස වයස අවුරුදු 13 දී හින්දි-සිංහල මිශ්‍ර සීඩී/කැසට් පටය නිකුත් කළාය. සෑම අඟහරුවාදා දිනකම ITN නාලිකාවේ විකාශය වන සංගීත වැඩසටහනක හින්දි ගීත ගායනා කිරීමට ඇයට අවස්ථාව ලැබුණා. ඇගේ තුන්වන ඇල්බමය,\n\nකසුන් තාරකා\n\n ඇයට වයස අවුරුදු 16 දී නිදහස් කරන ලදී.\n\nවයස අවුරුදු 13 දී රවිහාරි චිත්‍රපටයේ රංගනයට පිවිසියේය\n\nමල්සරා දෝණි\n\n ඇගේ පියා විසින් නිෂ්පාදනය කරන ලදී. චිත්‍රපටයේ ඇගේ ගීතය\n\nඋන්නා එක ගංගාවක\n\n ඉතා ජනප්‍රිය විය. කෙසේ වෙතත් ඇය සිය මාවත ලෙස සංගීත ක්ෂේත්‍රය තෝරාගෙන සුජාතා අත්තනායක සහ දිවංගත ඔස්ටින් මුණසිංහ යටතේ 'ප්‍රතම' සහ හින්දුස්ථානි සංගීතය පිළිබඳ ඩිප්ලෝමාව සම්පූර්ණ කළාය. ඇය ප්‍රීති ගනේගොඩ සහ වාසුකී ෂන්මුගම්පිල්ල යටතේ 'භරත නාට්‍ය' ද සම්පූර්ණ කළාය.\n\n1996 දී රවිහාරි ඇගේ ඇල්බමය වෙනුවෙන් රස සම්මාන උළෙලේ වැඩියෙන්ම අලෙවි වූ සීඩී/කැසට් පටයට හිමි සම්මානය දිනා ගත්තාය.\n\nසිතින් මං ආදරේයි\n\n. ඉන්පසුව 1998 වසරේ සුමති සම්මාන උළෙලේ හොඳම ගායිකාවට හිමි සම්මානය ඇය රූපවාහිනී කතාමාලාවේ ගීතය වෙනුවෙන් දිනා ගත්තාය.\n\nසසල රුව\n\n. 2005 දී ඇය රයිගම් ටෙලීස් හි හොඳම ගායිකාව ලෙස සම්මානය දිනා ගත්තේ අනුක්‍රමික ගීතය සඳහා ය.\n\nඉඩෝරයක මල් පිපිලා\n\n.\n\nසංගීතය සහ නර්තනය හැරුණු විට රවිහාරි සුවිනීතා කොතලාවල යටතේ රූපලාවන්‍ය සංස්කෘතිය පිළිබඳ ඩිප්ලෝමාවක් සම්පූර්ණ කළාය. 2006 දී, ඇය චිත්‍රපටය වෙනුවෙන් Signis OCIC සම්මාන උළෙල සහ ජනාධිපති චිත්‍රපට උළෙල යන දෙකේදීම හොඳම ගායිකාවට හිමි සම්මානය දිනා ගත්තාය.\n\nඅංජලිකා\n\n.\n\nAwardsPlayback singingPlayback film tracks"
    },
    {
        "name": "ජනිත් වීරසිංහ",
        "info": "ශ්‍රී ලාංකීය සංගීත කලාකරුවෙක්",
        "Intro": "ශ්‍රී ලාංකීය සංගීත කලාකරුවෙක්",
        "A.K.A.": "ජනිත් වීරසිංහ",
        "Is": "ගායකයා\n\nනළුවා\n\nව්යවසායකයා",
        "From": "ශ්රී ලංකාව",
        "Gender": "පිරිමි",
        "Birth": "2003 පෙබරවාරි 28, කොළඹ, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 18 යි",
        "Family": "මව:\n\nචම්පිකා සජීවනී\n\nපියා:\n\nසජිත් වීරසිංහ",
        "Education": "සාරානාත් ජාතික විද්‍යාලය කුලියාපිටිය",
        "Profiles": "",
        "description": "මුල් ජීවිතය : ජනිත් ඉඳුසර ගිම්හාන් වීරසිංහ\n\n ලෙස වඩාත් හොඳින් හැඳින්වේ\n\nජනිත් වීරසිංහ\n\n, ඔහු ශ්‍රී ලාංකික සංගීත කලාකරුවෙක්, ව්‍යවසායකයෙක්, ඩිජිටල් අලෙවිකරුවෙක්, ග්‍රැෆික් නිර්මාණකරුවෙක් සහ අන්තර්ජාල පෞරුෂයකි. ග්‍රැෆික් ඩිසයින් සහ ඩිජිටල් මාර්කටින් වල ලොකු නමක් හදාගත්තු කෙනා. මූලික වශයෙන්\n\nජනිත් වීරසිංහ\n\n ග්‍රැෆික් නිර්මාණකරුවෙකු ලෙස සිය වෘත්තීය ජීවිතය ආරම්භ කළ නමුත් ඔහු සංගීත ක්ෂේත්‍රයට පිවිසියේය.\n\nජනිත් වීරසිංහ\n\n 2003 පෙබරවාරි 28 වැනි දින ශ්‍රී ලංකාවේ කොළඹදී උපත ලැබීය. වෘත්තිය : ඔහු සංගීත ක්ෂේත්‍රයට හඳුන්වා දෙනු ලැබුවේ ඔහුගේ පළමු හඬ පටය වන “ලොක් ඩවුන්” මුලින්ම SoundCloud හි එළිදැක්වීමයි. ටික දවසකට පසු ඔහු Spotify, Google Play Music, Apple Music, iTunes, Amazon Music, JioSaavan සහ Deezer, Tidal සහ Napster වැනි ජාත්‍යන්තර වේදිකාවල විවිධ සංගීත වේදිකාවල ඔහුගේ සංගීතය නිකුත් කරයි. ඔබට ලැබෙනවා\n\nජනිත් වීරසිංහ\n\n TikTok, Instagram හෝ Facebook පුස්තකාලයේ සංගීතය. මූලික වශයෙන්\n\nජනිත් වීරසිංහ\n\n ඔහුගේ වෘත්තිය මුලින්ම ග්‍රැෆික් නිර්මාණකරුවෙකු හෝ යූ ටියුබ්කරුවෙකු ලෙස ආරම්භ කරන්න. ඒත් කාලෙකට පස්සේ සංගීත ක්ෂේත්‍රයට එනවා. දැන් ඔබ ගූගල් හි සෙව්වහොත් ඔබට ඔහු පිළිබඳ සියලු තොරතුරු ලැබෙනු ඇත. YouTube ඔහුගේ YouTube නාලිකාව නිල කලාකරුවෙකු ලෙස නිල වශයෙන් තහවුරු කළේය. යූ ටියුබ් හි යූ ටියුබ් ඔහු සංගීත සත්‍යාපිත ලාංඡනය. ඊට අමතරව ජනිත් Google, Yahoo සහ Bing හි පුද්ගලයාද තහවුරු කර ඇත. White Oats Records හි නිර්මාතෘ සහ ප්‍රධාන විධායක නිලධාරී: ඔහු ආරම්භ කළ Music Production Records White Oats වාර්තා මගින් Music Beats, Instrumental Beats, Mix සහ Mastering සපයයි :"
    },
    {
        "name": "සනත් නන්දසිරි",
        "info": "සංගීතඥයෙක්",
        "Intro": "සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1942 පෙබරවාරි 15",
        "Age": "අවුරුදු 79 යි",
        "description": "මහාචාර්ය\n\nසනත් නන්දසිරි\n\n (සිංහල:\n\nසනත් නන්දසිරි\n\n; 1942 පෙබරවාරි 15 ​​වැනි දින ශ්‍රී ලංකාවේ ගොතටුව ප්‍රදේශයේ උපත ලැබීය) යනු විචාරක පැසසුමට ලක් වූ ශ්‍රී ලාංකික ශාස්ත්‍රීය සංගීතඥයෙකි. ඔහු ශ්‍රී ලංකාවේ සෞන්දර්ය හා රංග කලා විශ්වවිද්‍යාලයේ වත්මන් කුලපතිවරයා වේ. පණ්ඩිත් අමරදේවයන්ගේ අභාවයෙන් පසුව ජනාධිපති මෛත්‍රීපාල සිරිසේන මහතා නන්දසිරි මහතා පත් කළේය. ඔහු සංගීතය නිර්මාණය කළේය\n\nසඳමාලිගේ කතාව\n\n, රූපවාහිනියේ පළමු රූපවාහිනී කතාමාලාව. ජීවිතය සහ වෘත්තීය මුල් ජීවිතය සහ අධ්‍යාපනය නන්දසිරි උපත ලැබුවේ ව්‍යාපාරිකයෙකු සහ ගොඩනැගිලි කොන්ත්‍රාත්කරුවෙකු වන එච්.එම්. විලියම් පෙරේරා සහ දෝන අමලින් කටුගම්පොල. ඔහු නව යොවුන් වියේදී පාසල් දෙකකට සමගාමීව (මහාබෝධි මහා විද්‍යාලය, ගොතටුව මහා විද්‍යාලය සහ දෙමටගොඩ ශාන්ත මැතිව් විද්‍යාලය, එහිදී ඉංග්‍රීසි ඉගෙනුම ලැබීය.) නන්දසිරි ප්‍රථම වරට සිංහල ගුවන් විදුලියට පෙනී සිටියේ වයස අවුරුදු 13 දී 1955 දී ය. ඔහු තබ්ලා වාදනය හැදෑරීමට පටන් ගත්තේය. DR යටතේ පීරිස් ඉක්මනින්ම. 1960 දී නන්දසිරි භාත්ඛණ්ඩේ සංගීත ආයතනයේ ඉගෙනීම සඳහා ඉන්දියාවට ගියේය. ඇකඩමියේ ඔහුගේ ගුරුවරුන් වූයේ උස්තාද් අහමඩ් ජන් තිරක්වා, ජී.එන්. Nattu, Ustad Mokshut Ali, Pandit Hari Shankar Misra සහ Ustad Rahimmuddeen Khan Daga.ඉන්දියාවේ සිටියදී නන්දසිරි විසින් ලක්නව් ගුවන් විදුලියේ පළ වූ ගීත කිහිපයක්ම රචනා කළේය. 1974 දී නැවත ශ්‍රී ලංකාවට පැමිණි ඔහු කැලණිය විශ්වවිද්‍යාලයේ ආචාර්යවරයකු ලෙස ආචාර්ය මණ්ඩලයට බැඳුණි. නන්දසිරි 1988 සිට 1992 දක්වා විශ්ව විද්‍යාලයේ සංගීත ප්‍රධානියා ලෙස සේවය කළේය. නන්දසිරි ගායන සංගීතය පිළිබඳ I කොටස විභාගයට පෙනී සිට 1992 දී \"නිපුන්\" විභාගයෙන් පළමු පන්තිය ලබා මෙම කාර්යය ඉටු කළ පළමු ශ්‍රී ලාංකිකයා බවට පත්විය. ඔහු 2016 වසරේ සෞන්දර්ය කලා හා රංග කලා විශ්වවිද්‍යාලයේ සංගීත පීඨයේ කුලපතිවරයා ලෙස පත් කරන ලදී.පෞද්ගලික ජීවිතය 1971 දී නන්දසිරි ගායිකා මල්කාන්ති පීරිස් සමඟ විවාහ විය. ඔවුන් විවාහ වීමට පෙර සහ පසුව ගීත සඳහා සහයෝගයෙන් කටයුතු කළහ. නන්දසිරිගේ දියණිය අනුරාධා උපන්නේ 1974 පෙබරවාරි 14 වැනිදාය. සංගීතවේදිනියක ද වන අනුරාධා මේ වනවිට සිය සැමියා වන නිරෝෂා බණ්ඩාර සමඟ නැවතත් ශ්‍රී ලංකාවට පැමිණ සිටී."
    },
    {
        "name": "සුනිල් එදිරිසිංහ",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1949 දෙසැම්බර් 19, කොළඹ, කොළඹ දිස්ත්‍රික්කය, බස්නාහිර පළාත, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 71 යි",
        "Profiles": "",
        "description": "පැටිකිරිගේ සුනිල් ජයප්‍රීති එදිරිසිංහ\n\n (සිංහල:සුනිල් එදිරිසිංහ) (උපත දෙසැම්බර් 19, 1949, ශ්‍රී ලංකාව, කොළඹ) යනු විචාරක පැසසුමට ලක් වූ ශ්‍රී ලාංකික ශාස්ත්‍රීය සංගීතඥයෙකි. එදිරිසිංහ 1983 වසරේ \"මායා මිරිඟුව පිරුණු ලෝ තලේ\" සඳහා පසුබිම් ගායනය වෙනුවෙන් ජනාධිපති සම්මානයෙන් පිදුම් ලැබීය.\n\nඅධිෂ්ඨානය\n\n. ඔහු 1988 දී \"තුරුලක හුරතල්\" සඳහා පසුතල ගායනය වෙනුවෙන් ස්වර්ණ සංඛ සම්මානයෙන් පිදුම් ලැබීය.\n\nමංගල තග්ග\n\n සහ 1990 දී \"වලාකුලක් ගෙන මුව කරමු\" සඳහා\n\nසහරාවේ සිහිනය\n\n. ඔහු 1988 වසරේ \"තිදාස පිවිර\" සඳහා පසුබිම් ගායනය වෙනුවෙන් සරසවිය සම්මානය ද දිනාගෙන ඇත.\n\nසඳකඩ පහන\n\n සහ 2002 දී \"පොරොන්දුව\" සඳහා\n\nපොරොන්දුව\n\n.ජීවිතය සහ වෘත්තිය මුල් ජීවිතය පැටිකිරිගේ එදිරිසිංහ සහ උෂෙට්ටිගේ එලිසබෙත් පෙරේරාට දාව දරුවන් හත් දෙනාගෙන් බාලයා ලෙස එදිරිසිංහ උපත ලැබීය. ඔහු හැදී වැඩුණේ වරාගොඩ කැලණියේ පිපෙන රබර් කර්මාන්තයක් අතර ය. එදිරිසිංහ 1955 දී ශ්‍රී ධර්මාලෝක විද්‍යාලයෙන් පාසල් අධ්‍යාපනය ආරම්භ කළේය. ඔහු 1968 දී සපුගස්කන්ද මහා විද්‍යාලයට ගොස් පසුව දෙල්ගොඩ කල්‍යාණ ප්‍රදීප පිරිවෙනෙන් උසස් පෙළ විභාගය සඳහා ඉගෙනුම ලැබීය. 1969 දී ද්විතීයික අධ්‍යාපනය අවසන් කළ එදිරිසිංහ රජයේ මුද්‍රණ නීතිගත සංස්ථාවේ සේවය කිරීමට පටන් ගත්තේය. ඔහු එම වසරේ පසුබිම් ගායකයෙකු ලෙස සිය සොයුරු සතිස්චන්ද්‍රගේ චිත්‍රපටය සඳහා \"සඳකඩ පහන\" ගායනා කළේය.\n\nමාතර ආච්චි\n\n. වික්ටර් රත්නායක විසින් රචනා කරන ලද මෙම ගීතය වොලී නානායක්කාර විසින් රචනා කරන ලදී.එදිරිසිංහ සංගීතය හැදෑරුවේ විශාරද පී.වී. නන්දසිරිගේ සංගීත ඇකඩමිය සහ 1970 දශකයේ මුල් භාගයේ ඉන්දියාවේ ලක්නව් විශ්ව විද්‍යාලය. 1975 දී එදිරිසිංහ ඉන්දියාවේ කීර්තිමත් භාත්ඛණ්ඩේ සංගීත ඇකඩමියෙන් පළමු පන්තියේ ගෞරව සහිතව උපාධිය ලබා ගත්තේය. ඔහු වැඩි කල් නොගොස් ශ්‍රී ලංකා ගුවන් විදුලි සංස්ථාවට සම්බන්ධ විය. 1980 දී එදිරිසිංහ සිය පළමු කැසට් පටය නිකුත් කළේය\n\nචන්ද්‍ර මණ්ඩලය\n\n.පෞද්ගලික ජීවිතය එදිරිසිංහට සහෝදර සහෝදරියන් හය දෙනෙක් ඉන්නවා. වැඩිමහල් ධර්මශ්‍රී ලලිත කලාවට සම්බන්ධ කෙනෙක්. ඔහුගේ සහෝදරිය මර්සි සංගීත ගුරුවරියක්; ඔහුගේ සොහොයුරන් වන සතිස්චන්ද්‍ර සහ නිමල් සිනමාවට පිවිසියේය.එදිරිසිංහට මහනුවර සංචාරයකදී ඔහුගේ අනාගත බිරිඳ නන්දනී \"කුමුදු\" මුණසිංහ හමුවිය. ඔවුන් 1979 දී විවාහ වූ අතර ඊළඟ වසරේ ඔවුන්ගේ පළමු දරුවා සංඛ චමින්ද්‍ර එදිරිසිංහ ලැබුවා. 1985 දී ඔවුන්ගේ දියණිය සංකානි එදිරිසිංහ උපත ලැබුවාය."
    },
    {
        "name": "අජිත් බණ්ඩාර",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "description": "අජිත් බණ්ඩාර යනු ශ්‍රී ලාංකික ගායකයෙකි. 2006 වසරේ සිරස සුපර්ස්ටාර් ගායන තරඟයේ පළමු වාරය ජයග්‍රහණය කිරීම නිසා ඔහු මෙරට ජනප්‍රියයි. ඔහුගේ පළමු ඇල්බමය \"තිලක තියන්න\". මෙම ඇල්බමය එළිදැක්වීම කොළඹ සුගතදාස ගෘහස්ථ ක්‍රීඩාංගණයේදී සිදු විය.\n\nපළමු ගීත ඇල්බමය එළිදැක්වීමෙන් පසු එයට විශේෂ ප්‍රචාරයක් ලබා දුන්නේ සිරස රූපවාහිනියයි. මේ වන විට මහජනතාවට ඔහුව මාධ්‍යවල දකින්නට නැත\n\nතිලකා තියන්නාගේ ඇල්බමයට ගීත ඇතුළත් වුණා\n\nනැත.\n\nශීර්ෂය\n\nදිග\n\n1.\n\n\"අම්මා\"\n\n(ඇල්බම අනුවාදය)\n\n03.23\n\n2.\n\n\"අසිපිය සලන නිසා\"\n\n(ඇල්බම අනුවාදය)\n\n04.02\n\n3.\n\n\"හීන් මැණිකේ\"\n\n(ඇල්බම අනුවාදය)\n\n4.\n\n\"Mage Nage\"\n\n(ඇල්බම අනුවාදය)\n\n03.23\n\n5.\n\n\"මගේ සිතට මුව වැමින්\"\n\n(ඇල්බම අනුවාදය)\n\n04.01\n\n6.\n\n\"මට එන්න නෝඩි\"\n\n(ඇල්බම අනුවාදය)\n\n3.49\n\n7.\n\n\"ඔබ ඉන්නවනම් ඉන්න මා ළඟ\"\n\n(ඇල්බම අනුවාදය)\n\n03.44\n\n8.\n\n\"පරසතු මල් පිපිලා\"\n\n(ඇල්බම අනුවාදය)\n\n03.36\n\n9.\n\n\"රියා සැන්ඩලියා\"\n\n(ඇල්බම අනුවාදය)\n\n10.\n\n\"සීතා හන්දෙකරේ\"\n\n(මෙම ගීතය මගින් ඔහුගේ පළමු සංගීත වීඩියෝව නිර්මාණය කරන ලදී)\n\n3.59\n\n11.\n\n\"සෙව්වන්දියේ\"\n\n(ඇල්බම අනුවාදය)\n\n04.26\n\n12.\n\n\"සිහිනෙක සිත දවටී\"\n\n(ඇල්බම අනුවාදය)\n\n04.26\n\n13.\n\n\"සුදු හංසියේ මිහිරවියේ\"\n\n(ඇල්බම අනුවාදය)\n\n04.59\n\n14.\n\n\"තාරුකා නීවා\"\n\n(ඇල්බම අනුවාදය)\n\n03.46\n\n15.\n\n\"තිලකා තියන්න\"\n\n(සාමාන්‍යයෙන් සෙසු සුපර් ස්ටාර් තරඟකරුවන් සමඟ ගායනා කරනු ලැබේ)\n\n03.36\n\n16.\n\n\"විලක් නෙළුම් මල් අරන්\"\n\n(ඇල්බම අනුවාදය)\n\n"
    },
    {
        "name": "ඩබ්ලිව් ඩී අමරදේව",
        "info": "ශ්‍රී ලාංකික ගායන ශිල්පියෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායන ශිල්පියෙක්",
        "A.K.A.": "ඇල්බට් පෙරේරා, පණ්ඩිත් අමරදේව",
        "Was": "සංගීතඥයෙක්\n\nගායකයා\n\nනිර්මාපකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1927 දෙසැම්බර් 5, මොරටුව, කොළඹ, කොළඹ දිස්ත්‍රික්කය, බස්නාහිර පළාත",
        "Death": "2016 නොවැම්බර් 3, ශ්‍රී ජයවර්ධනපුර කෝට්ටේ, කොළඹ දිස්ත්‍රික්කය, බස්නාහිර පළාත, ශ්‍රී ලංකාව\n\n(වයස අවුරුදු 88)",
        "description": "ශ්‍රී ලංකාභිමාන්‍යය\n\nවන්නකුවත්ත වඩුගේ දොන් ඇල්බට් පෙරේරා\n\n (සිංහල:\n\nවන්නකුවත්ත වඩුගේ දොන් ඇල්බට් පෙරේරා\n\n; 5 දෙසැම්බර් 1927 - 3 නොවැම්බර් 2016) ඔහු හදාගත් නාමයෙන් වඩාත් හොඳින් හඳුනයි\n\nඅමරදේවයන් ය\n\n, ශ්‍රී ලංකාවේ ප්‍රකට ගායන ශිල්පියෙක්, වයලීන වාදකයෙක් සහ සංගීත රචකයෙක් විය. ප්‍රධාන වශයෙන් සිතාර්, තබ්ලා සහ හාමෝනියම් වැනි සාම්ප්‍රදායික වාද්‍ය භාණ්ඩ භාවිත කරන අමරදේවයන් සිය කෘතියට සිංහල ජන සංගීතය භාරතීය රාග සමඟින් ඇතුළත් කර ඇත. පණ්ඩිත් අමරදේවයන් සිංහල සංගීතයේ දියුණුව සඳහා කළ දායකත්වය අසමසම ලෙස බොහෝ දෙනෙක් සලකති, එබැවින් තර්කයකින් තොරව උපුටා දක්වා ඇත.\n\nMaestro of Sri Lanka Music (si. හෙළයේ මහා ගාන්ධර්වයා)\n\nපණ්ඩිත්\n\n වන්නකුවත්ත වඩුගේ දොන් අමරදේව. අමරදේව ලෙසින් පරිවර්තනය කරන අමරදේව යන නාමය ඔහුට ලබා දුන්නේ මහාචාර්ය එදිරිවීර සරච්චන්ද්‍ර (ශ්‍රී ලංකාවේ ප්‍රමුඛතම නාට්‍ය රචක සහ සමීපතම සහකරු) විසිනි. මේ කාලය තුළ ශ්‍රී ලංකාව (එවකට ලංකාව) ස්වාධීන රාජ්‍යයක් ලෙස මතුවීම ආරම්භ කළා පමණි. ජාතිය සහ ප්රශ්නය\n\nකුමක්\n\n ශ්‍රී ලාංකේය සංගීතය බුද්ධිමතුන්, කලාකරුවන් සහ සාමාන්‍ය ජනතාව විසින් එක හා සමාන ජවයකින් සෙමෙන් ආමන්ත්‍රණය කරනු ලැබීය. මෙම යුගයේ ආත්මයට ප්‍රතිචාර වශයෙන්, අමරදේවයන් ලක්නව්හි ඔහු හැදෑරූ උත්තර භාරතීය රාග සමඟ ස්වදේශීය ජන සංගීතය සම්බන්ධ කිරීමට පටන් ගත් අතර, එමඟින් වඩාත් සංකීර්ණ කැඩෙන්සියකට ප්‍රකාශයක් ලබා දුන්නේය. ඔහුගේ අනෙකුත් නවෝත්පාදනයන් අතර බටහිර සුසංයෝගය සහ ප්‍රති-සංහිඳියාව පිළිබඳ ඔහුගේ අත්හදා බැලීම් ඇතුළත් වේ. දකුණු ඉන්දියානු සහ දෙමළ සංගීත ආකෘති සමඟ. ‘රන් දහදිය බිඳු බිඳු’ ගීතයට අමරදේවයන් මුසු කළේ උපන් ගමේ බයිලා සංගීතයයි. කෙසේ වෙතත්, ඔහුගේ කෘතිය, ශ්‍රී ලංකාවේ කීර්තිමත් ගී පද රචකයෙකු වන මහගම සේකර සමඟ සම්භාව්‍ය සිංහල කවිය ඔහුගේ අද්විතීය සංගීත තානය සමඟ ඒකාබද්ධ කිරීමේ සමෝච්ඡයන් ගවේෂණය කිරීමේදී ඔහු කළ කාර්යය ලෙස පවතී. කාලයාගේ ඇවෑමෙන්, ජාතියක ආත්මය පිළිබිඹු කරන සමස්ත දර්ශනයක් පිළිබිඹු කිරීමට අමරදේවගේ සංගීතය පැමිණියේය. ඔහු මුද්‍රා නාට්‍ය (කරදිය, නල දමයන්ති, ආදිය), චිත්‍රපට (රන්මුතු දූව, ගම් පෙරළිය, රන් සළු, දෙලොවක් අතර,) සඳහා සංගීතය රචනා කර ඇත. ගැටවරයෝ, රෙන ගිරව්, තුන් මං හන්දිය, පුරන් අප්පු, ආදිය), රංග ශාලාව (වෙස්සන්තර, ආදිය), ගුවන්විදුලිය සහ රූපවාහිනිය. මැන්ඩලීනය සහ වීණාව මුසු කළ සංගීත භාණ්ඩයක් වන මැන්ඩෝ වීණාවේ නිර්මාතෘ ඔහුය. නන්දා මාලිනී සහ එඩ්වඩ් ජයකොඩි වැනි කලාකරුවන් පුළුල් ප්‍රේක්ෂකාගාරයට හඳුන්වා දුන්නේ අමරදේවයන් ලෙසය. සුනිල් එදිරිසිංහ, වික්ටර් රත්නායක, නීලා වික්‍රමසිංහ වැනි බොහෝ කලාකරුවන් ඔහුව තම නිර්මාණවලට ප්‍රධාන බලපෑමක් කළ බව සඳහන් කර ඇත. ආචාර්ය ලෙස්ටර් ජේම්ස් පීරිස් ඔහුගේ හඬ ශ්‍රේෂ්ඨතම සංගීත භාණ්ඩය ලෙස දක්වා ඇත. ජාතික සම්ප්‍රදායක් නිර්මාණය කිරීමෙහිලා ඔහුගේ භූමිකාව වෙනුවෙන් සිංහල ශිෂ්ටාචාරයේ නිර්වචන සංගීතඥයා ලෙසද අමරදේව විස්තර කර ඇත. අමරදේව විමලා සමඟ විවාහ වූ අතර ඔවුන්ට එක් පුතෙක් (රංජන අමරදේව) සහ දියණියන් දෙදෙනෙක් (සුභානි අමරදේව, ඇයම දක්ෂ ගායන ශිල්පිනියකි. , සහ Priyanvada Amaradeva). ඔහු පුණ්‍යායතන රැසක අනුශාසකයෙක් විය. හදිසි අසනීප තත්ත්වයක් හේතුවෙන් මරණය අමරදේව මහතා ශ්‍රී ජයවර්ධනපුර ශික්ෂණ රෝහලට ඇතුළත් කෙරිණි. ඔහු දැඩි සත්කාර ඒකකයේ ප්‍රතිකාර ලබමින් සිටියදී 2016 නොවැම්බර් 3 වන දින වයස අවුරුදු 88 දී මිය ගියේය. මරණයට හේතුව හෘදයාබාධයකි. සතියක ජාතික ශෝක කාලයක් සහිතව රාජ්‍ය අවමංගල්‍ය උත්සවයක් පවත්වන බව රජය පසුව නිවේදනය කළේය. ඔහුගේ දේහයට දින දෙකක් නිදහස් අනුස්මරණ ශාලාවේදී රාජ්‍ය ගෞරව පිරිනැමූ අතර, මෙරට ඉතිහාසයේ ප්‍රථම වතාවට දේහය නිදහස් අනුස්මරණ ශාලාවේ තැන්පත් කළ අවස්ථාව මෙයයි."
    },
    {
        "name": "කරුණාරත්න දිවුල්ගනේ",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක් සහ දේශපාලනඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක් සහ දේශපාලනඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "description": "කරුණාරත්න දිවුල්ගනේ\n\n ශ්‍රී ලංකාවේ ගායකයෙක් සහ ශාස්ත්‍රීය සංගීතඥයෙක්. ඔහු 2006 නොවැම්බර් සිට 2015 දක්වා ශ්‍රී ලංකාවේ උතුරු මැද පළාතේ ආණ්ඩුකාරවරයා විය."
    },
    {
        "name": "චම්පා කල්හාරි",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1974 මාර්තු 21",
        "Age": "අවුරුදු 47 යි",
        "description": "චම්පා කල්හාරි ජයසේකර (උපත මාර්තු 21, 1974, කොළඹ) ශ්‍රී ලාංකික ගායිකාවකි. මුල් ජීවිතය සහ අධ්‍යාපනය\n\nකල්හාරි උපන්නේ කොළඹදී සංගීතඥයෙකුගේ දියණියකි. කොළඹ විශාකා විද්‍යාලයේ අධ්‍යාපනය ලැබූ ඇය ඉන්දියාවේ සංගීතය හැදෑරුවාය. ඇය දැනට පදිංචිව සිටින්නේ පිළියන්දල ය.\n\n වෘත්තීය\n\n1980 දී රේඩියෝ සිලෝන් විසින් පවත්වන ලද ඇගේ තේරීම් පරීක්ෂණයේදී ඇය ලතා මංගේෂ්කාර්ගේ \"ශ්‍රී ලංකා මා ප්‍රියදරා ජය භූමි\" ගීතය ගායනා කළාය. ඒ නිසා ඇයට ගුවන්විදුලි ළමා වැඩසටහනට පෙනී සිටින්න අවස්ථාවක් ලැබුණා\n\nḶma Piṭiya\n\n (\"ළමා ක්ෂේත්රය\").\n\nඇය හින්දි ගීත ගායනා කරමින් ජනප්‍රිය වූවාය. ඇගේ පළමු ඇල්බමය නම් කරන ලදී\n\nසතිරේ\n\n. ඇය ඇල්බම පහළොවකට වඩා නිකුත් කර ඇති අතර ඒවායින් බොහොමයක් හින්දි ගීත. ඇය සිංහල භාෂාවෙන් චිත්‍රපටවල පසුබිම් ගායිකාවක් ලෙස රඟපා ඇත. ඇය ගීත 16කින් යුත් සිංහල සංයුක්ත තැටියක් නිෂ්පාදනය කර ඇත.\n\nඇය සුප්‍රසිද්ධ සිංහල චිත්‍රපට පසුබිම් ගායිකාවක් වූවාය.\n\nවඩබරිනම් වඩක් නා\n\n,\n\nරන්දෙණිගල සිංහයා\n\nඒ,\n\nරා ඩැනියෙල් දවල් මිගෙල්\n\n,\n\nජොන්සන් ගොන්සන්\n\n ,\n\nවිජේ සහා අජේ\n\n සහ තවත්.\n\nසිත පිය සලාල\n\n සිට ගීතය\n\nවඩ බැරිනම් වඩක් නා\n\n චිත්‍රපටිය 90 දශකයේ ඉතා ජනප්‍රිය විය.\n\nකල්හාරි හින්දි බසින් සිංහල ගීත පටිගත කිරීමක් නිෂ්පාදනය කළේය. ගුණදාස කපුගේ, දයාරත්න රණතුංග සහ සනත් නන්දසිරි යන ගීත රචකයන්ගේ අවසරය ඇතිව ඇය ඔවුන්ගේ ගීත හින්දි භාෂාවෙන් ගායනා කළාය. කල්හාරි නිළියක් සහ නිවේදිකාවක් ලෙසද කටයුතු කර ඇත. ඇය ටෙලි නාට්‍ය දහතුනක රඟපා තිබෙනවා. වැඩසටහනේ නිවේදිකාව වූයේ ඇයයි\n\nහින්දි ටොප් ටෙන්\n\n ඉරිදා දිනවල Shree FM මගින් විකාශය වේ.\n\nඇය අලුත් සිංහල ගීතයක් නිකුත් කළා\n\nනෙත් පියන් පිය ඉන්නම්\n\n 2015 දී, සහ ඉන්දියානු ගායකයා සමඟ හින්දි භාෂාවෙන් එකම ගීතය\n\nත්‍රිදේව් බෝරා\n\n 2016 දී."
    },
    {
        "name": "චන්ද්‍රලේඛා පෙරේරා",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1961 දෙසැම්බර් 1, කුරුණෑගල",
        "Age": "අවුරුදු 60 යි",
        "Family": "කලත්රයා:\n\nරූකාන්ත ගුණතිලක",
        "description": "චන්ද්‍රලේඛා පෙරේරා\n\n (සිංහල:\n\nචන්ද්‍රලේකා පෙරේරා\n\n) (උපත 1 දෙසැම්බර් 1961), ජනප්‍රිය ශ්‍රී ලාංකික පොප් ගායකයෙකි. පෙරේරා උපත ලැබුවේ කුරුණෑගල මධ්‍යම පාන්තික පවුලක ය. කුඩා කාලයේ ඇය නිතරම නිවසේ ගායනා කළාය. පාසැලේදී ඇය නිතර ගායනා කළ අතර අන්තර් පාසල් තරඟ සඳහා සාර්ථකව සහභාගී විය. ඉගෙන ගන්න අතරේ ඇය කුරුණෑගල \"ස්ප්‍රින්ග් ටයිම්\" සංගීත කණ්ඩායමට ගායනා කළා. ඇයගේ අනාගත සැමියා වන රූකාන්ත ගුණතිලක 1976දී මෙම සංගීත කණ්ඩායමේ යතුරු පුවරුව වාදකයෙකුව සිටියදී ඇයට මුණගැසුණි. ඇයගේ අනුදැනුමකින් තොරව පෙරේරාගේ පියා තම දියණියගේ නම ශ්‍රී ලංකා රජයේ අනුග්‍රහය ලබන ජාතික තරුණ සේවා සභාවකට (NYSC) ඉදිරිපත් කළේය. පසුව ඇය සහභාගී වූ අතර සාර්ථක සම්මුඛ පරීක්ෂණයකට සහභාගී විය. ඇය ජපානයෙන් ශ්‍රී ලංකාවට තෑග්ගක් වූ ශ්‍රී ලංකාවේ ජාතික රූපවාහිනී සේවයට ද පෙනී සිටි අතර ඒ වන විට පරීක්ෂණ සම්ප්‍රේෂණ විකාශනය කරමින් සිටියාය. පෙරේරා NYSC වාර්තා කරමින් සිටියදී චිත්‍රපට අධ්‍යක්ෂක සහ නිෂ්පාදක D. B. නිහාල්සිංහගේ අවධානයට ලක් විය. ඔහු ඇයව ඔහුගේ නව රූපවාහිනී කතාමාලාවේ රඟපෑමට තෝරා ගත්තේය\n\nරේඛා\n\n, එය ඇය තරුවක් බවට පත් කළේය. 1986 වසරේ හොඳම රූපවාහිනී නිළියට හිමි සම්මානය ඇයට හිමි විය\n\nනදී ගීතය\n\n, නිහාල්සිංහගේ තවත් කතා මාලාවක්), සහ එම වසරේම හොඳම පසුබිම් ගායකයාට හිමි සම්මානය (චිත්‍රපටය සඳහා\n\nයාලි හාමුවැන්නයි\n\n) එවකට LUX International සඳහා LUX ඉන්ටර්නැෂනල් සඳහා ඇය අත්සන් කර ඇත්තේ Lever Brothers විසිනි. පෙරේරා ජනප්‍රිය ගායක ගායිකාවන් සහ නළු නිළියන් රැසක් සමඟ යුගල ගීත ගායනා කර ඇත. ජනාධිපති චන්ද්‍රිකා කුමාරතුංග මහත්මියගේ දිවංගත සැමියා වන විජය කුමාරණතුංග ඇය සමඟ ගීත 15කට වඩා ගායනා කර ඇත. පෙරේරා 1989 දී රූකාන්ත ගුණතිලක සමඟ විවාහ වූ අතර ඔවුන්ට දියණියන් තිදෙනෙකු සහ පුතෙකු සිටී. 2000 දී, ඇය සහ ඇගේ සැමියා ජනාධිපති චන්ද්‍රිකා කුමාරතුංගගේ ජනාධිපති ආරක්ෂක අංශය (PSD) විසින් ප්‍රචණ්ඩ ලෙස ප්‍රහාරයට ලක් වූ අතර, ඔවුන් රාජ්‍ය විරෝධී උත්සවවලදී රඟදැක්වුවහොත් මරණ බවට තර්ජනය කළහ. මෙම ප්‍රහාරයෙන් විරෝධයක් මතු වූ ධර්මසිරි බණ්ඩාරනායකට මරණ තර්ජන ද එල්ල විය. මෙම වර්ධනයන් හමුවේ,\n\nප්‍රචණ්ඩත්වයට එරෙහි කලාකරුවන්\n\n (AAV) ආරම්භ කරන ලදී. 2013 දී ප්‍රහාර සම්බන්ධයෙන් ජනාධිපති ආරක්ෂක අංශයේ නිලධාරීන් දස දෙනෙකු අත්අඩංගුවට ගෙන සිර දඬුවම් නියම වූ නමුත් වසරකට පසුව ජනාධිපති මහින්ද රාජපක්ෂ මහතා විසින් සමාව දෙන ලදී."
    },
    {
        "name": "නන්දා මාලිනී",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "සංගීතඥයෙක්\n\nගායකයා\n\nනිර්මාපකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1943 අගෝස්තු 23, අලුත්ගම",
        "Age": "අවුරුදු 78 යි",
        "description": "නන්දා මාලිනී (සිංහල:නන්දා මාලනී) (උපත අගෝස්තු 23, 1943) යනු ශ්‍රී ලාංකික ගායිකාවකි. ඇය ශ්‍රී ලංකාවේ සිටින ජනප්‍රියම සහ ගෞරවනීය ගායිකාවක්. ඇයගේ පද රචනය තෝරා ගැනීමෙන් සැබෑ ජීවිතයේ බොහෝ අවස්ථා සහ ඒවායින් පැන නගින වඩාත් සංකීර්ණ මානව සබඳතා සහ හැඟීම් නිරූපණය කරයි. ශ්‍රී ලාංකේය ශාස්ත්‍රීය සංගීතයේ නව පරිච්ඡේදයක් ආරම්භ කිරීමට ඇය සමත් වූවාය.\n\nඇය හොඳම ගායිකාව ලෙස සරසවිය සම්මාන එකොළහක් සහ ජනාධිපති සම්මාන අටක් දිනාගෙන ඇත\n\nමාලිනී උපත ලැබුවේ ශ්‍රී ලංකාවේ අලුත්ගම ලෙවන්දූව ප්‍රදේශයේ නව දෙනෙකුගෙන් යුත් ගම්බද පවුලක ය. නව යොවුන් වියේදී කොළඹ කොටහේන ප්‍රදේශයට පැමිණි ඇය ශ්‍රී ගුණානන්ද විද්‍යාලයට ඇතුළත් කර එහිදී ටී.එන්.මාග්‍රට් පෙරේරා මහත්මියගේ ගුරුහරුකම් ලැබුවාය. කවි තරඟයකින් ජයග්‍රහණය කිරීමෙන් පසු මාලිනීට ඩබ්ලිව් ඩී අමරදේවයන් විසින් රේඩියෝ සිලෝන් වෙත ආරාධනා කරන ලද අතර කරුණාරත්න අබේසේකරගේ ජනප්‍රිය ළමා මණ්ඩපයේ \"බුදු සාදු\" ගීතය ගායනා කරන ලදී.\n\n පසුව\n\nB. වික්ටර් පෙරේරා යටතේ ඉගෙනුම ලබමින් කීර්තියක් අත්කර ගැනීමෙන් පසුව මාලිනී සිය පුහුණුව දිගටම කරගෙන ගියාය. හේවුඩ් හි වසරක් ඉගෙනුම ලැබූ ඇය 1963දී ඉන්දියාවේ ලක්නව්හි භාත්ඛණ්ඩේ සංගීත ආයතනයට ගියාය. පසුව ඇය 1984දී විශාරද උපාධියක් ලබා ගැනීමට විශ්වවිද්‍යාලයට පැමිණියාය. ලංකාවට පැමිණි පසු මාලිනී අමරදේවයන්ගේ මධුවන්ති ගායන වැඩසටහනට පෙනී සිටියාය. \"සන්නාලියනේ\" සහ \"රන් දහදිය බිංදු බිංදු\" ගීත.\n\nමාලිනීට සාර්ථක නිකුතු මාලාවක් තිබේ. ඇගේ පද රචනය යථාර්ථවාදී ජීවන තත්වයන්, ආදරය, සබඳතා සහ හැඟීම් නිරූපණය කරයි. ගීත\"\n\nපිපුණු මලේ රුව\n\n\",\"\n\nසුදු හාමිනේ\n\n\", හා \"\n\nකඩ මණ්ඩියේ\n\n\"කාන්තාවන්ගේ හදවත් හෙළිදරව් කිරීමට ඇය දරන උත්සාහය සනාථ කරයි. නන්දාගේ සමහර ජනප්‍රිය ගීත, වැනි \"\n\nමඳ නව කරණවා\n\n\", තරුණියකගේ තනිකම පිළිබඳ අත්දැකීම් හාස්‍යජනක හා සංවේදී වාර්තාවක් පෙන්වන්න.\n\n ප්රසංග\n\n1971 දී ශ්‍රවණ ආරාධනා ප්‍රසංගයේදී නන්දා පණ්ඩිත් අමරදේවයන් සමඟ සහයෝගයෙන් කටයුතු කළේය. 1973 දී ඇය සිය ප්‍රථම ඒක පුද්ගල ප්‍රසංග මාලාව ආරම්භ කළ අතර දර්ශන 530 කින් පසු මාලාව 1979 මැයි 22 දින අවසන් විය. 1981 අගෝස්තු මාසයේදී ඇය තවත් ප්‍රසංග මාලාවක් ‘සත්‍යේ ගීතය’ ආරම්භ කළාය. ඇය සංදර්ශන 500 ක් වාදනය කළ අතර 1984 අගෝස්තු මාසයේදී අවසන් විය. ඇය ඇගේ මීළඟ ඒකපුද්ගල සංගීත ප්‍රසංග මාලාව පවන 1987 ජුනි මාසයේදී පැවැත් වූ අතර එය සංදර්ශන 205 ක් සමඟ මාස 18 ක් පැවතුනි. වසර 22කට පසු ඇයගේ නවතම ඒක පුද්ගල සංගීත ප්‍රසංගය ‘ශ්වේත රාත්‍රිය’ නමින් 2010 වසරේ සිරස FM හා එක්ව පැවැත්විණි.\n\n ඩිස්කෝග්‍රැෆි\n\nපේරාද මහා රෙ\n\nපහන් කන්ද\n\nසත්‍යයේ ගීතය\n\nහේමන්තයේදි\n\nතාරුකා එස්, පවන\n\nSindu Hodiya\n\nකිඳුරියකගේ විලපය\n\nමධු බන්දුන්\n\nතාරු\n\nමල්මඩ බිසවු\n\nසිනමා ගීතාවලෝකනය\n\nකිරිමඩු වෙල්\n\nLondonyedi Geyu Gee\n\nයාත්‍රා, හඳහාමි\n\nසංඛ පද්ම\n\nපෙම්බර ලංකා\n\nකුංකුම පොට්ටු\n\nග්‍රැමෆෝන් ගී\n\nඅරලිය ලන්දට\n\nමලට රේණු\n\nනිලම්බරේ\n\nසාරි පොඩිත්තක්\n\nපිරිත් පෑන"
    },
    {
        "name": "රනිල් මල්ලවාරච්චි",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1982 අප්‍රේල් 12, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 39 යි",
        "Residence": "නාරේ වොරන්",
        "Family": "පියා:\n\nමිල්ටන් මල්ලවාරච්චි"
    },
    {
        "name": "දීපාල් සිල්වා",
        "info": "",
        "Was": "නළුවා\n\nගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "චිත්‍රපටය, රූපවාහිනිය, වේදිකාව සහ ගුවන්විදුලිය\n\nසංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1 ජනවාරි 1967",
        "Death": "2017 ජනවාරි 14\n\n(වයස අවුරුදු 50)",
        "description": "දීපාල් සිල්වා\n\n (9 මැයි 1967 - 14 ජනවාරි 2017) ශ්‍රී ලාංකික පසුබිම් ගායකයෙක් සහ නළුවෙකි. 1990 වසරේ පොඩි ළමයා යන වේදිකා නාමයෙන් රංගනය ආරම්භ කළ ඔහු ජීවත් වූයේ කිරිබත්ගොඩ මාකොළ ප්‍රදේශයේය. දීපාල් ක්‍රිකට් රසිකයෙක් වූ අතර ඔවුන් ක්‍රිකට් තරඟ සමඟ ගැටුනහොත් සංදර්ශන භාර ගත්තේ නැත. ඔහු 2017 ජනවාරි 14 වන දින රාගම රෝහලේ (උතුරු කොළඹ ශික්ෂණ රෝහල) වයස අවුරුදු 50 දී මිය ගියේය."
    },
    {
        "name": "ආර්. මුත්තුසාමි",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Was": "සංගීතඥයෙක්\n\nගායකයා\n\nනිර්මාපකයෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1926 ජනවාරි 5",
        "Death": "1988 ජූනි 27\n\n(වයස අවුරුදු 62)",
        "description": "රාමාය මුත්තුසාමි (ජනවාරි 5, 1926 - ජූනි 27, 1988) ශ්‍රී ලාංකේය සංගීත අධ්‍යක්ෂකවරයෙකු සහ ගායකයෙකි. කේ.ගුණරත්නම්ගේ බොහෝ නිර්මාණවල සංගීතය මෙහෙයවූයේ ඔහුය.\n\nමුත්තුසාමි 1926 ජනවාරි 5 වන දින ඉන්දියාවේ තමිල්නාඩු ප්‍රාන්තයේ නාගර්කෝයිල් හි උපත ලැබුවේ මලයාලි සංගීතවේදියෙකු වන රාමායා බග්වතර්ගේ එකම පුත්‍රයා ලෙසය. තරුණ වියේදීම වයලීනයට හුරු වූ මුත්තුසාමි වයස අවුරුදු දහය වන විට වාදනය ප්‍රගුණ කළේය.\n\nමුත්තුසාමි 1941 දී ආර්. නාරායන අයියර්ගේ ගුරුහරුකම් යටතේ ප්‍රථම සිංහල චිත්‍රපටය වන කඩවුනු පොරොන්දුව චිත්‍රපටයේ සහය සංගීත අධ්‍යක්ෂවරයා ලෙස කටයුතු කළේය. පසුව ඔහු ශ්‍රී ලංකාවට ගොස් එහි රාජ්‍ය රේඩියෝ සිලෝන්හි දෙමළ වාද්‍ය වෘන්දයේ (ඔක්තෝබර් 20, 1952) සාමාජිකයෙකු ලෙසත්, පසුව නිෂ්පාදක නායගම් (1953) විසින් ඉදිකරන ලද කඳානේ සුන්දර මුරුගන් චිත්‍රාගාරයේත් රැකියාවක් සොයා ගත්තේය.\n\nසාර්ථක නිෂ්පාදක කේ. ගුණරත්නම් විසින් බඳවා ගන්නා ලද, මුත්තුසාමි 1953 සිංහල චිත්‍රපටය වන ප්‍රේම තරංගය සඳහා ඔහුගේ පළමු ප්‍රධාන සංගීත අධ්‍යක්ෂණය හසුරුවන ලදී. ඔහු චිත්‍රපටයේ සිංහල පසුබිම් ගායකයන් වන ධර්මදාස සහ ලතා වල්පොල ඔවුන්ගේ මංගල දර්ශනයද අධ්‍යක්ෂණය කළේය. ඉන්පසුව ඔහු අහංකාර ස්ත්‍රී (1953), මාතලං (1955), සංදේශය (1961), අල්ලපු ගෙදර සහ චණ්ඩියා (1965) ඇතුළු චිත්‍රපට 225 කට අධික ප්‍රමාණයක අධ්‍යක්ෂණය අධීක්‍ෂණය කළේ වල්පොල, මොහිදීන් බේග්, ජේ.ඒ. මිල්ටන් පෙරේරා, එච්.ආර්. ජෝතිපාල වැනි පසුබිම් ගායක ගායිකාවන් සමඟය. , ඇන්ජලින් ගුණතිලක, සුජාතා අත්තනායක, GSB රාණි පෙරේරා සහ නාරද දිසාසේකර.\n\nඅගමැති ශ්‍රීමත් ජෝන් කොතලාවල විසින් 1956 ජුනි මාසයේදී මුත්තුසාමිට ශ්‍රී ලංකා ගෞරවනීය පුරවැසිභාවය පිරිනමන ලදී. 1958 දී නැවතත් රේඩියෝ සිලෝන් ආයතනයට සම්බන්ධ වූ ඔහු 1981 දක්වා එම සංවිධානයේ සේවය කළේය.\n\nමුත්තුසාමි 1961 ඔක්‌තෝබර් 7 වැනිදා සිංහල ජාතික බී.ඩී.ඊ.නීලියා පෙරේරා සමඟ විවාහ වූ අතර ඔහුට මොහාන්රාජ්, චිත්‍රාංගි, ප්‍රසන්න වදනි සහ කීර්තිකා යන දරුවන් හතර දෙනෙක් සිටියහ. මොහාන්රාජ් තම පියාගේ අඩිපාරේ යමින් සංගීත වෘත්තියක් කරගෙන යනු ඇත. මුත්තුසාමි මිය ගියේ 1988 ජුනි 27 වැනිදාය."
    },
    {
        "name": "වික්ටර් රත්නායක",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1942 පෙබරවාරි 18",
        "Age": "අවුරුදු 79 යි",
        "Profiles": "",
        "description": "වික්ටර් රත්නායක (සිංහල:වික්ටර් රත්නායක; උපත 18 පෙබරවාරි 1942) යනු ජනප්‍රිය ශ්‍රී ලාංකික සංගීතඥයෙකි. සජීවී ඒක පුද්ගල ප්‍රසංගයක් පැවැත්වූ පළමු ශ්‍රී ලාංකේය සංගීතඥයා ඔහු ය; \"SA\" නමින් හැඳින්වෙන ඔහුගේ ප්‍රසංගය ප්‍රථම වරට 1973 දී සිදු කරන ලද අතර එය ක්ෂණික සාර්ථක විය. රත්නායක ඔහුගේ සාර්ථකත්වයට ගෞරවය දක්වන්නේ ඔහුගේ \"රාගධාරී ශාස්ත්‍රීය සංගීතය සමඟ බටහිර සංගීතයට ගැලපෙන සම්මිශ්‍රණය\" සඳහා ය. ඔහුගේ ගීත ආදරය, දේශප්‍රේමය සහ බුදුදහම දක්වා වෙනස් වන විවිධ තේමා සමඟ කටයුතු කරයි.\n\nමාතර ආච්චි ඔහු සංගීතවත් කළ පළමු චිත්‍රපටය වන අතර එහි සුනිල් එදිරිසිංහ ගායනා කළ සඳකඩ පහන ගීතය අදටත් සිංහල ගීත රසිකයන් අතර ඉතා ජනප්‍රියයි. රත්නායක සිරිබෝ අයියා, පොඩි මල්ලි, සරුංගලේ, හුලවාලි, අතුරු මිතුරු වැනි චිත්‍රපට සඳහා ද සංගීතය නිර්මාණය කර ඇත.\n\nජීවිතය සහ වෘත්තිය\n\nළමා අවධිය\n\n රත්නායක පසුගියදා පැවති සංගීත සංදර්ශනයකදි\n\nරත්නායක උපත ලැබුවේ කඩුගන්නාව අසල කුඩා ගමක ය. ඔහුගේ පියා, රත්නායක වෙද මහත්තයා, පෙරේතයෙක් වූ අතර, සිංහල ජන ගී වර්ගයක් වන \"නූර්ති ගී\" ගායනා කළේය. වික්ටර්ට ඔහුගේ පළමු සංගීත භාණ්ඩය ලැබුණේ වයස අවුරුදු නවයේදී ඔහුගේ උපන්දිනය වෙනුවෙන් ඔහුගේ පියා ඔහුට හාර්මෝනියම් පිරිනැමූ අවස්ථාවේදීය. ඔහු M.G.P හි සංගීතඥ සිරිල් පෙරේරා යටතේ ගායනය සහ විවිධ වාදන ශිල්පය හැදෑරීය. නව යොවුන් වියේ මුල්ගම්පොල ආයතනය. 1963 දී ඔහු රාජ්‍ය සංගීත විද්‍යාලයට ඇතුළත් වීමට පටන් ගත් අතර එය දැන් සෞන්දර්ය අධ්‍යයන ආයතනය ලෙස හැඳින්වේ. ඔහු 1964 දී තම ප්‍රථම ගීතය, බුදු රජාණන් වහන්සේට ගීතයක් ලිවීය. එය ශ්‍රී ලංකා ගුවන්විදුලි සංස්ථාව විසින් පවත්වාගෙන යනු ලබන ගුවන් විදුලි නාලිකාවල වාදනය විය.\n\n1966 දී සංගීත උපදේශකයෙකු ලෙස අධ්‍යාපන අමාත්‍යාංශයට බැඳුණු රත්නායක බණ්ඩාරවෙල ඇත්තලපිටිය මහා විද්‍යාලයේ තනතුරකට අනුයුක්ත විය. පසුව ඔහු ගුරුවරයෙකු ලෙස සිටි කාලය දෙස ආපසු හැරී බලන්නේ ඔහුගේ \"සිහිල් සුළං රැල්ලේ\" ගීතයෙන් වන අතර එය ඔහු පාසලට දුම්රියේ ගමන් කරන විට සටහන් කළ අවට පරිසරයේ සුන්දරත්වය විස්තර කළේය. රත්නායකගේ මතකයන් මත ගී පද රචනා කළේ සේන වීරසේකර විසිනි.\n\nසා\n\n1973 වන විට රත්නායක පුහුණු සංගීතඥයකු වූ අතර එක් පුද්ගල ප්‍රසංග නොතිබූ බව සඳහන් කළේය. සමීපතම වූයේ අමරදේව සහ නන්දා මාලිනීගේ ඒකාබද්ධ ප්‍රසංගයක් වූ \"ශ්‍රවනාරාධනා\" ය. ප්‍රේමකීර්ති ද අල්විස්, සුනිල් ආරියරත්න, කේ.ඩී.කේ. ධර්මවර්ධන, ආර්.ආර්. සමරකෝන්, චින්තන ජයසේන, බණ්ඩාර කේ. විජේතුංග යන ඔහුගේ මිතුරන්ගේ පෙරැත්තය මත වික්ටර් එවැනි කටයුත්තක් කිරීමට උත්සාහ කළේය. පළමු සා ප්‍රසංගය 1973 ජූලි 20 වැනිදා හැව්ලොක් ටවුන් ලුම්බිණි රඟහලේදී පැවැත්විණි. එය ශ්‍රී ලාංකේය සංගීතයේ හැරවුම් ලක්ෂයක් ලෙස සැලකේ.\n\n රත්නායක ඔහුගේ \"ස\" ප්‍රසංගයේ රඟපාමින්\n\n\"ස\" යන නම පැමිණියේ ඉන්දියානු සංගීත පරිමාණයේ sa root හෝ tonic note වලින් වන අතර එය චින්තන ජයසේන විසින් යෝජනා කරන ලදී. ශ්‍රී ලංකාවේ කිසිදු නාට්‍යයක්, චිත්‍රපටයක් හෝ කලා කෘතියක් එකල එක් අක්ෂරයක නමක් පමණක් නොතිබූ බව පෙන්වා දුන් ජයසේන එය වාසනාව ගෙන දෙන බව විශ්වාස කළේය.\n\n\"ස\" ඉතා ජනප්‍රිය වූ අතර රත්නායකගේ ආරම්භයෙන් පසු බොහෝ රසිකයින් දිනා ගත්තේය. එක් කාන්තා රසිකයෙක් ලිව්වේ \"ඔබ දන්නවාද මම ඔබේ හිසකෙස් 49ක් නිධානයක් ලෙස සලකන බව?\" රසික ලිපියකින් ඇය රත්නායකගේ සංදර්ශනය කී වතාවක් නරඹා ඇත්ද යන්න ප්‍රකාශ කරයි. විචාරකයින් මෙම සංදර්ශනය විස්තර කළේ \"විශිෂ්ට උමතුවක්\" සහ \"මධුර උමතුවක්\" ලෙසින්, රත්නායකගේ රසිකයන් පෙන්වූ උද්යෝගය නිසා, සමහර විට ඔවුන් ඇතුළු වීමට නොහැකි වූ විට ඔහු ක්‍රීඩා කරන ශ්‍රවණාගාරවලට පහර දෙන ලදී.\n\nරත්නායකගේ ශෛලියට සුනිල් ශාන්ත, ආනන්ද සමරකෝන් සහ සී.ටී. ප්‍රනාන්දු වැනි සංගීතවේදීන්ගේ බලපෑම් ඇති වූ අතර ඔවුන් \"සංගීත ක්ෂේත්‍රයේ පුරෝගාමීන්\" ලෙස සැලකුවේ \"සම්භාව්‍ය රාගධාරි සහ හින්දුස්ථානි සංගීතය\" ඔවුන්ගේ ආරම්භක ලක්ෂ්‍යය ලෙස භාවිතා කිරීම සඳහා ය.\n\nමෑත සිදුවීම්\n\nරත්නායක 2000 ගණන්වල ජනප්‍රිය සංගීතඥයෙක් ලෙස දිගටම; වසර 39 ක් ශ්‍රී ලංකාවේ සහ තවත් බොහෝ රටවල සාර්ථක වූ වික්ටර් අවසානයේ 1450 වැනි ප්‍රසංගයෙන් ආරම්භ වූ ලුම්බිණි රඟහලේදී ප්‍රසංගය අවසන් කළේ 2012 ජූලි 20 වැනිදාය. ඔහුගේ නවතම ඇල්බමය 'නිල් කඳු යාය' 2012 පෙබරවාරි මාසයේදී නිකුත් විය.\n\nඔහු 2014 දෙසැම්බර් 13 වන දින BMICH හි උත්සවයක් සඳහා සජීවීව ඉදිරිපත් විය.\n\nවික්ටර් අඩසියවස\n\n, ඔහුගේ රසිකයින් විසින් සංවිධානය කරන ලදී."
    },
    {
        "name": "රොනී ලීච්",
        "info": "ශ්‍රී ලාංකේය නළුවෙක්, විකට නළුවෙක්, ගායකයෙක්, නිවේදකයෙක් සහ සමාජ ක්‍රියාකාරිකයෙක්",
        "Intro": "ශ්‍රී ලාංකේය නළුවෙක්, විකට නළුවෙක්, ගායකයෙක්, නිවේදකයෙක් සහ සමාජ ක්‍රියාකාරිකයෙක්",
        "A.K.A.": "රොනි ලීච්, තට්ටයා",
        "Was": "නළුවා\n\nගායකයා\n\nවිකට නළුවෙක්",
        "From": "ශ්රී ලංකාව",
        "Type": "චිත්‍රපටය, රූපවාහිනිය, වේදිකාව සහ ගුවන්විදුලිය\n\nහාස්‍යය\n\nසංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1954 ඔක්තෝබර් 19",
        "Death": "2018 ඔක්තෝබර් 1, පර්ත්\n\n(වයස අවුරුදු 63)"
    },
    {
        "name": "දසුන් මධුෂාන්",
        "info": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Intro": "ශ්‍රී ලාංකික සංගීතඥයෙක්",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1996 ඔක්තෝබර් 25",
        "Age": "අවුරුදු 25 යි",
        "Star sign": "වෘශ්චික",
        "description": "දසුන් මධුෂාන්\n\n (උපත 1996 ජනවාරි 2), ශ්‍රී ලාංකික ගායකයෙකි. ඔහු පස්වන වාරයේ පළමු ස්ථානයට පත්විය\n\nසිරස සුපර්ස්ටාර්\n\n, ට සමාන ලංකාවේ ගායන තරඟයක්\n\nඇමරිකානු පිළිමය\n\n. ඔහු ශ්‍රී ලාංකේය රියැලිටි-ටීවී ඉතිහාසයේ ලාබාලතම කෝටිපතියා දසපතියා වන අතර, ඔහු සුපර්ස්ටාර් වාරය 5 - 2013 ජුනි 15 වන දින සිරස ස්ටේන් චිත්‍රාගාරයේ පැවති අවසන් මහා තරගයේ ඊළඟ හඬ ජයග්‍රහණය කළ විට ඔහුට ලැබුණි. ඔහු වේල්ස් කුමර විද්‍යාලයේ ශිෂ්‍යයෙකි. , මොරටුව. ඔහුගේ පියා කරුණාරත්න වික්‍රමසිංහ විශ්‍රාමික පොලිස් නිලධාරියෙකු වන අතර මව රෝහිණී ජයලත් ගෘහණියකි. ඔහු පාසලේ කලා විෂයයන්ගෙන් උසස් පෙළ හැදෑරුවා.ඔහු සිරස සුපර්ස්ටාර් වාරය 6 - හයවන කටහඬ (6 වැනි කටහඬ) වේදිකා නිවේදකයා විය. ඒ වගේම සිරස සුපර්ස්ටාර් සීසන් 6 තේමා ගීතයට ඔහු රංගනයෙන් දායක වුණා. 2017දී ලන්ඩන් හීත්‍රෝ ගුවන්තොටුපළේදී කොකේන් කිලෝග්‍රෑම් 2ක් සමඟ ඔහුව අත්අඩංගුවට ගත්තා.මුල් ජීවිතය සහ පසුබිම දසුන් උපත ලැබුවේ 1996 ඔක්තෝබර් 25 වැනිදා කරුණාරත්න වික්‍රමසිංහ සහ රෝහිණී ජයලත්ට දාව. . ඔහුගේ පියා කරුණාරත්න වික්‍රමසිංහ විශ්‍රාමික පොලිස් නිලධාරියෙකි. ඔහුට එක් වැඩිමහල් සොහොයුරෙක් සිටින අතර ඔහු ගායකයෙක් ද වන අතර ඔහු සිරස සුපර්ස්ටාර් සීසන් 4 රියැලිටි වැඩසටහනෙන් පැමිණ 12 වැනියා ලෙස නිමා විය. සංගීත ජීවිතය දසුන් තරගයට ශිහාන් මිහිරංගගේ කණ්ඩායමට සහභාගී වූ අතර ශිහාන්ගේ කණ්ඩායමේ ප්‍රධාන චරිතයක් විය. \"සිංහයෝ\", \"මැණික් අප්සරාවී\", \"ප්‍රඥා යුවතියන්\", \"ඇස් දෙක පියාන\" වැනි මෙම ගීතවලින් සමහරක් හොඳ ප්‍රතිචාරයක් ලැබුවා. ඔහුගේ පළමු ගීතය වන්නේ සිරස සුපර්ස්ටාර් වාරයේ 3 ජයග්‍රාහකයා සමඟ ගායනා කළ \"ස්වප්නා\" ටෙලිනාට්‍ය තේමා ගීතයයි. ශානිකා මදුමාලි. ඉන්පසු ඔහු සිය පළමු ඒකල ගීත \"අංසතු වී\" සහ \"මගේ ඇස් වලින්\" ආරම්භ කළේය."
    },
    {
        "name": "ඛාරෙස්මා රවිචන්ද්‍රන්",
        "info": "ඉන්දියානු ගායකයා",
        "Intro": "ඉන්දියානු ගායකයා",
        "Is": "ගායකයා",
        "From": "එක්සත් රාජධානිය\n\nශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "8 මැයි 2000, ලන්ඩන්, එක්සත් රාජධානිය",
        "Age": "අවුරුදු 21 යි",
        "Star sign": "ටෝරස්",
        "Instruments:": "හඬ",
        "description": "ඛාරෙස්මා රවිචන්ද්‍රන්\n\n (උපත 2000) යනු බ්‍රිතාන්‍ය පසුබිම් ගායකයෙකි. ඇය වයස අවුරුදු 4 දී බ්‍රිතාන්‍ය හෘද පදනම වෙනුවෙන් ලයන් කිං මියුසිකල් හි \"අපි එකයි\" ගායනය සඳහා ඇගේ පළමු ප්‍රසිද්ධ රංගනය කළාය. ඇය වෘත්තීමය වශයෙන් පුහුණුව ලත් බටහිර ගායන ශිල්පිනියක් වන අතර 2014 දී සිය පසුබිම් ගායන දිවිය ආරම්භ කළාය.\n\nඇය වයස අවුරුදු 14 දී \"Yennai Arindhaal\" දමිළ චිත්‍රපටයෙන් පසුකාලීන ගායිකාවක් ලෙස ආරම්භ වූවාය. ඇය Chick king, Super market chains, Jazz සිනමාහල් වැනි නිෂ්පාදන සඳහා ජිංගල් ද කර ඇත.\n\nමුල් ජීවිතය ඛරෙස්මා රවිචන්ද්‍රන් ඉපදී හැදී වැඩුණේ එක්සත් රාජධානියේ වන අතර එහිදී ඇය සංගීතයට ඇලුම් කළාය. ඇය දැනට ලන්ඩනයේ ත්‍රිත්ව විද්‍යාලය - සංගීතය සඳහා 8 ශ්‍රේණියේ වාචික සහ 5 ශ්‍රේණියේ පියානෝව හදාරනවා. එලිසබෙත් මෝයර් පාසලේ ඉගෙනුම ලබන ඇය ශ්‍රී ලංකාවේ ජීවත් වූ අතර දැන් ලන්ඩන් විශ්වවිද්‍යාලයේ Royal Holloway හි සංගීතය පිළිබඳ BMus උපාධියක් හදාරමින් සිටින්නීය.\n\nවෘත්තීය ජීවිතය 2011 දී ඇය ඉන්දියාවට ගිය අතර එහිදී ඇය හින්දුස්ථානි සහ කර්නාටක සංගීතය ඉගෙනීමට පටන් ගත්තාය. ඇය චිකිං, ඇල්සා මාල්, ඉම්පල්ස් පර්ෆියුම් වැනි දැන්වීම් සඳහා ජිංගල් සඳහා ආරම්භ කළාය.\n\nඇය ඉන්දියානු පසුබිම් ගායිකාවක් ලෙස සිය වෘත්තීය ජීවිතය ආරම්භ කළාය\n\nගෞතම් වාසුදේව් මෙනන්\n\n \"Yennai Arindhaal\" චිත්‍රපටිය රචනා කළේ \"Yen Ennai\" ගීතය සමඟින්\n\nහැරිස් ජයරාජ්\n\n. Hiphop Tamizha Aadhi සහ Jeeva විසින් රචනා කරන ලද \"Thani Oruvan\" චිත්‍රපටයේ \"Kadhal Cricketu\" ගීතයෙන් ඇය ප්‍රසිද්ධියට පත් වූවාය. Kadhal Cricketu ඉන්දියානු iTunes ප්‍රස්ථාරයේ සහ චෙන්නායි හි බොහෝ ගුවන්විදුලි මධ්‍යස්ථාන සහ ලොව පුරා දෙමළ කතා කරන නාලිකා සති කිහිපයක් පුරා ප්‍රමුඛයා විය. අරන්මනයි 2 හි ඇයගේ මීළඟ ගීතය \"පාටි විත් ද පෙයි\"\n\nසුන්දර් සී\n\n, රචනා කළේ Hiphop Thamizha විසිනි. මෙම ගීතය සති කිහිපයක් සඳහා Apple iTunes සහ ගුවන් විදුලි ප්‍රස්ථාරවල ද ඉහළින්ම පැවතුනි.\n\nඑතැන් සිට ඇය සඳහා නම් කරන ලදී\n\n63 වැනි ෆිල්ම්ෆෙයාර් - හොඳම ගායිකාව සම්මානය\n\n, SIIMA 2016 හොඳම පසුබිම් ගායකයා සහ එඩිසන් සම්මාන 2016 සඳහා.\n\nKharesma නේපාල රූපවාහිනී වැඩසටහනක් සඳහා තේමා ගීතය ගායනා කර ඇත \"PS Zindagi(\n\n1\n\n)\"\n\nඩිස්කෝග්‍රැෆි"
    },
    {
        "name": "ශෂිකා නිසංසලා",
        "info": "ශ්‍රී ලාංකේය සංගීතඥයා (උ. 1982)",
        "Intro": "ශ්‍රී ලාංකේය සංගීතඥයා (උ. 1982)",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1982 සැප්තැම්බර් 28, ඇහැලියගොඩ, ශ්‍රී ලංකාව",
        "Age": "අවුරුදු 39 යි",
        "Star sign": "තුලා රාශිය",
        "Instruments:": "හඬ",
        "description": "ශෂිකා නිසංසලා ජයසුමන\n\n පොදුවේ හඳුන්වනු ලබන්නේ ශෂිකා නිසංසලා (සිංහල:\n\nශශිකා නිසංසලා\n\n; 28 සැප්තැම්බර් 1982) යනු සම්මානලාභී ශ්‍රී ලාංකේය ගීත ගායිකාවකි."
    },
    {
        "name": "ඇන්ජලින් ගුණතිලක",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1939 දෙසැම්බර් 23, මාතර, ශ්‍රී ලංකාව",
        "Death": "2019 මාර්තු 29\n\n(වයස අවුරුදු 79)",
        "Star sign": "මකර ලග්නය",
        "description": "Angelina Rachel de Lanerolle\n\n (සිංහල:\n\nඇන්ජලීන් ගුණතිලක\n\n; 23 දෙසැම්බර් 1939 - 29 මාර්තු 2019), ලෙස ජනප්‍රියයි\n\nඇන්ජලින් ගුණතිලක\n\n හෝ\n\nඅංජලින් ගුණතිලක\n\n, ශ්‍රී ලාංකේය ගායකයෙක් වූ අතර, මූලික වශයෙන් සිංහල චිත්‍රපට කර්මාන්තයේ පසුබිම් ගායකයෙකු ලෙස කටයුතු කළේය. ලෙස සැලකේ\n\nසිංහල සිනමාවේ රිදී සීනුව\n\n, ගුණතිලක දශක හයකට ආසන්න කාලයක් පුරා දිවෙන සංගීත දිවිය තුළ පසුධාවන ගීත 5000 කට අධික ප්‍රමාණයක වැඩ කළේය. ඇය ශ්‍රී ලංකා ගුවන් විදුලි සංස්ථාවෙන් උසස් ශ්‍රේණියේ ගායිකාවක්.\n\nඇය කොළඹ ජාතික රෝහලේ ප්‍රතිකාර ලබමින් සිටියදී වයස අවුරුදු 79 දී මිය ගියාය.\n\nපෞද්ගලික ජීවිතය ඇන්ජලින් ගුණතිලක සහෝදරියන් දස දෙනෙකුගෙන් හත්වැන්නා ලෙස 1939 දෙසැම්බර් 23 දින මාතර දිස්ත්‍රික්කයේ උපත ලැබුවාය. ඇය ප්‍රාථමික අධ්‍යාපනය සඳහා මාතර ශාන්ත මරියා කන්‍යාරාමයට ගියාය. ඇගේ පියා දුම්රිය දෙපාර්තමේන්තුවේ සේවය කළේය. ඇගේ පියාගේ හාම්පුතුන් ඔහුට ස්ථාන මාරුවක් ලබා දීම නිසා පවුල කොළඹට පදිංචියට ගියේ වයස අවුරුදු 8 දීය. ඉන්පසු ඇය ද්විතීයික අධ්‍යාපනය සඳහා කෝට්ටේ ශාන්ත තෝමස් විද්‍යාලයට ඇතුළත් වූවාය.\n\nඇය 1966 මාර්තු 29 වන දින ලෙස්ලි ගුණතිලක සමඟ විවාහ වූවාය. මෙම යුවළට දියණියන් දෙදෙනෙකි. ඇගේ මුණුපුරා වන ඉමාල් ජූඩ් මල්වත්තගේ සංගීත වෘත්තියක් කරගෙන ගියේය.\n\nගායන දිවිය වයස අවුරුදු 8 දී රේඩියෝ සිලෝන් ආධුනික වැඩසටහනට සම්බන්ධ වූ ගුණතිලක සංගීත කුසලතා සංදර්ශනයකින් දෙවන ස්ථානය ලබා ගත්තේය. ඉන්පසු ඇය මාස්ට්‍රෝ යටතේ සංගීතය හැදෑරුවාය\n\nසුනිල් සාන්ත\n\n. වයස අවුරුදු 13 දී ඇය සඳහා තෝරා ගන්නා ලදී\n\nලමාපිටිය\n\n ප්‍රවීණ ගීත රචකයෙකු සහ විකාශකයෙකු විසින් මෙහෙයවන ලද වැඩසටහන\n\nකරුණාරත්න අබේසේකර\n\n.\n\nගුණතිලක සිය ගායන දිවිය ආරම්භ කළේ ඒක පුද්ගල ගීතයෙනි\n\nආදර අම්බරේ\n\n. ඇය ළමාපිටිය වැඩසටහනේ රඟපාන අතරවාරයේ නම් වූ ගායන තරගයකට සහභාගි වූවාය\n\nතරු තේනුම\n\n Sri Murugan New Art Films විසින් සංවිධානය කරන ලදී. ඇය තරඟයෙන් ජයග්‍රහණය කළ අතර පළමු පසුබිම් ගායනය සඳහා තේරී පත් විය. පසුපෙළ ගායිකාවක් ලෙස ඇයගේ මංගල ආරම්භය සිදුවූයේ චිත්‍රපටියෙනි\n\nසොහොයුරෝ\n\n 1958 තිරගත විය. එම වසරේම ඇය සිය වෘත්තීය දිවියේ පළමු යුගලය සුනිල් ආර්ටිග්ලා සමඟ ගායනා කළාය. පසුව ඇය මොරිස් දහනායක, ආර්. සිවානන්ද සහ වී. වර්දරාජා සමඟ යුගල සඳහා සහයෝගයෙන් කටයුතු කළාය. ගායනය හැරුණු විට ඇය පණිභාරත විශාරදයා යටතේ නර්තනය හැදෑරුවාය.\n\nඇය කෙටි කාලයක් තුළ ප්‍රසිද්ධියට පත් වූ අතර එහිදී ඇයට පී.එල්.ඒ සෝමපාල හමුවිය. ඔහු ගුණතිලකට HMV ලේබලය යටතේ ගීත පටිගත කිරීමට ආරාධනා කළේය. ඇය සමඟ ගීත පටිගත කළාය\n\nචිත්‍රාල් සෝමපාල\n\n හා\n\nමොහිදීන් බේග්\n\n 2500 බුද්ධ ජයන්ති සමරුව වෙනුවෙන්. බෞද්ධ ගීත සමඟින්, ඇය එක්ව ගායනා කළ බොහෝ නත්තල් ගීත සඳහා වැඩ කළාය\n\nසී.ටී. ප්‍රනාන්දු\n\n බලපෑම යටතේ\n\nමර්සලින් ජයකොඩි\n\n. ඇය වොලී බැස්ටියන් සමඟ යුගල වාදනය කිරීමට පටන් ගත් ශ්‍රී ලංකා සංගීත ක්ෂේත්‍රයේ ජනප්‍රියත්වය දිගටම ලබා ගත්තාය. ඇය චිත්‍රපටිය සඳහා විරිඳු ගීත ද ගායනා කළාය\n\nදෙයියන්ගේ අනුපාතය\n\n.\n\nඇතුළු නිළියන් රැසක් වෙනුවෙන් 1958 සිට 1999 දක්වා ගුණතිලක ගායිකාවක් ලෙස ඉදිරිපත් විය.\n\nඅනෝජා වීරසිංහ\n\n,\n\nමාලනී ෆොන්සේකා\n\n,\n\nසබීතා පෙරේරා\n\n,\n\nසංගීතා වීරරත්න\n\n,\n\nදිල්හානි ඒකනායක\n\n සහ තවත් බොහෝ. මෙම සුවිශාල ගායන ප්‍රසංගය හේතුවෙන් ඇය සිංහල සිනමාවේ ගායිකාවකගේ වැඩිම පසුබිම් ගායන ප්‍රසංග සංඛ්‍යාවක වාර්තාවට හිමිකම් කියයි. සමඟ යුගලයක් සඳහා ගුණතිලක පුළුල් ජනප්‍රියත්වයක් ලබා ගත්තේය\n\nඑච්.ආර්.ජෝතිපාල\n\n. ඔවුන් දෙදෙනා බොහෝ ප්‍රභේද හරහා චිත්‍රපට විශාල සංඛ්‍යාවකට දායක වූහ. 2009 අගෝස්තු 9 වන දින ඇය සංගීත සංදර්ශනයක් ඉදිරිපත් කළාය\n\nපිරිමි ළමයින් සමඟ ඇන්ජලින් රොක්\n\n 6.30ට බණ්ඩාරනායක සම්මන්ත්‍රණ ශාලාවේදී පැවැත්වේ.\n\n2014 අගෝස්තු 23 දින ඇය බණ්ඩාරනායක අනුස්මරණ ජාත්‍යන්තර සම්මන්ත්‍රණ ශාලාවේදී සජීවී ප්‍රසංගයක් ඉදිරිපත් කළාය.\n\nරෝගාතුර වීම සහ මරණය 2019 මාර්තු 29 වැනි දින කොළඹ ජාතික රෝහලේ ප්‍රතිකාර ලබමින් සිටියදී ගුණතිලක මිය ගියේය. ඇයගේ අවසන් කටයුතු අප්‍රේල් 2 වැනි අඟහරුවාදා සවස 4ට බොරැල්ල පොදු සුසාන භූමියේදී පැවැත්විණි.\n\nඇන්ජලින් ගුණතිලක දශක හයක් පුරාවට සිංහල චිත්‍රපට 200කට අධික ප්‍රමාණයක සේවය කර ඇත."
    },
    {
        "name": "ලතා වල්පොල",
        "info": "පසුබිම් ගායකයා",
        "Intro": "පසුබිම් ගායකයා",
        "Is": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1934 නොවැම්බර් 11 වැල්ලවත්ත-ගල්කිස්ස මැතිවරණ කොට්ඨාසය",
        "Age": "අවුරුදු 87 යි",
        "Star sign": "වෘශ්චික",
        "Family": "කලත්රයා:\n\nධර්මදාස වල්පොල",
        "Instruments:": "හඬ",
        "description": "දේශමාන්‍ය මාතරගේ රීටා ජෙනිවිව් ප්‍රනාන්දු, ඇයගේ වේදිකා නාමයෙන් වඩාත් ප්‍රසිද්ධයි\n\nලතා වල්පොල\n\n (සිංහල:\n\nලතා වල්පොල\n\n), ශ්‍රී ලංකාවේ ප්‍රකට ගායන ශිල්පියෙකි. පල්ලියේ ගායක ගායිකාවක ලෙස වල්පොල වෘත්තියක් ආරම්භ කළ අතර එය ඇගේ කාලයේ ශ්‍රී ලංකාවේ ප්‍රමුඛතම ගායිකාවක් වීමට හේතු විය. අද ඇගේ රසික රසිකාවියන් ඇයව හඳුන්වන්නේ \"ශ්‍රී ලංකාවේ නයිටිංගේල්\" යනුවෙනි.\n\nපෞද්ගලික ජීවිතය වල්පොල 1934 නොවැම්බර් 11 වන දින කොළඹ ගල්කිස්සේදී ජෝසප් ප්‍රනාන්දු සහ එලිසබෙත් මියුරියෙල්ට දාව උපත ලැබීය. ඇය දරුවන් පස් දෙනාගෙන් කෙනෙකි. ගුරුවරියක් වූ ඇගේ මව තම දියණිය ගායන ශිල්පිනියක් වීමට දිරිමත් කළාය.\n\n වල්පොල දෙහිවල ගල්කිස්ස ශාන්ත අන්තෝනි විද්‍යාලයෙන් ප්‍රාථමික අධ්‍යාපනය ලැබූ අතර එහිදී ඇය පල්ලියේ ගායන කණ්ඩායමට නායකත්වය දුන්නාය.\n\nඇය විවාහ වුණා\n\nධර්මදාස වල්පොල\n\n 1959 දී පසුව ලතා වල්පොල ලෙසින් ප්‍රකට විය. කොල්ලුපිටිය සිරිකොත ප්‍රදේශයේ උත්සවශ්‍රීයෙන් මංගල උත්සවයක් පැවැත්වුණේ ආරාධිතයන් සහ කලාකරුවන් විශාල පිරිසකගේ සහභාගීත්වයෙන්. සිරිකොතට පිටතින් රැස්ව සිටි අතිවිශාල ජනකාය පාලනය කිරීමට ප්‍රාදේශීය පොලිසියට අමතර පිරිස් යෙදවීමට සිදු විය. මෙම යුවළට පුතුන් තිදෙනෙකු සහ දියණියක සිටී. 1960 ගණන්වල සහ 1970 ගණන්වල මුල් භාගයේදී මෙම යුවළ ඉතා ජනප්රිය විය.\n\nවෘත්තීය ජීවිතය ලතා වල්පොල 1946 දී රේඩියෝ සිලෝන් ගායන කණ්ඩායමේ සාමාජිකාවක් ලෙස රේඩියෝ සිලෝන් විසින් මෙරටට හඳුන්වා දෙන විට යන්තම් වයස අවුරුදු 12 දී ය. සී.ඒ. පවුලේ හිතවතෙක් සහ ගුවන්විදුලිය, නාට්‍යකරුවෙක් වන ෆොන්සේකා ඇයව රේඩියෝ සිලෝන් වෙත රැගෙන ආවේ ඔහුගේ සරල ගී වැඩසටහනේ රඟ දැක්වීමට ඔහුගේ පුත් සී.ඩී. ෆොන්සේකා.\n\n1947 දී වල්පොල ඇයගේ ප්‍රථම ඒක පුද්ගල ගීතය වන \"කඳුළු දෙනෙත් වෙහෙනා\" ගායනා කරන ලද අතර එය සරත් විමලවීරගේ පද රචනයකින් සහ රේඩියෝ සිලෝන් හි නේවාසික වයලීන වාදක වින්සන්ට් ද අල්විස් විසින් රචනා කරන ලදී. පසුව ඇය මෙහෙයවීම යටතේ ගායනා කිරීමට පටන් ගත්තාය\n\nමොහොමඩ් ගවුස්\n\n, P.L.A.Somapala සහ B.S.Perera, මෙම ප්‍රසිද්ධ සංගීතඥයන් සමඟ ඇගේ උච්ච ස්වරය ඔවුන්ගේ සංගීත නිර්මාණවලට ඇතුළත් කර ඇත. 1950 වන විට ඇය මෙරට ප්‍රසිද්ධ ගායිකාවක් වූ අතර, මුලින් ගායනා කළේ චිත්‍රා සෝමපාල විසින් ගායනා කරන ලද \"සුකෝමල බඳ ලේලව\", \"දුන්හිඳ හෙලේනා\" සහ \"දියළුම හෙලේනා\" යන ගීත ආවරණය කරමින්. වල්පොල Columbia සහ HMV වාර්තා ලේබල දෙකම සඳහා පටිගත කර ඇත. සමග ගායනා කරන ලද \"මල්බර හිමිදිරියේ පිපුනේ ඇසල අරලිය මල\" ගීතය\n\nසී.ටී. ප්‍රනාන්දු\n\n, ඇයගේ ජනප්‍රියම ගීත වලින් එකකි.\n\nසිංහල සිනමාවට දායක වීම 1952 දී ඇය 1953 දී තිරගත වූ \"එදා රෑ\" චිත්‍රපටයේ පසුබිම් ගායිකාවක් ලෙස සිංහල සිනමාවට සිය ප්‍රථම දායකත්වය ලබා දුන්නේ එම වසරේම තවත් චිත්‍රපට තුනක වැඩ කරමින්. සමඟින් චිත්‍රපට තුනක් සඳහා පසුබිම් ගායනයට පිවිසීමට ඇයට හැකි විය\n\nධර්මදාස වල්පොල\n\n එම වසරේම. 1958 වන විට වල්පොල චිත්‍රපට 22 කට දායක වූ අතර, ඇයගේ වෘත්තීය ජීවිතය තුළ චිත්‍රපට 600 කට ආසන්න සංඛ්‍යාවකට ගීත ඛණ්ඩ ලබා දී ඇත.\n\nසම්මාන. වල්පොල 2005 වසරේ කලා සූරි සම්මානයෙන් එවකට ශ්‍රී ලංකා රජය විසින් ගෞරවයට පාත්‍ර වූවාය. 2017 දී ඇයට ශ්‍රී ලංකා රජය විසින් 2 වැනි ඉහළම සිවිල් සම්මානය වන \"දේශමාන්‍යා\" පිරිනමන ලදී. සිංහල සිනමාවට සම්බන්ධ කීර්තිමත් පුද්ගලයන්ට පිරිනමන ගෞරවනීයම සම්මානය වන සරසවිය සම්මානය ඇය සිව් වතාවක් දිනාගෙන ඇත. ඇය ද ජයග්රහණය කර ඇත:\n\nසටහන්.යොමු."
    },
    {
        "name": "රමේෂ් වීරතුංග",
        "info": "Sri-lankischer මියුසිකර්",
        "Intro": "Sri-lankischer මියුසිකර්",
        "Was": "ගීත රචකයෙක්\n\nගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1951, කොළඹ, කොළඹ දිස්ත්‍රික්කය, බස්නාහිර පළාත, ශ්‍රී ලංකාව",
        "Death": "2017 ජූනි 18\n\n(වයස අවුරුදු 66)",
        "Instruments:": "හඬ",
        "Profiles": "",
        "description": "රමේෂ් බී වීරතුංග\n\n (* 30 නොවැම්බර් 1951 කොළඹ දී; † 18. ජුනි 2017) war ein sri-lankischer Sänger und ගීත රචක, Musikproduzent, -komponist und Sounddesigner.\n\nවීරතුංග wanderte im Alter von 20 Jahren nach Berlin aus, wo er jahrelang als Sänger auftrat. Er mischte seinen indischen Stil mit westlichen Elementen aus Jazz und später aus dem Pop-Genre. Später gründete er die Band Feel Wheel, mit der er das Album\n\nඅපේ පිස්සුවේ සුන්දරත්වය\n\n aufnahm, das er zusammen mit\n\nUdo Arndt\n\n produzierte. Einige von Weeratungas Liedern wurden später von Stars wie\n\nසාලි ඕල්ඩ්ෆීල්ඩ්\n\n,\n\nජස්ටින් හේවර්ඩ්\n\n,\n\nවෙරෝනිකා ෆිෂර්\n\n und\n\nUlla Meinecke\n\n gecovert.\n\n1990 nahm Weeratunga sein erstes Soloalbum namens\n\nපුළුල් විවෘත කරන්න\n\n (Polydor) auf. Im Jahre 1993 ආරම්භය er eine Zusammenarbeit mit dem dem New Yorker Schlagzeuger Kenny Martin unter dem Namen Electric Rama, unter dem beide das Album\n\nගැඹුරට යන්න\n\n (Traumton Records, 1996) veröffentlichten. Sein nächstes Projekt\n\nආගන්තුකයා\n\n (Laika) zusammen mit Sangeeta Bandyopadhyay und Mr Hempala Perara erreichte die Top 20 der World Charts. Seine letzte Veröffentlichung ist das Album\n\nමිනිසුන් දෙදෙනෙක්\n\n (Bluebird Café Berlin Records, 2015)"
    },
    {
        "name": "අයිවර් ඩෙනිස්",
        "info": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Intro": "ශ්‍රී ලාංකික ගායකයෙක්",
        "Was": "ගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "සංගීතය",
        "Gender": "පිරිමි",
        "Birth": "1932 මැයි 28, සීදූව, ශ්‍රී ලංකාව",
        "Death": "18 ජූනි 2018\n\n(වයස අවුරුදු 86)",
        "Star sign": "මිථුන ලග්නය",
        "description": "කලා කීර්ති\n\nපැස්කුවෙල් ගේ දොන් ඔගස්ටින් අයිවර් ඩෙනිස්\n\n (සිංහල:\n\nඊවෝර් ඩෙනිස්\n\n) (28 මැයි 1932 - 18 ජූනි 2018) යනු ප්‍රවීණ නිරූපකයේ හිටපු ශිෂ්‍යයා ලෙසද හැඳින්වූ ජනප්‍රිය ශ්‍රී ලාංකික ප්‍රවීණ පසුබිම් ගායකයෙකි.\n\nසුනිල් සාන්ත\n\n. ජනප්‍රිය සංගීත ian යෙකු සමඟ දිගුකාලීන සම්බන්ධතාවයක් ඇති කර ගැනීම සඳහා ඔහු ප්‍රසිද්ධ විය\n\nසුනිල් සාන්ත\n\n, ඔහු සිංහල සංගීතයේ ප්‍රතිමූර්තියක් සහ පුරෝගාමියෙකු ලෙස ප්‍රකටය. ඔහු ශ්‍රී ලංකාවේ පළමු සිංහල චිත්‍රපටය ඇතුළු බොහෝ සිංහල චිත්‍රපටවල පසුබිම් ගායකයෙකු ලෙස කටයුතු කර ඇත\n\nරැකව\n\n. ඔහු 2018 ජුනි 18 වැනි දින සීදූව පිහිටි ඔහුගේ නිවසේදී මිය යන විට 86 වැනි වියේ පසුවිය.\n\nවෘත්තීය ජීවිතය ඔහු ගායන ශිල්පියෙකු ලෙස සිය වෘත්තීය ජීවිතය කරගෙන ගිය අතර 1952 දී රේඩියෝ සිලෝන්හි ගීත තරඟයකට සහභාගී විය. ඔහු ප්‍රවීණ සංගීතවේදී සුනිල් සාන්තගේ සුප්‍රසිද්ධ ගීතය ගායනා කළේය.\n\nWaren Heen Sare Redhee Walave\n\n තරඟය අතරතුර ඔහුගේ රංගනය සුනිල් සාන්ත විසින් ඉක්මනින් හඳුනා ගන්නා ලදී, ඔහු දෙවැන්න සඳහා සංගීතය ඉගැන්වීමට ඉදිරිපත් විය. අයිවර් සුනිල් සාන්ත විසින් තනිවම ගීතයක් ගායනා කිරීමට ලුහුබැඳ ගිය අතර අයිවර් ඔහුගේ පළමු ගීතය පටිගත කළේය.\n\nකුරුලු පාරාදීසයේ\n\n, එය සදාහරිත පහරක් බවට පත් විය. ඔහු ජපානය, ඉන්දුනීසියාව, ඉතාලිය, එංගලන්තය සහ නවසීලන්තය ඇතුළු විවිධ රටවල ප්‍රසංග රැසකට ද ඉදිරිපත් වී ඇත.\n\nශ්‍රී ලංකාවේ ප්‍රථම සිංහල චිත්‍රපටයේ අහම්බෙන් පැමිණි ගායකයෙකු ලෙසින් ඔහු සිනමාවට පිවිසියේය\n\nරැකව\n\n එය 1955 දී නිකුත් කරන ලදී. ඔහු 1958 දී රේඩියෝ සිලෝන් හි A ශ්‍රේණියේ ගායකයෙකු ලෙස උසස් කරන ලදී. ඔහු චිත්‍රපටය වෙනුවෙන් හොඳම පසුබිම් ගායකයාට හිමි ජනාධිපති සම්මානය දිනා ගැනීම විශේෂත්වයකි.\n\nහිමා කතර\n\n. 2017 ශ්‍රී ලාංකීය ජාතික ගෞරව උළෙලේදී ඔහු සිංහල සිනමාවට කළ විශිෂ්ට දායකත්වය වෙනුවෙන් ගෞරවනීය කලා කීර්ති සම්මානයෙන් පිදුම් ලැබීය.\n\nඩිස්කෝග්‍රැෆි"
    },
    {
        "name": "G. S. B. රාණි",
        "info": "ශ්‍රී ලාංකික නිළියක්",
        "Intro": "ශ්‍රී ලාංකික නිළියක්",
        "Was": "නළුවා\n\nචිත්‍රපට නළුවෙක්\n\nගායකයා",
        "From": "ශ්රී ලංකාව",
        "Type": "චිත්‍රපටය, රූපවාහිනිය, වේදිකාව සහ ගුවන්විදුලිය\n\nසංගීතය",
        "Gender": "ගැහැණු",
        "Birth": "1930 අගෝස්තු 20",
        "Death": "2004 සැප්තැම්බර් 7\n\n(වයස අවුරුදු 74)",
        "Star sign": "ලියෝ",
        "description": "කලා සූරි\n\nGnai Seenar Bangsajayah\n\n, (උපත 1934 ඔක්තෝබර් 18 - 2004 සැප්තැම්බර් 7 වැනි දින මිය ගියේය\n\nජී. ඇස්. බී. රාණි\n\n), ලෙස ජනප්‍රියයි\n\nG. S. B. රාණි\n\n, ශ්‍රී ලාංකේය සිනමාවේ නිළියක්, රංග ශාලාවක් මෙන්ම ගීත ගායිකාවක්, දේශපාලනඥයෙක් සහ මාධ්‍යවේදිනියක් ද විය. ඇය දශක පහකට වැඩි කාලයක් පුරා දිවෙන වෘත්තීය ජීවිතයක් සහිත මුල් ශ්‍රී ලාංකේය සිනමා කර්මාන්තයේ ජනප්‍රියම පසුබිම් ගායිකාවක් විය.\n\nපෞද්ගලික ජීවිතය Gnai Seenar 1930 අගෝස්තු 20 වන දින බදුල්ල ගුරුවත්ත ගම්මානයේ මැලේ පවුලක එකම දියණිය ලෙස උපත ලැබීය. ඇයගේ පියා නුසම්මින් බංසාජය පොලිස් සැරයන්වරයෙකු වූ අතර පසුව උප පොලිස් පරීක්ෂකවරයා බවට පත් විය. ඇගේ මව චින්තා නෝනාය. ඇය අධ්‍යාපනය සම්පූර්ණ කළේ කොළඹ ක්ලිෆ්ටන් බාලිකා විද්‍යාලයෙන්.\n\nඇය රණවක ආරච්චිගේ ඇන්ටන් පෙරේරා සමඟ විවාහ වූ අතර 1953 පෙබරවාරි 17 වන දින විවාහ උත්සවය පැවැත්විණි. ඇන්ටන් ශ්‍රී ලංකා වානේ සංස්ථාවේ සේවකයෙකි. මෙම යුවළට දරුවන් තිදෙනෙක් සිටියහ - රංජිත්, චන්දන සහ උදේනි. ඇය මැලේ ජාතිකයෙක් වූවත් සැමියා සිංහල කතෝලිකයෙක් වූවත් පවුල බෞද්ධ ආගමට හැරුණා.\n\n2004 සැප්තැම්බර් 7 වන දින සවස 3.30 ට පමණ කෙටි අසනීපයකින් පසුව ඇය මිය ගියාය.\n\nදේශපාලනය ඇයගේ මස්සිනා වූ ආර්.එස්. පෙරේරා දේශපාලනඥයෙකි. ඇය ශ්‍රී ලංකා නිදහස් පක්ෂයේ (ශ්‍රීලනිප) ආධාරකාරියක වූ අතර පක්ෂයේ කාන්තා අංශයේ සමස්ත ලංකා සංවිධායකවරියක වූවාය. ඇය 1967 මහ නගර සභා මැතිවරණයට මිලාගිරියෙන් තරග කර ඡන්ද 448 කින් පරාජයට පත් වූවාය. කෙසේ වෙතත්, ඇය වසර 45ක් දේශපාලනයේ නිරත වූ අතර එහිදී ඇයට රේඩියෝ සිලෝන් වෘත්තීය ජීවිතයද අහිමි විය. මහ මැතිවරණයේදී ඇය ශ්‍රීලනිපයේ ජාතික ලැයිස්තුවට ඇතුළත් වූ අතර එම අවස්ථාව යාන්තමින් මඟ හැරුණා.\n\n2004 සැප්තැම්බර් 4 වැනිදා ගාල්ල සමනල පාලමේ පැවැති ශ්‍රී ලංකා නිදහස් පක්ෂයේ 53 වැනි සංවත්සරයට ඇය සහභාගි වූවාය. මෙය ඇයගේ මරණයට පෙර මාධ්‍යයට පෙනී සිටි අවසන් අවස්ථාවයි.\n\n1944 දී, රාණි වයස අවුරුදු 14 දී පොරෝලිස් ප්‍රනාන්දු සමාගමේ විගණනයක් සඳහා ඇගේ ඥාති සොහොයුරා වන අහමඩ් සමඟ කොලොම්බියා රෙකෝඩ්ස් චිත්‍රාගාරයට ගියාය. ඇය යූ.ඩී. පෙරේරා සහ\n\nමොහොමඩ් ගවුස්\n\n කොලොම්බියා තැටි දෙකක් ඇතුළුව කොලොම්බියා ලේබලය යටතේ ගීත පටිගත කිරීමට අවස්ථාව ලැබුණි:\n\nසමගි බාලේ පාමේ\n\n, හා\n\nසිරි සර භවනේ\n\n, සමඟ යුගලයක්\n\nමොහිදීන් බේග්\n\n. කෙසේ වෙතත්, ඇගේ පියා සංගීත ක්ෂේත්‍රයට ඇගේම නම භාවිතා කිරීම ප්‍රතික්ෂේප කළ අතර, එතැන් සිට ඇය ඇගේ නම G. S. B. Rani ලෙස කෙටි කළාය. ඇය ඊළඟ වසරවලදී සෑම සිංහල චිත්‍රපටයක් සඳහාම පාහේ ගායනා කළ අතර මොහිදීන් බේග් සමඟ යුගල ගීත ගායනා කළාය.\n\nධර්මදාස වල්පොල\n\n,\n\nඑච්.ආර්. ජෝතිපාල\n\n, සිසිර සේනාරත්න, එන්.කරුණාරත්න සහ ඩබ්ලිව්.ප්‍රේමතිලක. ඇයගේ වඩාත් ජනප්‍රිය ජනප්‍රිය සමහරක් ඇතුළත් වේ\n\nපරමා රමණි අපේ ආලේ\n\n හා\n\nSengi Sengi Atha Suraya Dilenna\n\n. සිංහල ගීතවලට අමතරව හින්දි සහ උර්දු ගීතවලටද ඇය දක්ෂ වූවාය.\n\n1946 දී ඇයට චිත්‍රපටය සඳහා පසුබිම් ගායනය පටිගත කිරීමට ආරාධනා කරන ලදී\n\nඅශෝකමාලා\n\n. කෙසේ වෙතත්, එම කාලය තුළ ඇයට තම පියා සහ මව අහිමි විය. එබැවින් පටිගත කිරීම සඳහා ඉන්දියාව ගෙන යාමට ඇයට නොහැකි වූ අතර ඉන්දීය පසුබිම් ගායිකා භාග්‍යරතී ගීත ගායනා කළාය. මවගේ අභාවයෙන් පසු රාණිව P.L.A යටතේ විභාගයක් සඳහා රේඩියෝ සිලෝන් වෙත ගෙන එන ලදී. සෝමපාල.\n\nමේ අතර, ඇය ඉන්දියානු නිර්මාපකයෙකු යටතේ රේඩියෝ සිලෝන් හි 'ඒ ශ්‍රේණියේ' ශිල්පිනියක බවට පත්විය\n\nශ්‍රීක්‍රිෂ්ණ නාරායන් රතන්ජන්කර්\n\n. ඇය 1970 සිට 1977 දක්වා රේඩියෝ සිලෝන් හි සංගීත වැඩසටහන් නිෂ්පාදකවරියක් ලෙස සේවය කළ අතර \"ජන ප්‍රසංගනී\", \"ගීතා තරංගනී\" සහ \"ප්‍රබුද්ධ ගී\" වැනි ජනප්‍රිය සංගීත වැඩසටහන් මෙහෙයවීය. ඇයගේ සත් වසරක කාලය තුළ ඇය ඇතුළු ජනප්‍රිය ගායක ගායිකාවන් රැසක් සිංහල සංගීත ක්ෂේත්‍රයට හඳුන්වා දුන්නාය\n\nනන්දා මාලිනී\n\n, එච්.ආර්. ජෝතිපාල,\n\nඑඩ්වඩ් ජයකොඩි\n\n,\n\nවික්ටර් රත්නායක\n\n,\n\nටී.එම්. ජයරත්න\n\n,\n\nප්‍රියා සූරියසේන\n\n,\n\nමාලනී බුලත්සිංහල\n\n සහ අබේවර්ධන බාලසූරිය සහ නව සිංහල මුල් ගීත 7000කට අධික ප්‍රමාණයක් සාර්ථකව පටිගත කරන ලදී. රේඩියෝ සිලෝන් හි තරුණ බෞද්ධ පූජකවරයකු හමුවීමට ද ඇය සමත් වූවාය\n\nධම්ම චින්තාවක්\n\n වැඩසටහන. මෙම වැඩසටහන ඉතා ජනප්‍රිය වූ අතර එය ගුවන් විදුලියේ ප්‍රථම බෞද්ධ දේශනාව බවට පත් විය. මෙම තරුණ පැවිදි පසුව උපසම්පදාවෙහි පැවිදි වූ අතර පසුව පානදුරේ අරිය ධම්ම හිමි නමින් හඳුන්වනු ලැබීය.\n\n1955 දී ඇයට චිත්‍රපටයේ පසුබිම් ගායනයෙන් සිංහල සිනමාවට පිවිසීමට අවස්ථාව හිමි විය\n\nඅශෝක\n\n අධ්යක්ෂණය කළේ\n\nසිරිසේන විමලවීර\n\n. චිත්‍රපටයේ ගීතය ගායනා කළේ රාණි\n\nපෙම් පහන් නිවී පම් මල පරවි\n\n මොහිදීන් බේග් සමඟින්, ඉතා ජනප්‍රිය විය. ඉන්පසුව ඇය එම චිත්‍රපටයට ධර්මදාස වල්පොල සමඟ ගීත ගායනා කළාය\n\nසුරංගනී\n\n.\n\n1977 දී එක්සත් ජාතික පක්ෂය (එජාප) සමඟ ඇති වූ දේශපාලන ගැටුම් හේතුවෙන් ඇය වසර 15 ක් ශ්‍රී ලංකා ගුවන් විදුලි සංස්ථාව විසින් ගායිකාවක් ලෙස කොන් කරන ලදී. 1994 දී ජනාධිපතිවරයා විසින් ස්වාධීන රූපවාහිනී සේවයේ අධ්‍යක්ෂවරිය ලෙස රාණි පත් කරන ලදී\n\nචන්ද්‍රිකා කුමාරතුංග\n\n. ඇය 2001 දක්වා එම තනතුරේ කටයුතු කළාය. 2004 පෙබරවාරි මාසයේදී රාණි ප්‍රසංගය සමඟින් ගායන දිවියේ 60 වසර සැමරුවාය.\n\nපරමා රමණී\n\n BMICH හිදී පැවැත්විණි. එම වසරේම මාර්තු මාසයේදී හෙළ සරණ පුණ්‍යායතනය විසින් සංවිධානය කරන ලද \"ස්වර්ණ ගී ප්‍රසංගයට\" සහභාගී වීමට ඇය ලන්ඩනයට ගියාය.\n\nඇයගේ ලන්ඩන් සංචාරයේදී ඇය දිවංගත මොහිදීන් බේග්ගේ පුත් ඉෂාක් බේග් සමඟ යුගලයක් ගායනා කළාය. එම ගීතයත් සමඟම පියා සහ පුතා පරම්පරා දෙකක ගායක ගායිකාවන් සමඟ ගායනා කළ එකම ශ්‍රී ලාංකේය ගායිකාව බවටද රාණි පත් වූවාය.\n\nරංගන දිවිය ඇය J.D.A ඇතුළු ජනප්‍රිය වේදිකා නාට්‍ය කිහිපයකින් රංගනය ආරම්භ කළාය. පෙරේරාගේ\n\nවෙස්සන්තර\n\n, උපාලි වනසිංහගේ\n\nදස්කොන්\n\n පසුව සිට\n\nරොඩි කෙල්ල\n\n. ඇය \"මන්ද්‍රි දේවි\" විය\n\nවෙස්සන්තර\n\n සහ \"ප්‍රේමිලා රැජින\" තුළ\n\nදස්කොන්\n\n.\n\nඇය මුල් සිංහල සිනමාවේ චිත්‍රපට කිහිපයක රඟපා ඇත. ඇය සිනමාවේ මංගල දර්ශනය පැමිණියේ 1955 චිත්‍රපටය හරහාය\n\nසුරංගනී\n\n \"නැන්දා\" ලෙස. ඉන්පසු ඇය චිත්‍රපටයේ රඟපෑවාය\n\nදුප්පතාගේ දුක\n\n ඇඟලුම් ආයතනයක සුපවයිසර් කෙනෙක් විදියට.\n\nඇය ශ්‍රී ලාංකේය සිනමාවට සහ සංගීත ක්ෂේත්‍රයට කළ සේවය වෙනුවෙන් 1995 සරසවිය චිත්‍රපට උළෙලේ දී රණ තිසර සම්මානය දිනා ගත්තාය. ඇය විශ්ව ප්‍රසාදිනී, කලාසූරි සම්මානයෙන් ද පිදුම් ලැබුවාය."
    },
    {
        "name": "මිහිර එස්.ඒ",
        "info": "සංගීතඥයා | කලාකරු | සංගීත නිෂ්පාදක",
        "Intro": "සංගීතඥයා | කලාකරු | සංගීත නිෂ්පාදක",
        "Known for": "සංගීත නිෂ්පාදක",
        "A.K.A.": "මිහිර එස්.ඒ",
        "Is": "කලාකරු\n\nසංගීතඥයෙක්\n\nගායකයා\n\nසංගීත අධ්‍යක්ෂක\n\nසංගීත සංවිධායක",
        "From": "ශ්රී ලංකාව",
        "Gender": "පිරිමි",
        "Birth": "9 සැප්තැම්බර් 1999",
        "Age": "අවුරුදු 22 යි",
        "Profiles": "",
        "description": "\"\n\nමිහිර ප්‍රනාන්දු\n\n a\n\nශ්‍රී ලාංකික\n\nRnB, EDM, Classic\n\n හා\n\nපොප්\n\nසංගීත නිෂ්පාදක\n\n, ලෙස වඩාත් හොඳින් හැඳින්වේ\n\nමිහිර එස්.ඒ\n\n. ඔහු මුලින්ම නිෂ්පාදනය ආරම්භ කළේ 2015 දී, ඔහු 2016 දී \"රංජිත් රොහාන්\" ඇතුළත් ඔහුගේ පළමු ගීතය \"මගේ පැල්පතට\" නිකුත් කළේය. ඔහු 2016 - 2021 දී \"FxMusix Productions\" නමින් ලේබලය ආරම්භ කළේය. ඔහු \"FL Studio 11\" නමින් DAW බාගත කළේය. 2015. එයාට Audio Engineering Dip තියෙනවා. ඔහු අන්තර්ජාලයෙන් නිෂ්පාදනය ඉගෙන ගත්තේ ඔහු විසින්මයි."
    }
]