[{"name": "Sanka Dineth", "info": "Musician, singer-songwriter", "Intro": "Musician, singer-songwriter", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "12 November 1986, Kalutara", "Age": "34 years", "description": "Sanka Dineth De Silva (Sinhalese: සංඛ දිනෙත්) (born November 12, 1986), better known as Sanka Dineth, is a Sri Lankan pop music singer-songwriter and composer.Early life\n \nSanka Dineth spent most of his schooling life was at Sri Sumangala College Panadura\n \nSanka was also in the school western band. He played guitar, piano, violin and the flute. He has a diploma in vocal classic bhathkande music (Indian classic). Throughout his schooling he participated numerous talent shows.\n \nSanka's could join the school orchestra thanks to ability to compose melodies.\n Music career\n \n2007:Sirasa Superstar\n \nSanka won the sixth place at the Sirasa Superstar Season 2 in 2008.\n \n2008 - Present\n \nAs a result of popularity he gained through Superstar, he was selected to promotes several prominent brands in Sri Lanka including Lanka Bell, Elephant Cream Soda and Maliban Biscuits. for His debut album \"Sankranthi\" has been released in 2009.\n \nSanka done the music for 2010 Sinhala film nino Live and 2011 Sinhala Film \"Colors\" \n \nIn July 2010, he that he in planning to launch a set of \"different kind of songs\" in collaboration with local radio station, Hiru FM\n \n Discography\n "}, {"name": "Wally Bastian", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Death": "10 January 1985", "description": "Ogustus Martheneus Bastiansz, better known as Wally Bastiansz (Sinhala: වොලී බැස්ටියන්) (died January 16, 1985) was a Sri Lankan singer who developed the style of chorus baila in the 1940s.\nBastianz was a police officer attached to the traffic division, who also played in the marching band when he began his music career. He was also an experienced guitarist, banjo player, and violinist. Drawing from his orchestral roots, he transformed the tunes of standards like \"The Battle Hymn of the Republic\" and \"Inky Pinky Parlez Vous\" into classic baila songs.\nThere has always been some controversy over his name \"Wally\". It is very customary in Sri Lanka, even to day, for children to have nicknames. Although he was baptized OGUSTUS MARTHENEUS after his grandfather Wilhelmus Martheneus, in the family, amongst close relatives, and even amongst his old neighbours, Ogustus was only known as either \"Olie, or Olinton\". Young Ogustus was not very comfortable with his name and mostly went by his initials O.M. Bastiansz rather than Ogustus or Martheneus. After embarking on his musical adventure he aptly adapted his nickname \"Olie\" to be \"Wally\", his well known stage name and, for all official purposes presented himself as Olinton Mervyn Bastianz maintaining his original initials O.M.\nHis songs dealt with everyday life and simple people. One of his hits ('Nurse Nona') was an ode to a nurse in a hospital and another covered the trial of jilted lover Eric Bacho. He sang several songs in English. Other songs written by him, but later ascribed to other popular artistes include Hai Hooi Babi Achchige, Yaman Bando Vesak Balanna, Ratak Watinawa, Le Kiri Karala, Irene Josephine, Kussi Amma Sera, Muhudey Yamu Masun Genenna, Weeriyen Soya, Nondi Simaiyya, Wada Kaha Sudiya, and many others. The song 'Babi Achchige bicycle' was an actual event that happened to Babi Achchi near Prince of Wales' College, Moratuwa.Family\n \nIt is almost an unknown fact that the nurse in his all-time favourite song \"Nurse Nona\" was none other than his own late sister, Felicia Florence Jayasekera (née Bastianz, died 1996) who worked as a nurse in the early 1940s. Florence gave up her job as a nurse in 1944 after her first child was born. In 1969 Florence and her family moved to the ancestral home of the Bastiansz family in Paiyadigama, a small village about 2 km north of the coast between Galle and Gintota, to take care of their ailing father Hinton Wilmot Bastiansz.\n \nThe old Bastiansz residence in Piyadigama, where Wally Bastiansz and all his eight siblings were born, is now occupied by one of Florence's sons.\n \nWally Bastiansz is closely related to Sri Lankan popular artist Judy de Silva. Wally happens to be Judy's maternal grandfather Edgar de Silva's first cousin. Wally's Father Hinton and Edgar's mother Winifred were brother and sister.\n "}, {"name": "Gunadasa Kapuge", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "7 August 1945, Sri Lanka", "Death": "3 April 2003\n(aged 57 years)", "Star sign": "Leo", "description": "Ellamulla Kapuge Gunadasa\n (Sinhala:එල්ලමුල්ල කපුගේ ගුණදාස , August 7, 1945 - April 3, 2003), better known by his stage name \nGunadasa Kapuge\n, was a Sri Lankan musician. He was well known among Sri Lankans due to the philosophical background of his music renditions and lyrics selected for his work. Kapuge's one man show called \nKampana\n was a historical advent of the Sinhala music industry.Early lifeKapuge was born on August 7, 1945 in the tiny village of Thanabaddegama in Elpitiya. Being the second of eight siblings, he attended Karandeniya Central College up to grade five and the latter part at Dharmasoka College in Ambalangoda, where he initially studied science before switching to music. In 1963, he left Haywood college of music, where he was studying at that time, to follow a degree course in India. In late 1960, Kapuge joined the Sri Lanka Broadcasting Corporation and in 1969, he worked as an operational assistant and in 1975 started out as a programme producer. In 1981, he was appointed in charge of the music section of the Rajarata Sevaya and later on promoted to the position of the controller of the station. Rajarata Sevaya is one of the provincial radio stations of the Sri Lanka Broadcasting Corporation. He later married Prema Withanage in 1978.Music careerKapuge's initial release was titled \"Daesa Nilupul Thema\" in 1973, which became an instant hit. After which, Kapuge was quoted as a 'Grade A' vocalist by the Radio Ceylon. Thus the three decade long music career of Visharada Kapuge began. The first stage drama for which he provided background music was \"Thuranga Sanniya\" by Sugathapala De Silva. Since then he provided background music for the highly popular musical \"Tharawo Igilethi\" by Lucien Bulathsinhala and several other. His first movie background music gig was for Stanley Perera's \"Sandha.\" In 1980, Kapuge released his first music compact cassette titled \"Dhampatin Laa Sandha\" featuring Malini Bulathsinhala.Music cassettesStage PlaysTele dramasFilmsKapuge staged a one-man musical show titled \"Kampana\" during the 1990s and also released a cassette and CD with the same title.DeathOn returning from a tour at Dubai, United Arab Emirates, Kapuge had a fall at the Bandaranaike International Airport whilst disembarking a shuttle bus. He sustained injuries on the back of his head. He was taken to the medical center at the airport at around 4.30 AM where he was given saline. After initial treatment, he was to be taken to the Colombo National Hospital. However, there was no male nurse available to assist. Kaupuge later died at Colombo National Hospital.His son Mitra Kapuge continues to sing his father's songs.Awards1996199719981999"}, {"name": "Amarasiri Peiris", "info": "Sri Lankan Musician", "Intro": "Sri Lankan Musician", "Is": "Musician\nSinger\nViolinist", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Profiles": "", "description": "Amarasiri Peiris is a Sri Lankan Musical artist who is well known as a Violinist and a Vocalist.Life and carrierHe is the son of late \nAlbert Peiris\n who was a Radio Ceylon artiste of the 1940s. He studied at Buwanekaba Vidyalaya, Maharagama and the \nUniversity of Visual & Performing Arts\n (former \nHeywood Institute\n). He joined SLBC as an A-grade violinist, and eventually, became a music conductor, a music controller and, at the time of my retirement, he worked as the Director, Music at SLBC. Peiris is an awarded Singer in Sri Lanka and he still performs on stage. His first popular song is \nLandune\n which was composed by maestro Premasiri Khemadasa. And then he sang many popular songs like"}, {"name": "Desmond de Silva", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "description": "Desmond de Silva is a Sri Lankan singer and entertainer, noted for his youthful voice that has changed little over four decades of performing, and regarded as the \"King of Baila.\" Born in Matara in southern Sri Lanka, De Silva is now resident in Australia and has performed to packed concert halls across the world.1960s in Ceylon\n \n\"Des,\" as he is known to his fans, launched his career in popular music in Colombo in 1963, he was the lead vocalist of the Fire-Flies. His music was featured widely on Radio Ceylon and subsequently the Sri Lanka Broadcasting Corporation, the oldest radio station in South Asia. Des has also performed with leading Sri Lankan pop groups – \"Spitfires,\" \"Gabo and the Breakaways,\" and the \"Jetliners.\" He sang a song titled 'Oba Nisa' with Mignonne Fernando and the Jetliners – it was hailed as a musical masterpiece at an international song festival. In 1976 he decided to form his own band, \"Desmond and the Clan\", which performed in various countries in Southeast Asia, including the Maldives. In 1984, de Silva decided to go solo.\n International song contests\n \nDesmond de Silva has represented Sri Lanka at the 5th Olympiad of Songs in Athens, Greece in 1979 and at the Yamaha Festival of Song in Tokyo, Japan.\n Forty Year in Showbiz\n \nHe has celebrated 40 years in show business, selling millions of CDs around the world. De Silva is known for his popular renditions of Sri Lankan 'baila' music, which is a style whose origins are in Portuguese and Spanish music. He has had a string of baila hits including: 'Polkatu Hande,' ' Yaman Bando (Wally Bastiansz),' 'Chuda Manike,' 'Mamma No,' 'Miss Sri Lanka,' 'Hai Hui baby Achchi(Wally Bastiansz),' 'Rajasangabo' 'Komali Pane,' as well as popular recordings of anonymous baila songs. He is also known for a whole range of 'Party Time' non-stop baila music sold around the world.\n \nDesmond de Silva now resides in London and has performed with London based backing group Foreign Affairs at many a concert in the United Kingdom.\n Championing the cause of Autism\n \nDe Silva has championed the cause of autism and Asperger syndrome: he created history in August 2005 by being the first Sri Lankan musician to appeal on behalf of autistic children and people with autism in Sri Lanka, urging Sri Lankans to 'speak up for those who cannot speak up for themselves.' De Silva received a standing ovation.\n \nDe Silva told thousands at the BMICH in Colombo: ' Autism is a neuro-developmental disorder affecting so many around the world. Autism is not mental illness, these children and adults think differently. Albert Einstein they say was autistic. How many in the audience know that there are 38,000 autistic people in Sri Lanka? So we as entertainers, urge you all to 'speak up for those who cannot speak up for themselves.' Lets spread awareness of autism, particularly when numbers of autistic children are rising and we urge our government to also provide public services – who knows we may even produce Albert Einsteins if we provide education, health, specialist speech therapy for autistic children in our lovely island....'\n \nDesmond de Silva launched the first ever Concert for Autism for Sri Lanka in Sydney, Australia on 31 March 2006.\n \nHe remains one of Sri Lanka's popular entertainers and is in heavy demand in the United Kingdom, United States, Australia, India and other places.\n Quotes on Desmond de Silva\n \n' Desmond de Silva is one of Sri Lanka's leading musicians – he has popularised Sri Lankan baila music all over the world and has appeared as far afield as Los Angeles, New York, Melbourne, London, Auckland, Dubai, Bahrain, New Delhi and Singapore.'\n \n \nWORLD MUSIC CENTRAL\n \n \n' Yes... they all came in droves to hear and see their hero back in high action at the sold out concert at BMICH. The older fans to savour the event and listen to their favourite songs, while the young eager to enjoy, maybe for the first time, Desmond Live in Concert – a concert with an unexpected difference. It was also a night for the elite in the music world, theatre, fashion and society – sure they were not going to miss out on this extravaganza and Desmond's acclaimed showmanship....'\n \n \nTHE SUNDAY OBSERVER SRI LANKA\n \n \n' Desmond has a heart of gold, he is reaching out to people with autism and the Autism Awareness Campaign Sri Lanka are grateful to the 'King of Baila' for raising awareness about the condition. Desmond de Silva is making a difference.He has enthralled audiences all over the world. His CDs have sold millions all over the globe.Desmond was touched to hear about the plight of 38,000 autistic children in Sri Lanka – only a handful are being helped in schools and parents, carers and autists have to struggle to access public services in health, education specialist speech therapy and respite care on the island.'\n \n \nAUTISM AWARENESS CAMPAIGN SRI LANKA\n \n \n'Mr de Silva, who has been performing for over 40 years, is expected to perform some of his top hits.The artist has performed to sell-out crowds all over the world and will be performing for the first time at The Warbler, Baisan International Hotel in Bahrain.An accomplished singer of English songs, he began his musical journey in 1963 with the band, Fireflies.The singer has also worked with SriMirage, the band currently performing at The Warbler, and today's show will mark their reunion.....'\n \n \nGULF DAILY NEWS BAHRAIN\n \n Discography\n \n \nBaila 20\n \nGramaphone Express\n \nChuuda Maanike\n \nHaadu Hathak\n \nKomali Pane\n \nBaila Rajje\n \nDesmond Silva with Sunflowers\n \n "}, {"name": "Indrachapa Liyanage", "info": "Musician", "Intro": "Musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "13 January 1982, Colombo", "Age": "39 years", "Family": "Father:\n\nHemasiri Liyanage", "description": "Indrachapa Liyanage (Sinhala: ඉන්ද්‍රචාපා ලියනගේ; born January 13, 1982) is a Sri Lankan singer. He has completed his debut album Abinishkramanaya (renunciation), but it has not been officially released yet.Biography\n \nIndrachapa Liyanage was born in Colombo, Sri Lanka, on January 13, 1982 and educated at Ananda College Colombo. His music career started in the year 2000, with his school mate Kasun Kalhara in their own project. They released an album called \nHaritha Nimnaye\n, and it was a very successful release, and the album introduced them to a huge fan base. But in the years of 2004 and 2005, they closed down their project and went on to each make their own music, though they continued to work together on occasion.\n \nLately Indrachapa has moved on to rock music and doing experiments in order to create a \"Sri Lankan Identity\" rock style. His main aim is to popularize rock music among the majority of the country. He has released a single called \n\"Ginidal\"\n which was his first single.\n \nIndrachapa has performed over 20 domestic major concerts and several abroad along with other artists.\n \nIn 2010, he entered the movie industry by composing the theme song for the movie \nHow I Wonder What You Are\n.\n Personal life\n \nIndrachapa is the youngest member in his family. He has two elder brothers: Saumya Liyanage and Aloka Liyanage. His father, Hemasiri Liyanage, is a famous Sri Lankan actor.\n \n Discography\n \n \nAbinishkramanaya (renunciation) (album)\n \n \nSingles\n \n \n\"\nAdaraya Anshumathrayak\"\n (\"Love is a Confession\")\n \n\"\nDasin\"\n \n\"\nGinidal\"'\n \n\"abiniskramanaya\"\n \n\"\nSinhayo\n\" (for the 2011 Cricket World Cup)\n \n\"\nIrunu Aththatu\n\" (2011)\n \nUlkapathayak (Falling Star)\n \n\" \nපියවුණා දෙනෙත් නිදිමතින්\n \" \n \n \n \n \nIrunu Aththatu (Exclusive Web Release)\n \n \n(\nYouTube video link\n)]\n \n "}, {"name": "Nalin Jayawardena", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer\nSongwriter", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "18 April 1957", "Age": "64 years", "description": "Nalin Jayawardena (Sinhala : නලින් ජයවර්ධන) (born 18 April 1957) is a popular Sri Lankan singer and vocalist. He was the first Sri Lankan singer to release an internet based audio album in Sinhala allowing his fans from around the world to download the album free of charge. This album titled Kanda Paamule was released in 2004. Nalin Jayawardena lives in Perth, Australia.\nHe has released more than 10 CDs including several tribute CDs for the legendary singer HR Jothipala . Nalin Jayawardena has sung over 250 original songs. These songs were composed in collaboration with talented sinhala lyric writers such as Dr Vicumpriya Perera who wrote most of Nalin's songs, Sunil Govinnage , Sriya Kumarasingha and Chrishanthi de fonseka . Musical composition for Nalin's songs were done by popular Sri Lankan musicians including Nimal Mendis , Rohan Jayawardena , Sangeeth Wickramasingha , Ananda Widyasekara and Rukshan Karunanayaka . Nalin is one of the early Sri Lankan artists to release his songs in Google Play, iTunes, and Amazon.\nHe has also collaborated in the making of the first-ever Dhammapada Stanzas CD packs with Ven Beruwela Siri Sobitha and Dr Gill Fronsdal. He also collaborated in making the charity CD/DVD in the aid of the Tsunami victims in Sri Lanka. He also collaborated with Vicumpriya Perera and Bhadraji Mahinda Jayatilaka to produce the first-ever sinhala audio fiction book Kulageyin Kulageyata spanning into five compact discs. This audio book is a production of Lanka Heritage and Sarasavi Publishers, Sri Lanka.Life and career\n \nEarly life\n \nBorn in Batticaola, in eastern Sri Lanka as the eldest son of Mr Chandra and Mrs MaryAnn Jayawardena, and did his primary studies at Prince of Wales college Moratuwa and at Bandaranayaka college in Gampaha [WP]\n \nHe has written several of his own songs and began his music career at a later stage of his life. He in musically talented in the sense that he has the ability to vocalise in a variety of styles and genre ranging from semi-classical to popular western. He has produced over 11 Sinhala audio CD's and several DVD's to entertain his fans.\n \nHe is married to Renuka Jayawardena [nee Ranasingha] from Galahitiyawa, Ganemulla, Sri Lanka, a medical scientist by profession, and has two daughters. He resides in Perth, Australia.\n \nRecent events\n \nNalin Jayawardena is currently employed as a building service professional in Australia. He recently released several Sinhala audio compact discs including \"Duru Ratawala Api (2011),\" two albums titled \"Pilak Wage (2013)\" and \"Pini Wessa Wage (2013)\" created via collaboration with Facebook friends, and \"Mal Renuwak (2013).\"\n Notable songs\n \n \nSansara Suwanda\n – Nalin Jayawardena and Amila Nadeeshani, Music and Melody – Ananda Waidyasekara, Lyrics – Eranga C. Palathiratne.\n \nDuru Ratawala Api\n – Nalin Jayawardena and Nilupuli Dilhara, Music and Melody – Ananda Waidyasekara, Lyrics – Krishanthi de Fonseka.\n \nMaalavika\n – Nalin Jayawardena, Music and Melody – Rohan Jayawardena, Lyrics – Vicumpriya Perera.\n \nPaata Paata Samanaliyan\n – Nalin Jayawardena, Music and Melody – Rukshan Karunanayake backed by Chimes of The 70's, Lyrics – Rukshan Karunanayake.\n \nTsunami\n – Nalin Jayawardena, Melody and English words – Nimal Mendis, Music – Rohan Jayawardena, Sinhala Lyrics – Vicumpriya Perera.\n \nMidula Puraa\n – Nalin Jayawardena and Sanduni Rashmika, Music and Melody – Ananda Waidyasekara, Lyrics – Vicumpriya Perera. \n \n \n \n \n\"Sansara Suwanda\"\n. Retrieved \n19 December\n 2013\n.\n \n \n \n\"Duru Ratawala Api\"\n. Retrieved \n19 December\n 2013\n.\n \n \n \n\"Maalavika\"\n. Retrieved \n19 December\n 2013\n.\n \n \n \n\"Paata Paata Samanaliyan\"\n. Retrieved \n19 December\n 2013\n.\n \n \n \n\"Tsunami Sri Lanka\"\n. Retrieved \n19 December\n 2013\n.\n \n \n \n\"Midula Puraa\"\n. Retrieved \n19 December\n 2013\n.\n \n \n List of Audio CDs\n \n \nKanda Paamule (2004)\n \nAnusmarana Upahara – H R Jothipala Tribute (2004)\n \nTsunami Audio CD (2005)\n \nCold Cold Night – Xmas Single (2005)\n \nPaata Paata Heenayak (2008)\n \nUpahaara Sihiwatana (2009)\n \nWeli Aetayak – Vicumpriya Perera Lyrics 02 (2009)\n \nAthithawarjanaa – H. R. Jothipala Upahara Gee Pelahara (2010)\n \nPerth Gamata Paayayi Sandha (2010)\n \nPaata Paata Samanalayin (2010)\n \nOba Soya Ennam (H. R. Jothipala Tribute – Free CD Release)\n \nDuru Ratawala Api (2011)\n \nPilak Wage (2013)\n \nPini Wessa Wage (2013)\n \nMal Renuwak (2013) \n \n \n \n \nFirst ever Sinhala Internet Music CD\n \n \nTsunami song receives positive reviews in the UK\n \n \nPaata Paata Heenayak\n \n^ \n \nUpahara Sihiwatana – In Remembrance of Jothipala\n \n \n \nUpahara Sihiwatana – Remembrance CD\n \n \n‘Weli Aetayak’: Nalin and Vicumpriya’s joint venture\n \n \n \n \nDuru Ratawala Api\n \n^ \n \nPerera, Charith. \n\"Digital platform for lyricists and poets taps the pool of talents\"\n. Sunday Observer.\n \n \n \nThilakarathne, Indeewara. \n\"Depicting life through songs\"\n. Ceylon Today\n. Retrieved \n20 December\n 2013\n.\n \n \n \nMal Renuwak\n \n "}, {"name": "Sadiris Master", "info": "Sri Lankan musician and actor", "Intro": "Sri Lankan musician and actor", "A.K.A.": "Jothiratnage Sadiris de Silva", "Is": "Musician\nActor\nSinger", "From": "Sri Lanka", "Type": "Film, TV, Stage & Radio\nMusic", "Gender": "male", "Birth": "Matara", "Death": "8 April 1958", "description": "Jothiratnage Sadiris de Silva (died 1958), better known as Sadiris Master, was a Sri Lankan musician and actor.\nSadiris was born in Matara. He was educated at the Temple in Kalutara and studied oriental language. Sadiris later became a popular musician singing and playing Hindustani and Karnatic music. He also acted in several John de Silva plays taking the lead role; Sirisangabo, Wessantara. Sadiris died on April 8, 1958."}, {"name": "Rookantha Gunathilake", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer\nSongwriter", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "5 September 1959, Kegalle, Kegalle District, Sabaragamuwa Province, Sri Lanka", "Age": "62 years", "Family": "Spouse:\n\nChandralekha Perera", "description": "Mario Glory Rookantha Gunathilake\n (Sinhalese: \nරූකාන්ත ගුණතිලක\n) (born 5 September 1959) is a Sri Lankan singer and songwriter. He started his career as a solo singer in late 1980s. He frequently duets with his wife Chandralekha Perera. His daughter Raini Charuka Gunathilake is also a singer and an actress.Rookantha is one of the most successful musicians in Sri Lankan disco industry. His albums have sold around 10,000 copies in Sri Lanka. He is known as the person who changed the Sri Lankan music industry in the 80s with his songs.Life and careerEarly yearsRookantha Gunathilake was born in Kegalle to a middle-class family in Sri Lanka. He loved music from a very young age. As a result, his parents sent him to a music teacher nearby to teach him to play the piano.Rookantha once said in a radio interview that one of his music teachers at school was not that friendly and punished him several times for not using correct fingering in piano. Also, he found out that he is getting restricted to what the teacher wanted him to learn.He attended St. Mary's College, Kegalle for primary education. He learned music at his school, St. Anthony's College, Kandy from great musicians such as Stanley Peiris and Cyril Brown.MusicRookantha Gunathilake originally pursued a career as a composer in 1976. In 1985, he found himself without a singer to provide vocals on one of his compositions, \"Bambara Pahasa.\" He provided the vocals himself, beginning his career as a singer with a deadline hanging over him.His fourth album \"Charuka\", named after his daughter \nRaini Charuka Gunathilake\n, was released in 1997. The exclusive Concert of Rookantha and Chandralekha is \"Ru Sanda Raye\" which means \"Beauty Moon Night\". The first Concert was staged at The Elphinston Theatre in Colombo, Sri Lanka in February 1993. To-date it has been staged in many places in the globe such as Italy, France,Denmark,UK,USA and The middle eastern Bahrain. \"Ru Sanda Raye\" Concert has been staged more than 200 times and still counting.Personal lifeRookantha is married to singer and former actress Chandralekha Perera. They have two daughters, \nRaini Charuka Goonatillake\n(born 10 April 1991) and \nTrinita Windy\n. Since December 2005, Rookantha and Chandralekha reside in New York City with their family.Most recent tour Roo Sanda Raye took place in between 2005 and 2006.The mega show of \"Rookantha-Chandralekha Live at Stadium\" was held in August 2007 at the Sugathadasa Indoor Stadium.DiscographySingles"}, {"name": "Sisira Senaratne", "info": "Singer", "Intro": "Singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "29 March 1935, Sri Lanka", "Age": "86 years", "description": "Sisira Senaratne\n was one of Sri Lanka's popular singers since the 1960s. Senaratne, with his wife Indrani, conducted shows in Sri Lanka and around the world, including Canada, United Kingdom, United States of America, Dubai, Australia, Germany, Switzerland and Italy. Together with his wife the duo have conducted many popular ‘Sisindra’ musical shows in Sri Lanka and abroad.Early life and educationSenaratne was educated at Central College Maradana and Nalanda College Colombo.FamilyHe was married to Indrani née Wijebandara.CareerSince the 1960s, Sisira had sung many popular songs such as \"Olu Nelum Neliya\", \"Seeta Diyareli\", \"Nuhuru Nupuruda\", \"Mage Puthuta Mal\", and \"Gaya Geethayan Game wel Eliye\". In 1956 Sisira sang \nOlu Nelum Neliya Rangala\n for Sri Lankan film director Lester James Peries's film \nRekava\n.General references"}, {"name": "Shelton Premaratne", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "1931", "Age": "90 years", "Instruments:": "Voice", "description": "\nShelton Premaratne\n (born 1931) is a Sri Lankan instrumentalist and music director who plays various eastern and western instruments.\nPremaratne was born as one of Sardiris Master and Emilin Nona's five sons.\nHe directed most of the \"Bakthi Gee\" programs held by Sri Lankan Airlines Ltd. Special \"Bakthi Gee\" programs performed in 2004 in front of \"Veherahena Buddha Statue\", Matara which telecasted live on TNL TV broad casting service and in 2005 program was telecasted on ITN TV broad casting service. Most of his BAKTHI GEE songs were digitally composed and mixed with the help of his son, Agra Premaratne.\nHe also produced many versatile musicians. The music for the famous hunuwateya katawa (breacht cosecond chalk circle) was created for the sinhala field by Premaratne.\nFilm music1971 – Hitaka Pipunu Mal\n1972 – Kalana Mithuro\n"}, {"name": "Narada Disasekara", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "British Ceylon, United Kingdom", "Death": "19 May 2010, Sri Lanka, Sri Lanka", "Star sign": "Gemini", "Instruments:": "Voice", "description": "Narada Disasekara\n (7 June 1933 – 19 May 2010) was a Sri Lankan classical singer. He won the first Sarasaviya Award for Male Playback Singing in 1964 for his duet \"Galana Gangaki Jeevithe\" with a young \nNanda Malini\n for \nRanmuthu Duwa\n.\nDisasekera had started as a mechanic of the Engineering section of National Radio Ceylon and later became a popular singer of the Radio Ceylon.\n“Chandana Enga Gala”, “Eya Pamanai Mage Mihirata”, “Mulu Hadin Mama Obata Pemkara” are some of Radio Ceylon songs of Narada.\n“Galana Gangaki Jeewithe”, “Pipee, Pipee Renu Natana”, “Gamana Nonimei Lokaye”,\n“Aarichchi Borichchi” was the background songs sung by him which became hits.\nHe has also provided background songs for the films “Hathara Kendaraya”, “Senasuma Kothenada”, “Adarayai Karunawai, and “Manamalayho”.\nHe's son \nSaranga Disasekara\n is a well-known popular actor in Sri Lanka.\nDisasekara died on 19 May 2010 at the age of 76.\n"}, {"name": "Neela Wickramasinghe", "info": "Sri lankan musician", "Intro": "Sri lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "30 March 1950", "Age": "71 years", "Star sign": "Aries", "Profiles": "", "description": "Visharada Neela Wickramasinghe is a veteran female singer and a musician in Sri Lanka, who mainly sings in Sinhalese.Early life\n \nWickramasinghe was the youngest daughter of Don Francis Wickramasinghe and Withanaratchige Done Yasawathie Gunasekera in Wattala. She became a victim of Polio at the age of six months. The first school she attended was Kirimatiyagara Vidyalaya. In 1954 she was admitted to Kesbewa Government private school where she first started to be involved in music. Later she went to Mampe Sri Sobhita Maha Vidyalaya. Wickramasinghe learned music under maestro Vincent Somapala and Ananda Jayasinghe. She sang her first song for the then Radio Ceylon in 1959 for a programme 'Amateur voice.' In 1967 she got the privilege to record her first song with Radio Ceylon. The song was composed by Mr. Dalton Alwis and the music was provided by Lionel Algama, \"Sende ambare nisha mal yata\". In 1973, she was selected as an A grade artiste on the merit of the songs sung of the research section of the SLBC. After studying North Indian Classical Music, she graduated in 1974 with a Sangeeth Visharada Degree. Wickramasinghe had a number of popular hits including duets with T. M. Jayaratne. Later, Wickramasinghe opted to become a teacher in music. After teaching in several schools she decided to retire prematurely in 1998 after a period of 23 years having had a long stint of eight years at Visakha Vidyalaya, Colombo. Wickramasinghe was diagnosed with abdominal cancer in a very serious manner and survived.\n Music\n \nSo far she has sung in 67 films as a playback singer and has contributed to hundreds of songs. List of songs composed by Wickramasinghe.\n \n \n \nSong\n \nLyrics\n \nSinger\n \n \n \nKakkutu Suttan\n \nSeetha Ranjanee\n \nPradeepa Dharmadasa\n \n \n \nDhelthira\n \nAnanda Hewaranhindage\n \nNelu Adikari\n \n \n \nWala potin\n \nManju Nedagamuwa\n \nPetronella Fernando\n \n \n \nAtha dennam\n \nSuneth Rupasinghe\n \nPetronella Fernando\n \n \n \nJeevithaye\n \nChandradasa Fernando\n \nVictor Ratnayake\n \n \n \nSihina nagaraye\n \nChandradasa Fernando\n \nVictor Ratnayake\n \n \n \nMage puthanuwane\n \nAshoka Kovilge\n \nJorg Lesley Ranasinghe\n \n \n \nNirindeku wee\n \nChandradasa Fernando\n \nT.M. Jayaratne\n \n \n \nThana pinne\n \nPriyananda Vijesundara\n \nT.M. Jayaratne\n \n \n \nSihina thusithaya\n \nSwarna Sri Bandara\n \nT.M. Jayaratne\n \n \n \nKandulu iwarakara\n \nVen.Siddhartha Thero\n \nRohana Bogoda\n \n \n \nEdawage mathu\n \nPriyananda Wijesundara\n \nAmarasiri Munasinghe\n \n \n \nMee thula mee peni\n \nPriyananda Wijesundara\n \nAmarasiri Munasinghe\n \n \n \nViyo dukin\n \nThilaka Kaluarachchi\n \nAyesha Gunasekara\n \n \n \nMahamera se ape amma\n \nThilaka Kaluarachchi\n \nNeetha Wickramathantrige\n \n \n \nBalakale\n \nVen.Siddhartha Thero\n \nKapila Herath\n \n \n \nAyeth dawasaka\n \nAnanda Hewaranhindage\n \nKapila Herath\n \n \n \nAdasanda nivila\n \nSunil R. Gamage\n \nKapila Herath\n \n \n \nPahankala sanda\n \nAnanda Hewaranhindage\n \nKapila Herath\n \n \n \nKandulusaure\n \nSunil R. Gamage\n \nKapila Herath\n \n \n \nEtha himale\n \nVen.Siddhartha Thero\n \nKuma Athanayaka\n \n \n \nNiwan dakna\n \nMahinda Disanayaka\n \nKuma Athanayaka\n \n \n \nHadawathak\n \nVen.Siddhartha Thero\n \nKrishantha Erandaka\n \n \n Solo concert\n \nOn 2012, To mark 45th anniversary of her musical career,Wickramasinghe started a solo concert named \"Master Sir\".\n Social activity\n \nThe Mother Organization\n \nOn 2002, Wickramasinghe founded a charity organisation named \"The Mother\" with the aim of catering to children, elders and artists who made a lifetime contribution to the field. She is the president of the organisation\n \nSupport to eradication of Polio\n \nWickramasinghe participated in the UNICEF Project to save the children by eradicating polio from our country in 1989. She sang a song composed for this campaign, which was heard frequently over the airwaves and T.V. channels. Her efforts helped immensely to eradicate polio through this campaign and by 2000 not a single case of polio had been recorded since.\n Awards\n \nShe has won the Sarasaviya Award thrice, Presidential award, Sumathi tele award, Zonta award and Vanitha award.\n \n \n \nYear\n \nTitle\n \nAward\n \nProduction\n \nSong\n \nLyrics\n \nMusic\n \n \n \n1984\n \nSarasaviya Best Female Playback Singer\n \nSarasavi\n \nEthin Ethata\n \nBodhiye Viharaye\n \nAjantha Ranasinghe\n \nSarath Dasanayake\n \n \n \n1986\n \nSarasaviya Best Female Playback Singer\n \nSarasavi\n \nDolosmahe pahana\n \nRasa musuwu pem kalpana\n \nK.D.K. Dharmawardana\n \nPremasiri Khemadasa\n \n \n \n1992\n \nSarasaviya Best Female Playback Singer\n \nSarasavi\n \nDolosmahe pahana\n \nPemakasuwanda denila\n \nYapa B Senevirathna\n \nGreshan Ananda\n \n \n \n1996\n \nBest Teledrama Vocalist\n \nSumathi Awards\n \nSankranthi Samaya\n \nNothalan Malkekulu\n \n \n \n "}, {"name": "C. T. Fernando", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "28 January 1921, Sri Lanka, Sri Lanka", "Death": "21 October 1977\n(aged 56 years)", "Star sign": "Aquarius", "Instruments:": "Voice", "description": "Cyril Tudor Fernando\n (Sinhala: සිරිල් ටියුඩර් ප්රනාන්දු), known as \nC.T.Fernando\n (Sinhala: සී. ටී. ප්රනාන්දු) (January 28, 1921 – October 17, 1977), was a popular Sinhala singer in Sri Lanka. He entered music industry in the 1940s. He was praised by critics for the themes and wording of his songs like \"Vana Bamaru,\" \"Bilinda Nelwa Ukule\" and \"Rosa Male.\" His other popular songs include \"Lo Ada Ninde\", \"Gile Male Tarawa\" and \"Mariya Mawu Kuse.\"\nBiographyEarly life and careerC.T. was born in Kadalana, Moratuwa and educated at St. Mary's College, Nawalpitiya. As a student C.T. showed interest in the arts participating in school dramas and singing with the local church choir. C.T.Fernando often won prizes for elocution, singing and drama, including a gold medal of oratory. He was a chorister in his local parish church, and later became the choir master of A.R.P. Messenger service in Colombo between 1942 and 1965. He later joined the Grand Cabaret to entertain the troops involved in world war 2 and further developed his musical talents.\nIn 1946, Fernando successfully auditioned for a position as grade one radio artist on Radio Ceylon. There he had his first popular song with \"Pin Sindu Wanne,\" a plea to children to stop harming birds. The song was written by R. N. H. Perera.\nCommercial artistIn 1952 Fernando branched out as a commercial artist signing with HMV subsidiary Cargills Company. He recorded many of his popular songs with the label including \"Pinsiduwanne\", \"Suwanda Rosa\", \"Bara Bage\", \"Ambilimame\", \"Lo Ada Ninde\", \"Gilimale Taruwa\", \"Kimada Sumihiriye\", \"Amba Ruk\" and \"Bilinda Nelawe Ukule\".\nFrom 1959 to 1960, Fernando was rated the most popular singer in the country. He continued his recording career recording the LP \"The Golden Voice of C.T. Fernando\" with the Lewis Brown company.Popular Songs such as \"Hela Jathika Abhimane\",\"Ma Bala Kale\", \"Sandhawata Ran Tharu\",\"Ane Dingak\", \"Piyumehi Peni bothi\",\"Punsadha Hinehenne\" a Duet with Rukmani Devi, \"Sihina lowe\", \"Awadhiwanna\" and \"Mage sudhu Mame\" were included in this album. The Original Music arrangements and Direction for these songs in the album were done by the Music Legend Patrick Denipitiya. These recordings featured lyrics by Lalith S. Maithripala, Karunaratna Abeysekara, Sarath Wimalaweera and Wimaladasa Perera.\nThe music for some of his songs were composed by Fernando himself in addition to B.S.Perera and Patrick Denipitiya.\nFernando recorded a popular duet, \"Pun Sanda Hinahenne,\" with \nRukmani Devi\n. Another duet, \"Selalihini Kovul Handa,\" was done with Lata Walpola. Most of his duets were sung together with Ruckmani Devi and Lata Walpola as well as Chandra de Silva. C.T.Fernando also acted in a few Sinhala movies such as Deyiyange Rate and Gamperaliya directed by \nLester James Peries\n. He was the first Sri Lankan Artist to tour overseas with Music Director \"Patrick Denipitiya and his Combo\" in 1967 performing at various venues in UK,France,Italy,Switzerland, Spain and other Europe destinations during a period of 6 months.\nTrack listingDeath and legendC.T.Fernando died On October 17, 1977 following a heart attack at the age of 56. C.T.'s son Priyantha Fernando performed his father's songs over forty years. Having suffered from a kidney failure, Priyantha also died on May 1, 2018 at the age of 65.\n"}, {"name": "Gratien Ananda", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "11 March 1957, Tangalle, Sri Lanka", "Death": "29 December 2010\n(aged 53 years)", "Star sign": "Pisces", "description": "\nGratien Ananda\n (Sinhala: \nග්‍රේෂන් ආනන්ද\n; 11 March 1957 – 29 December 2010), also as \nGration Ananda\n or \nGreshan Ananda\n, was a Sri Lankan singer, composer, songwriter and a lyricist. Considered as the best Sinhalese film score musician to have emerged in the country since the veteran artist the Late H.R. Jothipala, Ananda sang for more than 400 films with a musical career that spanned nearly three decades.\nHe died at the age of 52 while receiving treatments at National Hospital of Sri Lanka, Colombo.\nPersonal lifeHe was born on 11 March 1957 to a family immersed in music. His grand father Brigadier Charley Jayawardena Amador is a renowned musician served in Royal Army. His mother was a pianist. He spent his early childhood in Kandy, after he moved to hometown Tangalle for primary education. He attended to as many as 10 schools. He first went to Little Flower Convent in Tangalle and then to St.Mathew College Dematagoda. Then he completed Advanced Level Examination from Saint Joseph's College, Colombo.\nHe was a devoted Catholic, where he never missed a Tuesday mass at St Anthony's Church, Kochchikade in Colombo. He polished his music ability as a chorister of All Saints’ Church in Borella by Reverend Father John Herath OMI.\nHe was married to Srima Abeykoon and has one daughter, Dulanjalee Chathurya Ananda and one son, Mario Angelo Ananda. His son Mario Ananda was born on 12 May 1991 and completed education from father's school, St.Joseph College. He started music career after Gratien's death to continue his legacy.\nSinging careerAnanda started to play mouth organ since the age of 3. His music ability was first identified by school music teacher Rev.Father John Herath, where Ananda started to play trumpet and then keyboard. He practiced piano under Lal Perera and Claud Fernando. Then he graduated from Royal College of Music, London with a Diploma in Western Music.\nIn 1976, Ananda started to play under different bands most notably Stanley Perera's \nFortunes\n, which became his turning point. During that time, he met musician Sarath Dassanayake and joined his orchestra to play guitar. Within the orchestra, his first played the guitar for \nH.R. Jothipala\n's \nTaj Mahalak\n song. With his extreme musical talent, he was elevated to the position of Assistant Music Director in the orchestra. Under Sarath Dasanayake and Mervin Perera, he started to learn classical Eastern Music.\nLater, he worked as the Lead guitarist for many bands including \nDreamers\n, \nEarnest and the Combo\n, \nSuperset\n and \nSeac\n for many years. He was also invited to play as a guitarist for \nVictor Rathnayake\n's \nSA Concert\n.\nHe released his first cassette in 1978. Ananda was able to sing together with \nNeela Wickramasinghe\n for a disc in 1978. His first LP Record contained four songs and all songs had been composed musically by Gration himself. With that song \nAtha Duraka Detha Pawela\n, Ananda was invited to sing as a playback singer for films. His maiden playback singing came through Sena Samarasinghe's film \nMal Kekulu\n though the duet \nBindu Bindu Kandulu Gala\n with Shyami Fonseka. After the film, he continued his enormous contribution to Sinhala cinema, where he sang for more than 400 films.\nIn 2004, he celebrated 25 years in music with a concert \nAnanda Rathriya\n at the BMICH on 25 September at 6.00 pm. The DVD of the concert was released in 2005 with the brand Torana Music Box. The DVD comprises 20 popular songs sung by Ananda.\nHis final song album was \nDesithaka Gee\n produced in year 2007 with 12 new songs. In 2009, he launched a CD at the Namel Malini Punchi Theatre on 14 February at 9 am. The CD comprises 23 songs sung at \nAnanda Rathriya\n and his son Mario also launched \nGayana Gayum\n made up of 16 tracks on the same day.\nMusic directionHe started to compose music for songs \nEtha Duraka Etha Pawela\n by himself and Neela Wickramasinghe and \nTedini Viraja\n by \nEdward Jayakody\n. Both songs became popular hits, where K.A.W Perera invited Ananda to direct music for his film \nDurga\n. With that film, he directed music for about 16 films such as \nDhawala Pushpaya\n, \nRandenigala Singhaya\n, \nSinha Patawu\n, \nHai Master\n and \nHitha Honda Gaheniyak\n.\nHe also composed music for television serials. His first tele-drama music came though \nGamana\n and \nPremada Weadi\n, both by K.A.W Perera.\nAs a lyricistAnanda composed melodies for his fellow artistes, some of them became very popular. Some of his lyrics include \nMage Punchi Kumari\n and \nMage Athita Diviya\n (Wrote by great actor Sanath Gunathilake) for \nMilton Mallawarachchi\n, \nAradhana Nethu Chaya\n and \nSudu Rosa Mal\n for \nPriya Suriyasena\n, \nMangalle Mal\n for \nChandralekha Perera\n, \nSandalatha\n for \nSanath Nandasiri\n.\nLegacyIllness and deathOn 22 December 2010, Ananda was hospitalized to receive treatments for a number of illnesses including liver failure.\nIn December 2010, Ananda died at the age of 52 while taking medical assistance at the Colombo National Hospital. He was cremated at the Borella Cemetery. Hospital confirmed that, he died at 6.45 am while receiving treatment at the Intensive Care Unit (ICU).\nPlayback singing filmographyTrack listingSolo tracksDuets"}, {"name": "Rukshan Perera", "info": "Singer", "Intro": "Singer", "Is": "Singer\nSongwriter", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "17 June 1956", "Age": "65 years", "description": "Rukshan Perera, is a Sri Lankan-born singer-songwriter, record producer, international recording, television star, and a multi-instrumentalist.Biography\n \n \n \n \n Rukshan Perera attended the Royal College, Colombo.\n \n \n \nHe was born in Colombo, to a musical family. Rukshan got his first piano lesson at age five from his mother, a well known music teacher/church organist for fifty years in Moratuwa. Rukshan became a self-taught guitarist and formed his first family band at the age of ten and performed over Radio Ceylon. He was educated at the Royal College, Colombo. As a young teenage musician, Rukshan Perera joined a group as a keyboardist whilst still a school boy at Royal College, fronted by Sri Lanka's 'King of Pop' Clarence Wijewardena and his partner Annesley Malewana. The group known as the 'Super Golden Chimes' went on to reach the heights of success in Sri Lanka. The 'Super Golden Chimes' received constant airplay over the airwaves of Radio Ceylon and subsequently the Sri Lanka Broadcasting Corporation making them household names on the island and across South Asia. He has also played with The Esquire Set, Serendib and the 'Golden Chimes' group. Rukshan plays the guitar, harmonica, piano and several other instruments. The Sunday Times newspaper in Sri Lanka noted that 'Rukshan Perera is an accomplished, highly experienced and insanely talented musician.' Rukshan Perera is a well known Jazz artist who has also mastered 'Sinhala acapellas'. The Sunday Island newspaper in Colombo observed that his (music) repertoire ranged from pop, jazz, blues to fusion and a cappella, renditions and being a multi-instrumentalist, he enthralled the audience with his virtuosity, playing guitar, piano, flute and harmonica.' He lived in the United States for almost three decades. Rukshan took a break from music, threw himself into an academic career, acquired a bachelor's degree in Information Systems, added a Masters in Business Administration, and joined the consumer product company Philip Morris as an IT Manager.\n \nAt a concert in New York sponsored by Philip Morris he played along with well-known jazz names. He was the only novice and he survived creditably and then performed on an off including a gig with the Sri Lankan bassist Hussain Jiffry. Having lived in the United States since 1980, Rukshan Perera decided to return to the land of his birth. Rukshan Perera has recorded two CD albums and performed 'live' concerts in Sri Lanka and around the world including the United States of America. He has also introduced 'harmony whistle' and 'harmony scatting,' not seen anywhere else. Whistling the melody and the harmony together is a rare talent that Rukshan possesses for which his name has even been proposed for the Guinness Book of World Records by his fans.\n Discography\n \nSingles\n \n \n\"Coming Home To You\"\n \n\"Feel Like A Butterfly\"\n \n\"I'll Keep Fighting\"\n \n\"Just For You\"\n \n\"Let's Make History\"\n \n\"Nature's Calling\"\n \n\"One Land For All\"\n \n\"Reality\"\n \n\"Something Is Happening\"\n \n\"Sri Lankan Blues\"\n \n\"What Time Is It?\"\n \n \nAlbums\n \n \nComing Home To You\n \nRukshan Perera - Live In Concert\n \n "}, {"name": "Priya Suriyasena", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "27 October 1952", "Age": "69 years", "description": "Priya Suriyasena is a Sri Lankan popular vocalist and lecturer in music who embarked on his music career through the Sri Lanka Broadcasting Corporation (SLBC) in 1972.Childhood\n \nM.L.D. Priyadharsha Suriyasena Liyanage was born to the parents of an up-country middle-class family, in Nattandiya, Puttalam district, Sri Lanka. His father is late M. L. D Jemis Liyanage and mother is late A.M. Podi Manike. He was the only son in a family of three. He had his primary education at Nattandiya Primary School and completed his GCE O/L and A/L at Madampa Central College in Puttalam district.\n \nHis father was a poet from whom he got his musical talent. Suriyasena won several prizes as a student after participating in musical programmes, such as UNESCO talent competition in which he won the first prize.\n \nAfter his A/L from 1968 to 1971 he sat for external exams conducted by the government musical college 'Heywood' and obtained a diploma in music. Afterward he embarked his career as a music teacher and recorded some of his original songs which were aired in SLBC in 1972. At this stage he shortened his name from Priyadharsha to \"Priya\", inspired by Sri Lankan Motor Racing legend Priya Munasinghe.\n Rise to fame\n \nAfter the release of his first four songs Suriyasena became a heartthrob of youngsters in the 1970s. His first four songs ('Sarathasa niwa', 'Mata wasana', 'Heta davase' and 'Andura Andura mage') were recorded for the SLBC in 1972. 'Andura Andura mage' was written by Rohana Fernando and 'Heta davase', 'Sarathasa niwa' and 'Mata wasana' by the late veteran lyricist Premakeerthi de Alwis, and the music was by Suriyasena himself.\n \nThe release of \"Sudu Parevi Rena\" (hit song) brought Suriyasena up to one of the top singers in the 1970s bringing a controversy at the time where the Sri Lankan government prohibited broadcasting the song through radio channels for a period of time.\n \nSuriyasena released one of the first music audio cassettes in Sri Lanka under the guidance of Wijewardene under the Tharanga label. His popularity was raised with the Sarasawiya Award for \"Kendan Yannam,\" a song from Sena Samarasinghe's Aethin Aethata (Movie) in 1984.\n \nIn 1996 with the album “Sunflowers with Priya”, he brought a new musical generation to the country grossing revenue over Rs. 8 million for the album and becoming the most popular singer in the country. \"Sudu Parevi Rena\", \"Ratakin Eha\", \"Jeewithe Mage\", \"Etha Ranviman, \"Kendam Yannam\", \"Neranjana\", \"Mulu Muhudama\", \"Pathum Pireela\", \"Apasu Enawa\", \"Mata Wasana\" and \"Me Paalu Mawathe\" became hits once again with the music of the famous music band \"Sunflowers\".\n \nHis hit song \"Etha ranviman\" became the most popular song in 2006, developing controversies between Suriyasena and Sirasa Super Stars.\n Career\n \nSuriyasena started his career in 1971 as a music teacher for Kelaniya Gurukula College whilst also as an on stage singer at the same time. After about 10 years of service Suriyasena left his teaching career giving priority to his music career.\n \nThe veteran music directors who conducted music for his songs were Lal Thenabadu, the late Sarath Dassanayake, Stanley Peiris, Sarath de Alwis, late Clarence Wijewardene and Ranjith Perera. Suriyasena directed music for songs such as 'Adaraniya Neranjana', 'Heta davase', 'Mata wasana', 'Sanda ma gawai', 'Mage samarum pothe', 'Ekama vidiye', 'Mohathaka suwa dena' and 'Gelawata banda wu muthu pote' (neckless tied to the neck). Some of the veteran vocalists who had their music directed by Suriyasena were M. S. Fernando, Anton Jones, Milton Mallawarachchi, Punsiri Soysa, Mervyn Perera, Gratien Ananda, late Mervyn Mihindukula, Chandralekha Perera, Freddie Silva and H R Jothipala. Priya suriyasena has composed famous Christian baila music hit dedicated to St Anthony (santha Anthony munituma) sung by Anton Jones.\n \nAt the beginning of 1990s Suriyasena was leaned towards cassette production business where he started \"Luckshitha Trade Centre\" and released cassettes of MS Fernando, Punsiri Soysa H.R Jothipala and Champa Kalhari.\n \nHe was also a play back singer in many films which were Mal kekulu in earlier 1980s, song 'Bindu bindu kandulu sala' duet with Shayami Fonseka and music directed by Sarath Dassanayake and produced by Sena Samarasinghe. Further he sang in many other films like 'Selinage Walawwa', 'Mudukkuwe Juliet', 'Hariyanakota ohama thamai', and 'Pina paduna da'. In 'Ethin Ethata' he sang a duet with Milton Mallawarachchi to the music direction of Sarath Dassanayake (\"Kandan yannan ran mal mala dala\") which won an award by \"Sarasaviya\" (Sarasavi Sammana) in the 1980s. In the film Suhada Sohoyuro he played a minor role. However, later Suriyasena gave up singing as a play back singer focusing only on stage. In 2006 he sang a duet \"Gimhanaye\" with Samitha Mudunkotuwa for the film 'Kalu Sudu Mal' as the male playback for Kamal Addaraaarachchi.\n Foreign tours\n \nHis maiden foreign tour was to Singapore in 1978. Subsequently, he made it to over 44 other countries including United States, Europe, Asia, Middle East and Australia.\n \nHe performed in Qatar, which has a significant Sri Lankan community, in October 2007.\n Personal life\n \nIn 1978 he wedded Thamara Kumari Weerasinghe who was also a music teacher with a diploma in music from Heywood. He is now a father of four children – three daughters Minoshi, Iroshi (both studying abroad), Gayashi and son, Luckshitha who is studying in the US.\n "}, {"name": "Rohan Shantha Bulegoda", "info": "Singer", "Intro": "Singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "Sri Lanka", "description": "රොහාන් ශාන්ත බුලේගොඩ\n (ඉංග්‍රීසි: \nRohan Shantha Bulegoda\n) යනු ප්‍රවීන ජනප්‍රිය ගායකයකි.රොහාන් ශාන්ත බුලේගොඩ කොළඹ නාලන්දා විද්‍යාලයයේ ආදි සිසුවෙකි.ආශ්‍රිත"}, {"name": "Milton Mallawarachchi", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "7 April 1945", "Death": "10 March 1998\n(aged 52 years)", "Family": "Children:\n\nRanil Mallawarachchi", "description": "Milton Mallawarachchi\n (1944–1998) was a popular Sri Lankan musician.Mallawarachchi sang songs by Karunaratne Abeysekera, K. D. K. Dharmawardena, Premakirthi de Alwis, Clarence Wijewardena, Upali Danawalawithana, Dharmasiri Gamage, Ajantha Ransinghe, Shelton Weeraratne, Kularatne Ariyawansa, Ananda Padmasiri, Vernon Perera, Chitrananda Abeysekera, Bandara Wijetunga and Vijaya Ramanayake.BiographyEarly life and careerMallawarachchi completed his early education at Ananda Sastralaya, Kotte. He was a member of a short-lived group called the Sakyans and subsequently the La Ceylonians. Mallawarachchi's vocals on the latter group's \"Daha Duke Vidyahala\" and \"Mal Ravamal\" led to his discovery by producer Patrick Corea. Kurera offered to record four songs with the young vocalist: \"Oruwaka Pawena\", \"Ran Kooduwak Oba Sadu\", \"Sansare Sewanalle\" and \"Mangale Neth Mangale\". These songs were released on the Exvee label as a double set of 78 rpm records in 1969 and gave Mallawarachchi his first popular hit with \"Oruwaka Pawena\". It was the last 78 rpm record set issued for non-film songs in Sri Lanka.MusicMusic composer Patrick Denipitiya gave Milton Mallawarachichi's songs such as \"Ivuru Tala\", \"Ma ha Eda\" and \"Ma Nisa Oba\" a modern touch. The song \"Sayura theredhi\" helped him to become a huge success.His first duet - \"Bindu Bindu\" - was sung with R.Chitra.In 1974, the Ceylonese musician Clarence Wijewardena composed the songs \"Gana Andure,\" \"Eda Rae,\" \"Mata Men Ohutada\" and \"Maga Thotadhii\" for an EP release on Gemstone. Wijewardena also wrote \"Awasara Natha Mata,\" \"Sulange Pawe,\" \"Thaniwi Sitinai\" and \"Prem Raja Dahane\" for Mallawarachichi.Mallawarachichi sang with Rukmani (1974) on \"Prem Raja Dahane\". On \"Pem Rajadahane\" he sang with Indrani Perera and Samitha Mudukonduwa.One of Mallawarachchi's most successful songs was \"Mai Gaha Yata\" produced by Melroy Dharmaratne in 1976. It was released on the Silverline label as an EP along with \"Ran Mudu\" and two songs - \"Andanne Epa\" and \"Ma Samanalayak\" - by Shiromie Fernando.\"Mallawarachchi released one of the first music audio cassettes in Sri Lanka under the guidance of Vijaya Ramanyake in 1978. It was titled \nAnytime-Anywhere\n and was on the Tharanga label.Mallawarachchi debuted as a playback singer in the 1971 film, \nPoojithayo\n. In 1984, he was honored with the best playback singer award at the Sarasawiya Awards for \"Kendan Yannam,\" a song from Sena Samarasinghe's \nAethin Aethat\n. He was the main male playback singer in the movie \nSenakeliya\n which was a box office hit in 1974. Its songs included \"Reyak Upadda\" and duets with Indrani Perera on \"Samanala Renak Se\" and duets with Victor Ratnayake and CD Fonseka. The music director was Patrick Denipitiya.Mallawarachchi was a popular live attraction; at a time when there was no TV in Sri Lanka, his appearances at variety shows sponsored by the Ceylon Tobacco Company drew huge crowds. Mallawarachchi appeared alongside the Super Golden Chimes at the Super Concert 101/102 organized by Wijewardene. The one last song he recorded is \"Aga Rejiniya\" on the album \nSenehasa Buduwak\n. On the first teledrama \nHima Kadalla\n Mallawarachchi sang the song \"Sanda Sulange Pawee\"He died on 10 March 1998.Personal lifeMallawarachchi was married to Swarna Mallawarchchi (not the famous Sri Lankan actress with the same name), and had four children: Ranil, Harshini, Nadija, and Tharaka. The song, \"Etha epita dura akase...swarnwarna tharuwak wilase\", written by Karunarathne Abeysekara for Mallawarachichi, is dedicated to his wife Swarna."}, {"name": "Saheli Rochana Gamage", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "8 March 1988", "Age": "33 years", "description": "Saheli Rochana Gamage\n (born March 8, 1988) is a Sri Lankan singer. She holds the title \"Visharadha\". She is noted for her popular song titled 'Ayubowan, Maharajanani' (Great King long life to you) which is devoted to the Sri Lankan President Mahinda Rajapaksa and the three Armed Forces and police who fought in the Sri Lankan Civil War."}, {"name": "Saman De Silva", "info": "Singer", "Intro": "Singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "Sri Lanka", "description": "සමන් ද සිල්වා\n (ඉංග්‍රීසි: \nSaman De Silva\n) යනු ප්‍රවීන ජනප්‍රිය බයිලා ගායකයකි.සමන්ගේ ගීත අතර \nනියරේ පියනගලා\n, \nපුංචි කුරුළු කූඩුවේ\n, \nසංතෝස වෙන්න ප්‍රීති වෙන්න\n, \nතනනිල්ල දිගේ\n, \nපුරහඳ නැගුණා\n මේ ආදී ගීත ඉතාා ජනප්‍රියය.සමන් ගායක ගායිකාවන්ගේ සංගමයේ හිටපු සභාපතිවරයා වූූ අතර එක්සත් ජාතික පක්ෂය කලා සංසදයේ ජාතික සංවිධායක ද විය. සමන් ද සිල්වා පසුගිය බස්නාහිර පළාත් සභා මැතිවරණයේ දී එජාපයෙන් කොළඹ දිස්ති‍්‍රක්කයට ද තරග කෙළේය.චිත්‍රපට හා ටෙලි නාට්‍ය නළු ගාමිණී හෙට්ටිආරච්චි නාලන්දාවේ මොහුගේ සම කාලිනයෙකි.සමන් සංගීත සංදර්ශන සඳහා සමන් ලොව පුරා බොහෝ රටවල් සංචාරය කර ඇත.සමන් ද සිල්වා කොළඹ නාලන්දා විද්‍යාලයයේ ආදි සිසුවෙකි."}, {"name": "Tharanga Goonetilleke", "info": "Sri Lankan operatic soprano", "Intro": "Sri Lankan operatic soprano", "Is": "Singer\nOpera singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "Badulla", "description": "Tharanga Goonetilleke is a soprano opera singer who was born in Badulla, Sri Lanka, but grew up in Ratmalana. Her singing ability was noticed by a music professor from Converse College while he was visiting Sri Lanka. She is the first woman from Sri Lanka to attend the Juilliard School, one of the world's leading music schools. She currently lives in New York City, and her career in opera has received international attention.Education\n \nGoonetilleke began learning to sing in Sri Lanka at the age of 12 under the training of Christine Perera. She began attending Converse College in South Carolina in 2001 and graduated in 2005 with Bachelor of Music degree in Vocal Performance and a minor in biology.\n \nRepresenting South Carolina, she entered the Metropolitan Opera National Council Auditions and won. Impressed by Goonetilleke's performance, the judges, who happened to be from the Juilliard School, asked her whether she had considered attending graduate school. Consequently, she decided to apply for admission to Juilliard, and in 2005, she was the first Sri Lankan woman to be admitted to the Juilliard School and was provided a full tuition scholarship. Her living expenses were covered by President's Fund of Sri Lanka. She graduated from Juilliard with a Master of Music in Voice and Opera.\n Career\n \nIn 1998, Goonetilleke made her singing debut with the Symphony Orchestra of Sri Lanka (SOSL), after winning the SOSL concerto vocal competition in 1998. In 2010, she became a member of New York City Opera, and has since performed in numerous operas such as \nIl trittico\n, \nDialogues of the Carmelites\n, \nLa bohème\n, \nDie Zauberflöte\n, \nIphigénie en Aulide\n, and \nAriodante\n. She has also performed in concerts in the United States, Europe, India, and South Korea. Her 2011 concert tour in India was considered \"timely\" by the Sri Lankan High Commission in India since it helped foster a cultural dialogue between the two countries.\n Personal life\n \nGoonetilleke grew up in Ratmalana, Sri Lanka, near the capital Colombo. She first became interested in opera when she was thirteen when she heard soprano Kiri Te Kanawa sing. However, she did not think at that time that opera was a career option. A music professor from Converse College, Douglas Weeks, was visiting Sri Lanka and heard her sing; he subsequently arranged for her admission to the college. She had planned to study medical science in Sri Lanka, but to her surprise, when her father found out about the offer for her to attend Converse College, he thought it was a good idea.\n \nHer younger sister Eranga also attended Converse College and afterward obtained her master's degree in Opera and Musical Theater from Southern Illinois University; she is currently a faculty member at Converse College's Lawson Academy of the Arts. Goonetilleke is married, has a daughter, and lives in New York City.\n "}, {"name": "Yolande Bavan", "info": "Sri Lankan actress and singer", "Intro": "Sri Lankan actress and singer", "Is": "Actor\nSinger\nJazz musician", "From": "Sri Lanka", "Type": "Film, TV, Stage & Radio\nMusic", "Gender": "female", "Birth": "1 June 1942", "Age": "79 years", "Star sign": "Gemini", "description": "Yolande Bavan (born June 1, 1942 in Ceylon) is a singer and actress.\nShe toured Australia and Asia as a performer with Graeme Bell's band early in her career. She is best known for replacing Annie Ross in the legendary jazz vocal group Lambert, Hendricks & Ross after Ross was forced to leave the group due to poor health in 1962. She recorded three albums, all live recordings, with the group under the name of Lambert, Hendricks & Bavan. In 1964, she and Dave Lambert left the group, effectively ending the trio. She appeared on \"To Tell the Truth\" in 1962 and in a rare feat, the singing group appeared and sang \"This Could be the Start (of something big).\"\nIn 1969, Peter Ivers and Yolande Bavan made an album for Epic Records, called Knight of the Blue Communion. Bavan also provided vocals for Weather Report's 1972 album I Sing the Body Electric, and has made several recorded appearances in musicals including Salvation, Snow White and the Seven Dwarfs, and Michael John LaChiusa's Bernarda Alba. She has also made appearances in such films as Parting Glances, One True Thing, and Cosmopolitan, as well as performing in many plays."}, {"name": "Mercy Edirisinghe", "info": "Singer", "Intro": "Singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "1945, Ambepussa, Sri Lanka", "Death": "17 March 2014, Gampaha, Gampaha District, Western Province, Sri Lanka\n(aged 69 years)", "Instruments:": "Voice", "description": "Mercy Edirisinghe\n (18 December 1946 – 17 March 2014) was an actress in Sri Lankan, cinema, theater and television as well as a singer. She began her singing career in 1964 from the 'Nawaka Madala' song contest and became a stage actress in 1966. Her most famous play was a musical by \nLucien Bulathsinhala\n, titled Tharavo Igilethi (Ducks fly). Composed by \nGunadasa Kapuge\n, 'Made Lagina Tharawan' from the soundtrack of the play became her most successful original song. She is also well known for her role in numerous comedic television shows and radio dramas, the most famous of which is a radio program titled 'Vinoda Samaya', in which she acts alongside Annesley Dias, Berty Gunathilake and Samuel Rodrigo.\nLife and careerMercy Edirisinghe was born to Grace Perera and Don Lorenzo Elvin Edirisinghe, a typesetter at the Department of Examinations. Mercy, a Catholic, was the third child in a family of nine.\nHer late husband, Lalith Kotalawela was a Buddhist from Kalutara. The couple had no children. Her devotion to her fans was such that just after her wedding she acted in the stage drama 'Muthu Kumari' at the Lumbini Theater on her way to her honeymoon. In 1966, she first entered the world of stage drama in Welikala Ratne's 'Ugurata Hora Beheth'. She had acted in numerous other stage dramas including 'Ran Kanda' and 'Seelavathi'. Over the years, she had built a solid reputation not only as a talented actress and singer but also as a comedian.\nDeathTwo years prior to her death, she underwent gynaecological surgery, and had been suffering from numerous hip/back pains since then. She died at a private hospital in Gampaha on 17 March 2014, aged 68.\nAwards and honorsIn 1974, Mercy won the Best Actress Award at the State Drama Festival for her role in R.R. Samarakoon's stage drama 'Idama'. She won two other Best Actress awards in 1975 and 1976. 2014 was to mark the 50th anniversary of her career and in recognition of her service to the arts, she was to be honored with a Lifetime Achievement Award at the 2014 State Drama Festival.\nStage dramaRadioMercy was a very popular voice in Sri Lankan radio drama.\nMusic albums"}, {"name": "Nihal Nelson", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "Moratuwa, Sri Lanka", "Instruments:": "Voice", "Profiles": "", "description": "Nihal Nelson\n is a Sri Lankan baila singer. He is from the Moratuwa region and has released over 100 albums.\nNelson's first recording \"Lassanata Pipunu Wanamal\" was released on EP on March 31, 1963. He was among the first Sri Lankan vocalists to release a cassette in 1978 with \nGune Ayyage Kamare\n. The release was on Wijaya Ramanayake's Tharanga label which introduced the format to Sri Lanka. Nelson was also among the first to release a compact disc.\nNelson's hundred and tenth album \nNihal 110 Dot Com\n came out in 2000. It was recorded at Sunflowers Studios in Mahawewa, Chilaw with conduction by Neil Warnakulasooriya and music by the Sunflowers (band). Nihal Nelson School is Moratu Maha Vidyalaya Moratuwa\n\n\n"}, {"name": "Dinesh Kanagaratnam", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer\nMusician", "From": "India\nSri Lanka", "Type": "Music", "Gender": "male", "Birth": "21 February 1987, Modara, Sri Lanka", "Age": "34 years", "Star sign": "Pisces", "Instruments:": "Voice", "description": "Aaryan Dinesh Kanagaratnam\n (born 29 August 1981), also known by his initials \nA. D. K.\n or simply \nDinesh Kanagaratnam\n, is a Sri Lankan R&B and hip hop artist and music producer who has composed tracks in Tamil language. He also often collaborates with music directors in Tamil cinema as a playback singer.\nEarly life and careerDinesh was born and raised in Badulla, Sri Lanka. He studied information technology (IT) in Trichy, Tamil Nadu, India and started teaching IT courses in Sri Lanka. He began working with local musicians part time to pursue his growing interest in music. In 2004, he was given a chance by Bathiyan, an artist in Sri Lanka and started recording rap songs until he was discovered by \nVijay Antony\n. He collaborated with him for the song \"Aathichudi\" for the soundtrack of the film \nTN 07 AL 4777\n (2008) in 2009 which is a remake of Surangani, a song from his first independent album, Tamizha Back in Sri Lanka, he did a cross-culture album in 2005 which includes songs in Tamil, Sinhala and English.\nHis next throughout in cinema industry was \"Magudi\", which was his first collaboration with \nA. R. Rahman\n for the \nMani Ratnam\n-directed film \nKadal\n (2013). He was featured along with \nAnirudh Ravichander\n for the song \"Mun Sellada\" in the film \nManithan\n (2016), composed by \nSanthosh Narayanan\n.\nKanagaratnam and rapper Sri Rascol formed a record label called Rap Machines and have done other rap musics.\nHe continued to work in Tamil and Telugu cinema, writing and performing English language rap for soundtracks, including the title track \"Maayon\" in \nMersal\n (2017) composed by \nA. R. Rahman\n, the song \"Gala Gala\" featured with \nMegha\n from Race Gurram composed by \nS. Thaman\n and also a background score (which had been deleted later) in Nerkonda Paarvai. He also worked in \n2.0\n (2018).\nKanagaratnam has joined concert tours in Sri Lanka, the Middle East, India, Malaysia and Singapore. He is well known for his rap battles at every A. R. Rahman concert tours alongside \nLady Kash\n and \nBlaaze\n. On January 2019, Kanagaratnam performed with Bathiya and Santhush at \nOba Nisa\n in Sri Lanka.\nDiscographyIndependent tracks & albumPlayback singing"}, {"name": "Keerthi Pasquel", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "1955, Kandy, Sri Lanka", "Age": "66 years", "Education": "Dharmaraja College", "Genre:": "Pop music", "Instruments:": "Voice", "description": "Keerthi Pasquel\n (Sinhala: කීර්ති පැස්කුවල්: born 1956) is a pop musician from Kandy, Sri Lanka. He has been performing for more than three decades and has won a number of awards. He has been active in music education and in social welfare.\nAwardsPasquel has won many awards in Sri Lanka. In 1996 he received an international award from the World Science Council in Japan, where he competed with musicians of repute from 13 countries.\nOrphanage projectKeerthi launched a project called 'The Child' to entertain children from orphanages and to recognize their capabilities. In 2005, 'The Child' collected sponsorship funds that mainly went towards the rehabilitation of the orphaned children from the Boxing Day Tsunami of 2004. This is an ongoing project by Pasquel, organizing not only musical shows, but also dramas, films and amateur talent shows.\nPasquel Sound of MusicKeerthi was the founder of the 'Pasquel Sound of Music' in 2006, a school to teach voice training and instrumental music for those who wish to be professionals in the music industry. At 'Pasquel Sound of Music', established musicians train students to play a musical instrument. Tutors have included Harsha Makalande, Chandrasena Hettiarachchi and Pasquel himself.\n"}, {"name": "Sunil Perera", "info": "Sri Lankan singer-songwriter", "Intro": "Sri Lankan singer-songwriter", "Is": "Singer\nSongwriter", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "14 September 1952", "Age": "69 years", "Star sign": "Virgo", "Education": "St. Sebastian's College, Moratuwa", "description": "Sunil Perera\n (born 14 September 1952) is a Sri Lankan vocalist, guitarist, songwriter and composer. He is the leader and the lead vocalist of the popular Sri Lankan band, Gypsies.\nEarly lifeBorn in 1952 Sunil Perera completed his education at St. Sebastian’s College, Moratuwa and St. Peter’s College, Colombo. He was a member of the school band.\nCareerIn 1969 as soon as he left school, Sunil joined the band The Gypsies. The band was formed in 1969 by his father, Anton Perera, a confectioner at the Glucorasa company.\nSunil Perera was the main vocalist of the band. Their first hit \nLinda Langa Sangamaya\n was released in 1972/1973. Other tracks sung by Sunil Perera include, None Mage Sudu None (1977), Lunu Dehi (1987), Kurumitto, Oye Ojaye (1989), Pity Kotapan None and Signore (1997).\nSunil remains one of the most famous singers in the country, while his band Gypsies remains one of Sri Lanka’s biggest musical franchise for the past three decades, with regular foreign tours, several hit albums and sold-out concerts.\nSunil Perera's recent works such as \nI don't know Why\n addresses mere sociopolitical issues through humor. Several of his songs have been banned by the state media.\nIdeologySunil Perera recently came up with his own ideology about the sociopolitical situation in the country. He is highly critical towards Sri Lankan society and politics.\nPersonal lifeSunil is married to Geetha Kulatunga and has two sons and two daughters. He also has grandchildren.\n"}, {"name": "Anthony C. Perera", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "13 September 1921, Chilaw, Sri Lanka", "Death": "20 May 1988, Ja-Ela, Sri Lanka\n(aged 66 years)", "Star sign": "Virgo", "description": "Mahapatabadige Anthony Crisman Kivlojiyas Perera\n (born 13 September 1921 – died 20 May 1988 as \nඇන්තනී සී. පෙරේරා\n) [Sinhala]), popularly as \nAnthony C. Perera\n, was an actor in Sri Lankan cinema and theater. One of the earliest pillars in Sri Lankan film history, Perera also worked as a singer, screenplay writer and director in his career that spanned more than four decades.\nPersonal lifePerera was born on 13 September 1921 in a small village of Mahawewa Vee Hena, Chilaw, in Puttalam as the eldest of the family. His father Mahapatabedige Logus Perera was born in Tudella, Ja-Ela, who worked as a plantation administrator. His mother was Warnasuriyage Theodora Tissera. He entered Mahawewa Junior School for primary education and then moved to Tudella Roman Catholic College (currently known as Christ King College, Tudella) for further education. Then with his father's transfer to a new plantation in Kurunegala, Perera shifted to Budupitiya Roman Catholic School which was about 7 miles from Kurunegala.\nPerera has one younger brother, Wilfred and one younger sister, Beatrice. Wilfred later became a distinguished teacher at St. Benedict's College, Kotahena and produced several popular figures, including; \nVijaya Kumaratunga\n, \nRavindra Randeniya\n and \nRobin Fernando\n.\nHe was married to Modarage Mary Vaas. The wedding was celebrated in 1953. The couple has five daughters - Menaka, Deepthika, Gaurika, Chaudry, Sherine - and two sons - Rohana and Emil. His elder son Rohana died at young age by an accident.\nPerera died on 20 May 1988 at the age of 66 and buried in Thudella Cemetery, Ja-Ela.\nCareerAfter finishing school career in brief years, his moved to his ambition to be an actor. Anthony went to find Laddie Ranasinghe to be a stage actor and joined with Ranasinghe's Arcadians Drama Team. Meantime, Laddie introduced Perera to one of his colleagues, P.D.S. Kularatne, who worked as the principal of Ananda College, Colombo. Kularatne has set up a theater club called \"National\" in Maradana and he joined Perera for his newest drama \nAewessa Bena\n.\nHowever after that play, he refused to act in further and applied to the Ceylon Army and Race Horse. He received calls to come to both on the same day.\nIn 1942, Perera got the opportunity to join the British Army. For five and a half years, Perera fought with the forces of the Allies against the enemy in the jungles of the desert. After returning to Sri Lanka, then he joined the public service. He worked in Kurunegala Kachcheri for a brief period and then joined as an agent for Brookbond Company, Colombo. There he joined the 1953 Hartal to seek professional rights. He was a hard leftist at the time. Due to the continuous Hartal, Brookbond manager transferred Anthony to Negombo branch of the company. He also worked as the production manager of Vijaya Studios in Hendala.\nAfter many years in civil service, Perera met one of his friends, H. M. L. Tissera, who owns Ratnavali Cinema, Ja-Ela. Tissera introduced Perera to K. Gunaratnam, who owns Cinemas Film Corporation. During that time, Perera met \nHugo Fernando\n and got the opportunity to act in the film \nSuraya\n co-directed by Indian filmmakers S. V. Krishna Reddy and T. R. Sundaram. Then he acted in many popular films such as \nWana Mohini\n, \nSandesaya\n, \nWeera Vijaya\n and \nRanmuthu Duwa\n. He has acted more than 70 films across many genre from character roles to comedy roles. In 1965, Perera introduced Sonia Disa into Sinhala Cinema.\nHe acted many comedy roles in films \nHathara Denama Surayo\n, \nEdath Suraya Adath Suraya\n, \nAllapu Gedara\n, \nChandiya\n and \nSingapore Charlie\n. He acted in five different roles in the film \nHondama Welawa\n. He starred in the film \nSingapore Charlie\n wearing a wig and also worked as the dialogue writer. In , he made screenplay, story and dialogue was written and directed the film \nHondin Inna\n. After 1977, he did not receive many films. During this free period, he enjoyed reading Paddle Chase novels. In 1986, he produced the stage play \nYama Lowa Peraliya\n.\n"}, {"name": "Latha Walpola", "info": "Play-back singer", "Intro": "Play-back singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "11 November 1934, Wellawatte-Galkissa Electoral District", "Age": "87 years", "Star sign": "Scorpio", "Family": "Spouse:\nDharmadasa Walpola", "Instruments:": "Voice", "description": "\nDeshamanya Matharage Rita Genevieve Fernando, better known by her stage name \nLatha Walpola\n (Sinhala: \nලතා වල්පොල\n), is a prominent Sri Lankan vocal artist. It was as a member of a church choir that Walpola began a career that led to her becoming one of Sri Lanka's premier singers of her day. Today her fans often refer to her as \"The Nightingale of Sri Lanka\"\nPersonal lifeWalpola was born on 11 November 1934 in Galkissa Colombo, to Joseph Fernando and Elizabeth Muriel. She was one of five children. Her mother, a teacher, encouraged her daughter to become a vocal artist. \n Walpola received her primary education at St.,Anthony College in Dehiwala-Mount Lavinia, wherein she led the church choir.\nShe married \nDharmadasa Walpola\n in 1959, later becoming known as Latha Walpola. A ceremonial wedding was held at Siri Kotha, Kollupitiya with a large gathering of guests and artists. The local police had to deploy extra men to control the massive crowd gathered outside Siri Kotha. The couple have three sons and a daughter. In the 1960s and early part of the 1970s, the couple became very popular.\nCareerLatha Walpola just was 12 years old when she was introduced to the country by Radio Ceylon as a member of Radio Ceylon's Choir in 1946. C.A. Fonseka, a family friend and radio, dramatist, brought her to Radio Ceylon to perform in his Sarala Gee programme with his son C.D. Fonseka.\nIn 1947 Walpola sang her first solo song, \"Kandulu Denethe Vehena\", with lyrics by Sarath Wimalaweera and music composed by Vincent de Alwis, the resident violinist at Radio Ceylon. She then began to sing under the direction of \nMohammed Gauss\n, P.L.A.Somapala and B.S.Perera, with these famous musicians incorporating her high-pitched tone into their musical creations. By 1950 she was a well known female singer in the country, covering the songs \"Sukomala Banda Lelawa\", \"Dunhinda Helena\" and \"Diyaluma Helena\", originally sung by Chitra Somapala. Walpola has recorded for both the Columbia and HMV record labels. The song \"Malbara Himidiriye Pipune Esala Araliya Mala\", sung with \nC.T. Fernando\n, is one of her most popular songs.\nContribution to Sinhala CinemaIn 1952 she made her first contribution to the Sinhala Cinema as a play back singer for the film, \"Eda Rae\", which was released in 1953, working on three other films during the same year. She was able to make her debut in playback singing for three films with \nDharmadasa Walpola\n during the same year. By 1958, Walpola had contributed to 22 films, going on to provide song tracks for nearly 600 films during her career.\nAwards.Walpola was honoured by thenSri Lankan Government with the award of Kala Suri in 2005. In 2017 she was awarded the 2nd highest civil award, \"Deshamanya\", by the Sri Lankan Government. She has won the Sarasaviya Award, the most prestigious award presented to distinguished individuals involved with the Sinhala cinema, four times. She has also won:\nNotes.References."}, {"name": "Ramesh Weeratunga", "info": "Sri-lankischer Musiker", "Intro": "Sri-lankischer Musiker", "Was": "Songwriter\nSinger", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "1951, Colombo, Colombo District, Western Province, Sri Lanka", "Death": "18 June 2017\n(aged 66 years)", "Instruments:": "Voice", "Profiles": "", "description": "Ramesh B. Weeratunga\n (* 30. November 1951 in Colombo; † 18. Juni 2017) war ein sri-lankischer Sänger und Songwriter, Musikproduzent, -komponist und Sounddesigner.\nWeeratunga wanderte im Alter von 20 Jahren nach Berlin aus, wo er jahrelang als Sänger auftrat. Er mischte seinen indischen Stil mit westlichen Elementen aus Jazz und später aus dem Pop-Genre. Später gründete er die Band Feel Wheel, mit der er das Album \nThe Beauty of our Madness\n aufnahm, das er zusammen mit \nUdo Arndt\n produzierte. Einige von Weeratungas Liedern wurden später von Stars wie \nSally Oldfield\n, \nJustin Hayward\n, \nVeronika Fischer\n und \nUlla Meinecke\n gecovert.\n1990 nahm Weeratunga sein erstes Soloalbum namens \nOpen Wide\n (Polydor) auf. Im Jahre 1993 begann er eine Zusammenarbeit mit dem New Yorker Schlagzeuger Kenny Martin unter dem Namen Electric Rama, unter dem beide das Album \nGo Deeper\n (Traumton Records, 1996) veröffentlichten. Sein nächstes Projekt \nThe Visitor\n (Laika) zusammen mit Sangeeta Bandyopadhyay und Mr Hempala Perara erreichte die Top 20 der World Charts. Seine letzte Veröffentlichung ist das Album \nTwo People\n (Bluebird Café Berlin Records, 2015)\n"}, {"name": "Dasun Madushan", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "25 October 1996", "Age": "25 years", "Star sign": "Scorpio", "description": "Dasun Madushan\n (born 2 January 1996), is a Sri Lankan singer. He finished in first place on the fifth season of \nSirasa Superstar\n, a singing competition in Sri Lanka similar to \nAmerican Idol\n. He is the youngest ten millionaire of Sri Lankan reality-TV history, which he received when he won the Superstar season 5 – The Next Voice on grand final at Sirasa Stein Studios on 15 June 2013.He was a student of Prince of Wales' College, Moratuwa. His father Karunarathne Wickramasinghe is a retired Policeman, and his mother Rohini Jayalath, is a housewife. He studied G.C.E Advanced Level from Art subjects in the school.He was the stage announcer of Sirasa Superstar season 6 – Hayawana Katahada (6th voice). Also, he was featured on and vocalized the theme song of Sirasa Superstar, Season 6.In 2017, he was arrested at London Heathrow Airport with 2 kg of cocaine.Early life and backgroundDasun was born on 25 October 1996 to Karunarathne Wickramasinghe and Rohini Jayalath. His father, Karunarathne Wickramasinghe, is a retired policeman. He has one elder brother, Kasun Madushanka, who is also a singer, came from same reality show Sirasa Superstar season 4, finished as 12th.Music lifeDasun took part in Shihan Mihiranga's group in the contest and was a lead role in Shihan's team. Some of these songs, such as : \"Sinhayo\", \"Menik Apsaravi\", \"Pransha Yuwathiyan\", \"As deka Piyaana\" were well received.His first song is the \"Swapna\" teledrama theme song, sang with Sirasa Superstar season 3 winner Shanika Madumali. Then he debuted his first solo songs \"Ansathu Wee\" and \"Mage As Walin\"."}, {"name": "Kharesma Ravichandran", "info": "Indian singer", "Intro": "Indian singer", "Is": "Singer", "From": "United Kingdom\nSri Lanka", "Type": "Music", "Gender": "female", "Birth": "8 May 2000, London, UK", "Age": "21 years", "Star sign": "Taurus", "Instruments:": "Voice", "description": "\nKharesma Ravichandran\n (born 2000) is a British playback singer. She did her 1st public performance at the age of 4 for British heart foundation singing \"We are one\" from Lion King Musical. She is a professionally trained western vocalist and began her playback singing career in 2014.\nShe debuted as a Playback singer with the Tamil film “Yennai Arindhaal” at the age of 14. She has also done jingles for products such as Chick king, Super market chains, Jazz cinemas.\nEarly lifeKharesma Ravichandran was born and brought up in the UK where she began her love for music. She is currently doing Grade 8 in Vocal and Grade 5 in Piano for the Trinity College London - Music. She lived in Sri Lanka, studying at the Elizabeth Moir School and is now studying a BMus in Music at Royal Holloway, University of London.\nCareerIn 2011, she moved to India where she began learning Hindustani and Carnatic music. She started for jingles for ads such as Chicking, Alsa Mall, Impulse Perfume etc.\nShe started her career as an Indian Playback singer for a \nGautham Vasudev Menon\n film \"Yennai Arindhaal\" with the song \"Yaen Ennai\" composed by \nHarris Jayaraj\n. She rose to fame from her song \"Kadhal Cricketu\" in the film “Thani Oruvan” composed by Hiphop Tamizha Aadhi and Jeeva. Kadhal Cricketu topped the Indian iTunes Chart and many radio stations in Chennai and other Tamil speaking channels all over the world for several weeks. Her next song \"Party with the Pei\" in Aranmanai 2 by \nSundar C\n, composed by Hiphop Thamizha. This song also topped the Apple iTunes and radio charts for a few weeks.\nSince then, she was nominated for the \n63rd Filmfare - Best Female Singer Award\n, SIIMA 2016 for Best Playback singer and Edison Awards 2016.\nKharesma has also sung the theme song for a Nepali TV show \"PS Zindagi(\n1\n)\"\nDiscography"}, {"name": "R. Muttusamy", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Musician\nSinger\nComposer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "5 January 1926", "Death": "27 June 1988\n(aged 62 years)", "description": "Ramaya Muttusamy (January 5, 1926 – June 27, 1988) was a prolific Sri Lankan music director and singer. He handled the music for most of K. Gunaratnam's productions.\nMuttusamy was born on January 5, 1926, in Nagercoil, Tamil Nadu, India, the only son of virtuoso Malayali musician Ramaya Baghwather. At a young age, Muttusamy was introduced to the violin and mastered the instrument by the age of ten.\nMuttusamy worked as the Assistant Music Director on the first Sinhalese film Kadawunu Poronduwa in 1941 under the tutelage of R. Narayana Iyer. He subsequently travelled to Sri Lanka and found work there as a member of the state-run Radio Ceylon's Tamil Orchestra (October 20, 1952) and then with the Sundera Murugan Studio in Kandana built by producer Nayagam (1953).\nEnlisted by successful producer K. Gunaratnam, Muttusamy handled his first lead music direction for the 1953 Sinhalese film Prema Tharangaya. In the film he directed the Sinhalese playback singers Dharmadasa and Latha Walpola on what would be their debut as well. Subsequently he oversaw the direction for over 225 films including Ahankara Sthree (1953), Mathalang (1955), Sandesaya (1961), Allapu Gedera and Chandiya (1965) working with playback singers like the Walpolas, Mohideen Baig, J. A. Milton Perera, H. R. Jothipala, Angeline Gunatillake, Sujatha Attanayake, G. S. B. Rani Perera and Narada Disasekara.\nMuttusamy was awarded an honorary Sri Lankan citizenship in June 1956 by prime minister Sir John Kotelawala. He rejoined Radio Ceylon in 1958 and served with the organization until 1981.\nMuttusamy married the Sinhalese B. D. E. Neeliya Perera on October 7, 1961, and had four children, Mohanraj, Chitrangi, Prasanna Vadhani and Keerthika. Mohanraj would follow in his father's footsteps pursuing a career in music. Muttusamy died on June 27, 1988."}, {"name": "Victor Rathnayake", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "18 February 1942", "Age": "79 years", "Profiles": "", "description": "Victor Rathnayake (Sinhala:වික්ටර් රත්නායක; born 18 February 1942) is a popular Sri Lankan musician. He was the first Sri Lankan musician to hold a live one-man concert; His concert known as \"SA\" was first performed in 1973, and was an instant success. Rathnayake credits his success to his \"fitting blend of Western music with Ragadari classical music.\" His songs deal with diverse themes that vary from love, to patriotism and Buddhism.\nMatara Achchi is the first film he composed music for and its Sandakada Pahana song sung by Sunil Edirisinghe is still very popular among Sinhala music fans. Rathnayake also has composed music for films like Siribo Aiya, Podi Malli, Sarungale, Hulawali and Athuru Mithuru. \nLife and career\n \nEarly life\n \n \n \n \n Ratnayake at a recent musical show\n \n \n \nRathnayake was born in a small village near Kadugannawa. His father, Rathnayake Veda Mahaththaya, was an apothecary and sang \"noorthi gee,\" a type of Sinhala folk songs. Victor got his first instrument at the age of nine when his father presented him a harmonium for his birthday. He studied singing and various instruments under musician Cyril Perera at the M.G.P. Institute in Mulgampola in his teens. In 1963, he began attending the State Music College, now known as the Institute of Aesthetic Studies. He wrote his first song, an ode to Lord Buddha, in 1964; it received play on radio stations run by the Sri Lanka Broadcasting Corporation.\n \nIn 1966, Rathnayke joined the Ministry of Education as a music instructor, and was assigned to a post at Eththalapitiya Maha Vidyalaya in Bandarawela. He would later look back to his days as a teacher in his song \"Sihil Sulang Ralle,\" which described the beauty of his surroundings that he noted as he travelled on the train to the school. The lyrics were penned by Sena Weerasekera on Rathnayake's recollections.\n \nSa\n \nBy 1973, Rathnayake was a trained musician and noted that there were no one man concerts. The closest was \"Shravanaradhana\" a joint concert by Amaradeva and Nanda Malini. On the urging of his friends Premakirthi de Alwis, Sunil Ariyaratne, K.D.K Dharmawardena, R.R. Samarakoon, Chintana Jayasena and Bandara K. Wijetunga, Victor decided to attempt such an event. The first Sa concert was held on July 20, 1973, at the Lumbini Theatre, Havelock Town. It is widely considered a turning point in Sri Lankan music.\n \n \n \n \n Ratnayake performing in his \"Sa\" concert\n \n \n \nThe name \"Sa\" came from the root or tonic note sa in the Indian music scale and was suggested by Chintana Jayasena. Jayasena pointed to the fact that no Sri Lankan drama, film or work of art bore a name of just one syllable at the time and believed that it would bring luck.\n \n\"Sa\" was highly popular, and Rathnayke's gained many fans following its inception. One female fan wrote \"Do you know that I treasure 49 hairs of yours?\" in a fan letter, expressing how many times she has seen Rathnayake's show. Critics described the show as \"exquisite insanity\" and a \"melodic lunacy\" because of the fervor shown by Rathnayke's fans, who would sometimes attack auditoriums where he was playing when they couldn't get in.\n \nRathnayake's style was influenced by musicians like Sunil Shantha, Ananda Samarakone and C. T. Fernando who he considered \"pioneers in the music field\" for their use of \"classical Ragadari and Hindustani music\" as their starting point.\n \nRecent Events\n \nRathnayake continues to be a popular musician in the 2000s; After 39 years of success in Sri Lanka and in many other countries, Victor finally ended the concert on July 20, 2012 at the Lumbini theater where it started with the 1450th concert. His latest album 'Nil Kandu Yaaya' was released in 2012 February.\n \nHe performed live at the BMICH on 13 December 2014 for an event, \nVictor Adasiyawasa\n, organized by his fans.\n "}, {"name": "Sanath Nandasiri", "info": "Musician", "Intro": "Musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "15 February 1942", "Age": "79 years", "description": "Professor \nSanath Nandasiri\n (Sinhalese: \nසනත් නන්දසිරි\n; born February 15, 1942 in Gothatuwa, Sri Lanka) is a critically acclaimed Sri Lankan classical musician. He is the current Chancellor of the University of the Visual and Performing Arts in Sri Lanka. President Maithripala Sirisena appointed Nandasiri after the death of Pandith Amaradewa.Nandasiri has received several awards for his compositions; he composed the music to \nSandamalige Kathawa\n, the first TV serial on Rupavahini.Life and careerEarly life and educationNandasiri was born to businessman and building contractor, H.M. William Perera and Dona Amalin Katugampola. He attended two schools concurrently as an adolescent (Mahabodhi Maha Vidyalaya,Gothatuwa Maha Vidyalaya and St. Matthew’s College, Dematagoda, where he studied English).Nandasiri first appeared on Sinhala Radio at the age of 13 in 1955. He began studying the tabla instrument under D.R. Peiris soon after. In 1960 Nandasiri travelled to India to continue his studies at Bhatkhande Music Institute. His teachers at the academy included Ustad Ahmed Jan Thirakwa, G.N. Nattu, Ustad Mokshut Ali, Pandit Hari Shankar Misra and Ustad Rahimmuddeen Khan Daga.While in India, Nandasiri composed several songs that appeared on Lucknow radio. He returned to Sri Lanka in 1974 and joined the staff of University of Kelaniya as a lecturer. Nandasiri served as the head of music at the university from 1988 to 1992.Nandasiri took the Part I examination in vocal music and obtained first class at the \"Nipun\" examination in 1992 becoming the first Sri Lankan to achieve this task. He was appointed Chancellor of the Music Faculty at the University of the Visual Arts and Performing Arts in 2016.Personal lifeNandasiri married singer Malkanthi Peiris in 1971. They collaborated on songs before and after their marriage. Nandasiri's daughter Anuradha was born February 14, 1974.Anuradha, also a musician, is currently back in Sri Lanka with her husband Nirosha Bandara."}, {"name": "Sunil Edirisinghe", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "19 December 1949, Colombo, Colombo District, Western Province, Sri Lanka", "Age": "71 years", "Profiles": "", "description": "Patikirige Sunil Jayapreethi Edirisinghe\n (Sinhala:සුනිල් එදිරිසිංහ) (born December 19, 1949 in Colombo, Sri Lanka) is a critically acclaimed Sri Lankan classical musician. Edirisinghe won the presidential award for playback singing in 1983 for \"Maya Miringuva Pirunu Lo Thale\" from \nAdhishtanaya\n. He was awarded the Swarna Sankha Award for playback singing in 1988 for \"Thurulaka Hurathal\" from \nMangala Thagga\n and in 1990 for \"Walakulak Gena Muwa Karamu\" from \nSaharave Sihinaya\n. He has also won the Sarasaviya Award for playback singing in 1988 for \"Thidasa Pure\" from \nSandakada Pahana\n and in 2002 for \"Poronduwa\" from \nPoronduwa\n.Life and careerEarly lifeEdirisinghe was born the youngest of seven children to Patikirige Edirisinghe and Ushettige Elizabeth Perera; he grew up in Waragoda Kelaniya amongst a blooming rubber industry.Edirisinghe began his schooling at Sri Dharmaloka Vidyalaya in 1955. He moved on to Sapugaskanda Maha Vidyalaya in 1968 and subsequently Delgoda Kalyana Pradeepa Pirivena where he studied for his A/L examamination.Musical careerAfter completing his secondary education in 1969, Edirisinghe began working for the Government Printing Corporation. He debuted as a playback singer that year singing \"Sandakada Pahana\" for his brother Satischandra's film \nMatara Achchi\n. The song was composed by Victor Ratnayake and written by Wally Nanayakkara.Edirisinghe studied music at Visharada P.V. Nandasiri's Academy of Music and University of Laknaw, India in the early 1970s. In 1975 Edirisinghe graduated with first class honors from the prestigious Bhathkhande Academy of Music in India. He joined the Sri Lanka Broadcasting Corporation soon after. In 1980 Edirisinghe released his first cassette \nChandra Mandala\n.Personal lifeEdirisinghe has six siblings. The eldest Dharmasri was involved in fine arts. His sister Mercy was a music teacher; his brothers Satischandra and Nimal went into film.Edirisinghe met his future wife Nandani \"Kumudu\" Munasinghe on a visit to Kandy. They were married in 1979 and had their first child Sankha Chamindra Edirisinghe the following year. In 1985 their daughter Sankani Edirisinghe was born."}, {"name": "Ajith Bandara", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "description": "Ajith Bandara is a Sri Lankan singer. He is popular in the country for winning the first season of the singing contest Sirasa Superstar in 2006. His first album was \"Thilaka Thiyanna\". The album was launched in Sugathadasa Indoor Stadium in Colombo.\nAfter the releasing the first album, it was given much publicity specially by the Sirasa TV. At present public does not see him on media.Track listing\n \n \n \nThilaka Thiyanna album included songs\n \n \n \nNo.\n \nTitle\n \nLength\n \n \n \n1.\n \n\"Amma\" \n(Album Version)\n \n03.23\n \n \n \n2.\n \n\"Asipiya Salana Nisa\" \n(Album Version)\n \n04.02\n \n \n \n3.\n \n\"Heen Manike\" \n(Album Version)\n \n \n \n \n \n4.\n \n\"Mage Nage\" \n(Album Version)\n \n03.23\n \n \n \n5.\n \n\"Mage Sithata Muva Vemin\" \n(Album Version)\n \n04.01\n \n \n \n6.\n \n\"Mata Enna Nodi\" \n(Album Version)\n \n3.49\n \n \n \n7.\n \n\"Oba Innavanam Inna Ma Langa\" \n(Album Version)\n \n03.44\n \n \n \n8.\n \n\"Parasathu Mal Pipila\" \n(Album Version)\n \n03.36\n \n \n \n9.\n \n\"Rea Sandalia\" \n(Album Version)\n \n \n \n \n \n10.\n \n\"Seetha Handeakare\" \n(His first Music video made by this song)\n \n3.59\n \n \n \n11.\n \n\"Sewwandiye\" \n(Album Version)\n \n04.26\n \n \n \n12.\n \n\"Sihineka Sitha Davatee\" \n(Album Version)\n \n04.26\n \n \n \n13.\n \n\"Sudu Hansiye Mihiraviye\" \n(Album Version)\n \n04.59\n \n \n \n14.\n \n\"Tharuka Niva\" \n(Album Version)\n \n03.46\n \n \n \n15.\n \n\"Thilaka Thiyanna\" \n(Sung with fellow Superstar contestants usually)\n \n03.36\n \n \n \n16.\n \n\"Vilak Nelum Mal Aragena\" \n(Album Version)\n \n \n \n \n "}, {"name": "W. D. Amaradeva", "info": "Sri Lankan vocalist", "Intro": "Sri Lankan vocalist", "A.K.A.": "Albert Perera, Pandit Amaradeva", "Was": "Musician\nSinger\nComposer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "5 December 1927, Moratuwa, Colombo, Colombo District, Western Province", "Death": "3 November 2016, Sri Jayawardenepura Kotte, Colombo District, Western Province, Sri Lanka\n(aged 88 years)", "description": "Sri Lankabhimanya \nWannakuwatta Waduge Don Albert Perera\n (Sinhalese: \nවන්නකුවත්ත වඩුගේ දොන් ඇල්බට් පෙරෙරා\n; 5 December 1927 – 3 November 2016) better known by his adopted name \nAmaradeva\n, was a prominent Sri Lankan vocalist, violinist and composer. Primarily using traditional instruments like sitars, tablas and harmoniums, Amaradeva incorporates Sinhala folk music with Indian ragas in his work. Many consider Pandit Amaradeva’s contribution to the development of Sinhala music as unmatched, hence without argue cited as the \nMaestro of Sri Lanka Music (si. හෙළයේ මහා ගාන්දර්වයා)\n.In the mid-1950s, Amaradeva in his Janagayana project consulted experts of the Kandyan dance tradition like Pani Bharata, Kiriganita, Gunamala, Ukkuva and Suramba in his path to understand what constituted Sinhala folk music. Noting that it mostly revolved around a single melody, he decided to add verses that would lead up to the central melody which would now be a chorus thus forming two parts (unseen earlier in traditional Sri Lankan music) removing restrictions that had existed earlier. In doing so, Amaradeva created a uniquely Sinhalese music style that stayed true to folk tradition while incorporating outside influences. His work was vital in the creation of the sarala gee genre practised subsequently by artists like Sanath Nandasiri,Victor Ratnayake,T.M. Jayaratne and Sunil Edirisinghe.Pandit Amaradeva had been the recipient of numerous awards including the Philippine Ramon Magsaysay Award (2001), Indian Padma Sri Award (2002) and Sri Lankan \"President's Award of Kala Keerthi\" (1986) and Deshamanya Award (1998). In 2003 the French government awarded him the prestigious honour; Ordre des Arts et des Lettres. Notably he still remains the most popular artist as confirmed by Nielsen Media Research findings He has also represented Sri Lanka in many forums including the UNESCO 1967 Manila Symposium. The University of Kelaniya conferred on him the Degree of Doctor of Philosophy (Fine Arts) Honoris Causa in 1991 and the University of Ruhuna and University of Peradeniya conferred on him the Degree of Doctor of Letters, Honoris Causa in 1993 and 1998In 1972, Pandit Amaradeva composed the music for the Maldivian National Anthem (Gaumii salaam) at the request of Maldivian Government.Early life and educationAmaradeva was born the youngest of seven children to a carpenter, Wannakuwatta Waduge Don Ginoris Perera, and Balapuwaduge Maggie Weslina Mendis at Janapriya Mawatha in Koralawella, Moratuwa. Perera was a Buddhist while Mendis was a Methodist bringing both Christian and Buddhist values and music traditions to the family.Amardeva was introduced to music at a young age by his father who crafted and repaired violins at Moratumulla Wadu Kaarmika Vidyalaya (Carpentry School). Amaradeva would often strum the violin while his mother sang hymns. Another family influence was Amaradeva's elder brother who taught Indian classical music to him. Amaradeva was presented with his own instrument on his seventh birthday which was a Japanese made tin violin by his father.Amaradeva obtained his early education under Ven. Malalankara Nayaka Tero of the Koralawella temple. With the development of his musical talent, Amaradeva was asked to recite poems and prayers at the temple; he was subsequently picked to lead the village choir.He was first entered into Sri Saddharmodaya Buddhist mixed School in Koralawella. The principal of that school, Mr. Ku. Jo. Fernando was an active member of Hela Hawula and had a close connection with Kumaratunga Munidasa. He knew about Amaradeva’s talent and introduced him to Kumaratunga. Amaradeva was lucky to be appreciated by Kumaratunga for his singing talent. Since he had a chance to accompany all these scholars during his childhood, he had an interest in national identity and language. When he was studying in grade five at Koralawella School, a music teacher called Mr. W. J. Fernando was transferred to his school from Kalutara. Hence, W.J. Fernando was the first school music teacher of Amaradeva. He realized Amaradeva’s talent and directed him on singing and playing. Under his guidance, Amaradeva won all the school singing competitions. Even the teacher let him conduct the classroom when he was not there.While attending the school, he won a poetry contest held at the Moratuwa Vidyalaya. Amaradeva also led the school choir to a triumphant showing at a contest held by the Colombo Arts Society. His poetry win prompted school teachers to get him a showcase to recite poetry on Radio Ceylon. In 1945 Amaradeva won a gold medal at a music and violin contest held by Jana Kala Mandalaya Amaradeva’s fame that was limited only to the Koralawella, started spreading over other areas. Because of his increasing popularity, several schools offered him scholarships.Amaradeva entered Sri Sumangala College, Panadura after completing his primary education with a scholarship for English. At the school, he formed a friendship with the music teacher and principal Danister Thomas Fernando, who was the elder brother of Amaradeva's first music teacher W. J. Fernando. D. T. Fernando who was living in Kalutara helped Amaradeva get into Kalutara Vidyalaya and subsequently to Siddharta Vidyalaya Balapitiya.Young Amaradewa met Sunil Santha, a prominent artist at the time at one of Sunil Santha's concerts. Since he showed interest Sunil Santha invited Amaradewa to audition at Chitrasena studios. There he played in front of Sunil Santha, Chitrasena and A. J. Ranasinghe and impressed them. This meeting and related events are described in detail by A. J. Ranasinghe, Dr. Nandadasa Kodagoda and Sunil Santha. After the audition Sunil Santha brought Amaradewa to stay at Chitrasena Studios, his room mate was A. J. Ranasinghe.By chance filming of the film Ashokamala commenced nearby. Gerard J. Pieris of Moratuwa introduced Amaradeva to Mohamed Ghouse Master who was handling the music for the film and Ghouse recognising Amaradeva's skill enlisted him as the top violinist in his orchestra. Amardeva left his studies and accompanied Ghouse to India to work on the film. He would play a triple role of singing, dancing and acting on the film with the song \"Ayi Yameku Kale Ale.\"CareerHe found steady work as an artist on Radio Ceylon, where his unique vision and talent could be exhibited to an audience wider than he had ever before known – earning him a position at the Bhatkhande Music Institute in Lucknow, India. In 1955, Amaradeva won the All India violin competition. After extensive training, Albert returned to Sri Lanka as \nPandit\n Wannakuwatta waduge Don Amaradeva.The name Amaradeva which translates as Immortal god was given to him by Prof. Ediriweera Sarachchandra (Sri Lanka's foremost playwright and a close associate).During this time, Sri Lanka (then Ceylon) had only begun emerging as an independent nation, and the question of \nwhat\n Sri Lankan music was, was slowly being addressed with equal vigour by intellectuals, artists and the general public. In response to the spirit of these times, Amaradeva began interweaving indigenous folk music with the North Indian ragas he had studied in Lucknow, thereby giving expression to a more sophisticated cadence.His other innovations include his experimentation with Western harmonies and counter-harmonies, as well as with South Indian and Tamil musical forms. In the song 'Ran Dahadiya Bindu Bindu', Amaradeva incorporated the Baila music of his hometown. His opus, however, remains the work he did with Sri Lanka's celebrated lyricist Mahagama Sekera, in exploring the contours of fusing classical Sinhala poetry with his unique musical intonation. In time, Amaradeva's music came to reflect an entire philosophy, reflective of the spirit of a nation.He has composed music for ballet (Karadiya, Nala Damayanthi, etc.), film (Ranmuthu Duwa, Gam Peraliya, Ran Salu, Delovak Athara, Gatavarayo, Rena Girav, Thun Man Handiya, Puran Appu, etc.), theatre (Wessantara, etc.), radio and television. He is the creator of the mando-harp, a musical instrument combining the mandolin and the harp.Amaradeva is credited as having introduced artists such as Nanda Malini and Edward Jayakody to the wider audience. Many artists such as Sunil Edirisinghe, Victor Ratnayake and Neela Wickramasinghe have credited him as a major influence on their work. Dr. Lester James Peries has described his voice as the greatest musical instrument. Amaradeva has also been described as the defining musician of Sinhala civilization for his role in the creation of a national tradition.Amaradeva was married to Wimala, together they had one son (Ranjana Amaradeva), and two daughters (Subhani Amaradeva, herself a talented vocalist, and Priyanvada Amaradeva). He was a patron of numerous charities.DeathAmaradeva was admitted to Sri Jayawaradanapura Teaching Hospital due to a sudden illness. He died at the age of 88 on 3 November 2016 while receiving treatment at the Intensive Care Unit. The cause of death was a heart failure. The government subsequently announced that a state funeral would be held with a week of national mourning. His remains were given state honours at the Independence Memorial Hall for two days, the first time in the country's history where remains were kept at the Independence Memorial Hall.HonoursFilmographyMusic directorTrack listingSingle song tracks released"}, {"name": "Karunarathna Divulgane", "info": "Sri Lankan musician and politician", "Intro": "Sri Lankan musician and politician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "description": "Karunarathna Divulgane\n is a singer and a classical musician in Sri Lanka. He was the Governor of the North Central Province of Sri Lanka since November 2006 to 2015. "}, {"name": "Champa Kalhari", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "21 March 1974", "Age": "47 years", "description": "Champa Kalhari Jayasekara (born March 21, 1974, Colombo) is a Sri Lankan singer.Early life and education\n \nKalhari was born in Colombo, the daughter of a musician. She was educated in Visaka Vidyalaya, Colombo and studied music in India. She currently resides in Piliyandala.\n Career\n \nAt her selection test conducted by Radio Ceylon in 1980, she performed the song \"Sri Lanka Ma Prriyadara Jaya Bhoomi\" by Latha Mangeshkar. As a result she was offered a chance to appear on the children's radio programme \nḶamā Piṭiya\n (\"Children's Field\").\n \nShe became popular singing Hindi songs. Her first album was called \nSathire\n. She has released more than fifteen albums, most of them Hindi songs. She has performed as a playback singer in movies in the Sinhala language. She has produced a Sinhala CD with 16 songs.\n \nShe was the background singer of famous Sinhala movies, \nWadabarinam Wadak Na\n, \nRandenigala Sinhay\na, \nRa Daniyel Dawal Migel\n, \nJonson Gonson\n , \nWije Saha Aje\n and more. \nSitha Piya Salala\n song from \nWada Barinam Wadak Na\n movie, became very famous in 90s.\n \nKalhari produced a recording of Sinhalese songs in Hindi. With the permission of songwriters Gunadasa Kapuge, Dayaratne Ranatunga and Sanath Nandasiri, she sang their songs in Hindi. Kalhari has also worked as an actress and an announcer. She has acted in thirteen teledramas. She was the announcer for the program \nHindi Top Ten\n aired by Shree FM on Sundays.\n \nShe released a new Sinhala song \nNeth Piyan Piya Innam\n in 2015, and same song in Hindi language with Indian singer \nTrideev Borah\n in 2016.\n "}, {"name": "Chandralekha Perera", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "1 December 1961, Kurunegala", "Age": "59 years", "Family": "Spouse:\n\nRookantha Gunathilake", "description": "Chandralekha Perera\n (Sinhalese: \nචන්ද්‍රලේකා පෙරේරා\n) (born 1 December 1961), is a popular Sri Lankan pop singer.Perera was born to a middle-class family in Kurunegala. As a child she often sang at home. At school she frequently sang and successfully took part in inter-school competitions. While studying she sang for the band \"Spring Time\" in Kurunegala. She met her future husband Rookantha Goonatillake in 1976 when he was a keyboard player for this band.Without her knowledge, Perera's father submitted his daughter's name to a Sri-Lankan government-sponsored youth organization National Youth Services Council (NYSC). She subsequently attended and had a successful interview. She also appeared on the national television service in Sri Lanka that was a gift from Japan to Sri Lanka and was at that time broadcasting test transmissions.Perera was noticed by the film director and producer D. B. Nihalsinghe while he was reporting on NYSC. He selected her to act in his new television series \nRekha\n, which made her a star. She was given the award for best television actress in 1986 (for \nNadee Geethaya\n, another series by Nihalsinghe), and the award for best playback singer in the same year (for the film \nYali Hamuwennai\n). She was signed for LUX International by Lever Brothers at that time.Perera has sung duets with many popular singers and actors. Vijaya Kumaranatunga, the late husband of President Chandrika Kumaratunga, sang more than 15 songs with her.Perera married Rookantha Goonatillake in 1989, and they have three daughters and a son. In 2000, she and her husband were violently attacked by the Presidential Security Division (PSD) of president Chandrika Kumaratunga and threatened with death if they performed at anti-government events. The attack sparked a protest by Dharmasiri Bandaranayake who thereafter also received death threats. In the wake of these developments, \nArtists Against Violence\n (AAV) was founded. Ten officers of the PSD were arrested for the attacks and given jail sentences in 2013, but one year later pardoned by president Mahinda Rajapaksa."}, {"name": "Nanda Malini", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Musician\nSinger\nComposer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "23 August 1943, Aluthgama", "Age": "78 years", "description": "Nanda Malini (Sinhala:නන්දා මාලනී) (born August 23, 1943) is a Sri Lankan singer. She is one of the best known and most respected singers of Sri Lanka. Her choice of lyrics depicts many real life situations, and most intricate human relationships and emotions that stem out of those. She has been credited as starting a new chapter in Sri Lankan classical music.\nShe has won eleven Sarasaviya Awards and eight Presidential Awards for Best Singer.Early life\n \nMalini was born to a rural family of nine in Lewanduwa in Aluthgama, Sri Lanka. She moved to Kotahena in Colombo as an adolescent and was admitted to Sri Gunananda Vidyalaya where she came under the tutelage of T. N. Margaret Perera. After winning a poetry contest, Malini was invited to Radio Ceylon by W. D. Amaradeva and sang the song \"Budu Sadu\" on Karunaratne Abeysekera's popular program Lama Mandapaya.\n Later\n \nMalini continued her training after achieving fame, learning under B. Victor Perera. She studyied for a year at Heywood and moving on to Bhatkhande Music Institute in Lucknow, India in 1963. She would later return to the University to obtain a Visharada degree in 1984. Upon her return to Sri Lanka, Malini appeared on Amaradeva's programme Madhuvanthi singing the songs \"Sannaliyane\" and \"Ran Dahadiya Bindu Bindu.\"\n \nMalini has had a string of successful releases. Her lyrics depict realistic life situations, love, relationships, and emotions. The songs \"\nPipunu Male Ruwa\n\", \"\nSudu Hamine\n\", and \"\nKada Mandiye\n\" attest to her effort to expose the hearts of women. Some of Nanda's popular songs, such as \"\nManda Nawa Karanawa\n\", show a humorous and sensitive account of a young woman's experience of loneliness.\n Concerts\n \nIn 1971, Nanda collaborated with Pandit Amaradewa in the Srawana Aradhana concert. In 1973 she started her first solo concert series, and after having 530 shows the series ended on May 22, 1979. In August 1981 she started another concert series ‘Sathyaye Geethaya’. She played 500 shows and ended in August 1984. She conducted her next solo musical concert series Pavana in June 1987 which ran for 18 months with 205 shows. After 22 years her newest solo musical concert titled ‘Shwetha Rathriya’ was held with the collaboration of Sirasa FM in 2010.\n Discography\n \n \nPerada Maha Re\n \nPahan Kanda\n \nSathyaye Geethaya\n \nHemanthayedi\n \nTharuka Es, Pavana\n \nSindu Hodiya\n \nKinduriyakage Vilapaya\n \nMadhu Bandun\n \nTharu\n \nMalmada Bisau\n \nCinema Geethavalokana\n \nKirimadu Vel\n \nLondonyedi Geyu Gee\n \nYathra, Handahami\n \nSanka Padma\n \nPembara Lanka\n \nKunkuma Pottu\n \nGramaphone Gee\n \nAraliya Landata\n \nMalata Renu\n \nNilambare\n \nSari Podittak\n \nPirith Pen\n \n "}, {"name": "Ranil Mallawarachchi", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "12 April 1982, Sri Lanka", "Age": "39 years", "Residence": "Narre Warren", "Family": "Father:\n\nMilton Mallawarachchi"}, {"name": "Deepal Silva", "info": "", "Was": "Actor\nSinger", "From": "Sri Lanka", "Type": "Film, TV, Stage & Radio\nMusic", "Gender": "male", "Birth": "1 January 1967", "Death": "14 January 2017\n(aged 50 years)", "description": "Deepal Silva\n (9 May 1967 – 14 January 2017) was a Sri Lankan play-back singer and actor. He started performing in 1990, under the stage name, Podi Lamaya, and lived in Makola, Kiribathgoda. Deepal was a cricket fan and didn’t accept shows if they clashed with cricket matches. He died at the Ragama Hospital (Colombo North Teaching Hospital) on 14 January 2017, at age 50."}, {"name": "Ronnie Leitch", "info": "Sri Lankan actor, comedian, singer, presenter and a social activist", "Intro": "Sri Lankan actor, comedian, singer, presenter and a social activist", "A.K.A.": "Ronni Leitch, Thattaya", "Was": "Actor\nSinger\nComedian", "From": "Sri Lanka", "Type": "Film, TV, Stage & Radio\nHumor\nMusic", "Gender": "male", "Birth": "19 October 1954", "Death": "1 October 2018, Perth\n(aged 63 years)"}, {"name": "Shashika Nisansala", "info": "Sri Lankan musician (b. 1982)", "Intro": "Sri Lankan musician (b. 1982)", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "28 September 1982, Eheliyagoda, Sri Lanka", "Age": "39 years", "Star sign": "Libra", "Instruments:": "Voice", "description": "Shashika Nisansala Jayasumana\n commonly known as Shashika Nisansala (Sinhala: \nශශිකා නිසංසලා\n; 28 September 1982) is an award-winning Sri Lankan Songstress.\n"}, {"name": "Angeline Gunathilake", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "23 December 1939, Matara, Sri Lanka", "Death": "29 March 2019\n(aged 79 years)", "Star sign": "Capricorn", "description": "\nAngelina Rachel de Lanerolle\n (Sinhala: \nඇන්ජලීන් ගුණතිලක\n; 23 December 1939 – 29 March 2019), popularly known as \nAngeline Gunathilake\n or \nAnjalin Gunathilaka\n, was a Sri Lankan singer, primarily working as a playback singer in Sinhala film industry. Considered the \nSilver bell of Sinhala cinema\n, Gunathilaka worked on over 5000 playback songs in a musical career that spanned nearly six decades. She is as an A-grade singer graduated from Sri Lanka Broadcasting Corporation.\nShe died at the age of 79 while receiving treatment at National Hospital of Sri Lanka, Colombo.\nPersonal lifeAngeline Gunathilaka was born on 23 December 1939 in Matara district, the seventh of ten siblings. She went to St. Mary's Convent Matara for primary education. Her father worked at the Department of Railways. Due to her father's employers transferring him, the family moved to Colombo at the age of 8. She then attended St. Thomas' College, Kotte for secondary education.\nShe married Leslie Gunathilaka on 29 March 1966. The couple has 2 daughters. Her grandson, Imal Jude Malwattege, pursued a career in music.\nSinging careerAt the age of 8, Gunathilaka joined the Radio Ceylon amateur programme, and secured the second place in a musical talent show. After that, she studied music under maestro \nSunil Santha\n. At the age of 13, she was selected for the \nLamapitiya\n programme conducted by veteran lyricist and broadcaster \nKarunaratne Abeysekera\n.\nGunathilaka started her singing career with the solo song \nAdara Ambare\n. While she performed on the Lamapitiya program, she attended a singing competition called \nTharu Thenuma\n organized by Sri Murugan New Art Films. She won the competition and was selected for first playback singing. Her debut as a playback singer came with the film \nSohoyuro\n screened in 1958. In the same year, she sang the first duet of her career with Sunil Artigla. She then collaborated with Morris Dahanayake, R. Sivananda and V. Vardaraja for duets. Aside from singing, she studied dance under the maestro Panibharatha.\nShe rose to prominence within a small period of time, where she met P.L.A Somapala. He invited Gunathilaka to record songs under HMV label. She recorded songs with \nChitral Somapala\n and \nMohideen Baig\n for the 2500th Buddha Jayanthi commemoration. Along with Buddhist songs, she worked on many Christmas songs, which she sang together with \nC.T. Fernando\n under the influence of \nMarcelline Jayakody\n. She continued to gain popularity in the Sri Lankan music industry, where she started to play duets with Wally Bastian. She also sang virindu songs for the film \nDeyyange Rate\n.\nFrom 1958 to 1999, Gunathilaka performed as a singer on behalf of many actresses including \nAnoja Weerasinghe\n, \nMalani Fonseka\n, \nSabeetha Perera\n, \nSangeetha Weeraratne\n, \nDilhani Ekanayake\n and many more. Owing to this vast range of vocal performances, she holds the record for the highest number of playback singing performances by a female singer in Sinhala cinema. Gunathilaka gained widespread popularity for a duet with \nH.R. Jothipala\n. The two contributed to a vast number of films across many genres. On 9 August 2009, she performed a musical show \nAngeline Rocks with The Boys\n at 6.30 pm at the BMICH.\nOn 23 August 2014, she performed a live concert at Bandaranaike Memorial International Conference Hall.\nIllness and deathOn 29 March 2019, Gunathilaka died while receiving treatment at the National Hospital, Colombo. Her final rites was held at the General Cemetery Borella on Tuesday, April 2 at 4 p.m.\nPlayback singing filmographyAngeline Gunathilaka worked on over 200 Sinhala films across six decades.\n"}, {"name": "Ivor Dennis", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "28 May 1932, Seeduwa, Sri Lanka", "Death": "18 June 2018\n(aged 86 years)", "Star sign": "Gemini", "description": "\nKala Keerthi \nPasquel Ge Don Augustine Ivor Dennis\n (Sinhala: \nඊවෝර් ඩෙනිස්\n) (28 May 1932 – 18 June 2018) was a popular Sri Lankan veteran playback singer who was also known as the former student of veteran icon \nSunil Santha\n. He was well known for establishing long time relationship with legendary musician \nSunil Santha\n, who is known as one of the icons and pioneers of Sinhala music. He had worked as a playback singer in many Sinhala films including Sri Lanka's first Sinhala film \nRekava\n. He died on 18 June 2018 at his home in Seeduwa at the age of 86.\nCareerHe pursued his career as a vocalist and took part in a song competition at Radio Ceylon in 1952. He sang veteran musician Sunil Santha's famous song \nWaren Heen Sare Redhee Walave\n during the competition and his performance was sooner recognised by Sunil Santha who also came forward to teach music for the latter. Ivor was pursued by Sunil Santha to croon a song on his own and Ivor recorded his first song \nKurulu Paradiseye\n, which became an evergreen hit. He had also performed in many concerts in various countries including Japan, Indonesia, Italy, England and New Zealand.\nHe made his film debut as a singer which coincidentally came in Sri Lanka's first Sinhala film \nRekava\n which was released in 1955. He was promoted as an A grade singer at Radio Ceylon in 1958. He notably won the Presidential Award for the Best Playback singer for the film \nHima Kathara\n. He was honored with the prestigious Kala Keerthi award during the 2017 Sri Lankan national honours, for his outstanding contributions to the Sinhala cinema.\nDiscography"}, {"name": "G. S. B. Rani", "info": "Sri Lankan actress", "Intro": "Sri Lankan actress", "Was": "Actor\nFilm actor\nSinger", "From": "Sri Lanka", "Type": "Film, TV, Stage & Radio\nMusic", "Gender": "female", "Birth": "20 August 1930", "Death": "7 September 2004\n(aged 74 years)", "Star sign": "Leo", "description": "\nKala Suri \nGnai Seenar Bangsajayah\n, (born 18 October 1934 – died 7 September 2004 as \nජී. ඇස්. බී. රාණි\n), popularly known as \nG. S. B. Rani\n, was an actress in Sri Lankan cinema, theater as well as a songstress, politician and a media personality. She was one of the most popular playback singers in early Sri Lankan cinema industry with a career spanned over five decades.\nPersonal lifeGnai Seenar was born on 20 August 1930 in Guruwatta village, Badulla as the only daughter to a Malay family. Her father Nusammeen Bangsajayah was a police sergeant and later became sub inspector. Her mother was Chintha Nona. She completed education from Clifton Balika Vidyalaya, Colombo.\nShe was married to Ranawaka Arachchige Anton Perera and wedding was celebrated on 17 February 1953. Anton was an employee of the Sri Lanka Steel Corporation. The couple had three children - Ranjith, Chandana and Udeni. Even though she was Malay and husband was Sinhala Catholic, the family converted to Buddhism.\nShe died on 7 September 2004 around 3.30 pm after a brief illness.\nPoliticsHer brother-in-law, R. S. Perera was a politician. She became a Sri Lanka Freedom Party (SLFP) supporter and an all Island organizer of the women's wing of the Party. She contested for the 1967 Municipality elections from Milagiriya and lost by 448 votes. However, she continued to work in politics for 45 years, where she lost the career at Radio Ceylon as well. During the General Election she was included to the National List of MPs from SLFP and narrowly missed the opportunity.\nOn 4 September 2004, she participated to the 53rd anniversary of the Sri Lanka Freedom Party held at Samanala Palama in Galle. This was her last appearance in media before her death.\nDiscographyIn 1944, Rani went to the Columbia Records studios with her cousin Ahmed at the age of 14 for an audition at Porolis Fernando Company. She met with U.D. Perera and \nMohammad Ghouse\n and got the opportunity to record songs under the Columbia label including two Columbia records: \nSamagi Bale Paame\n, and \nSiri Sara Bhavane\n, a duet with \nMohideen Baig\n. However, her father refused to using her own name in music industry, she abbreviated her name to G. S. B. Rani since then. She continued to sing for almost every Sinhala film in following years and sang duets with Mohideen Baig, \nDharmadasa Walpola\n, \nH. R. Jothipala\n, Sisira Senaratne, N. Karunaratne and W. Prematilleka. Some of her most popular hits include \nParama Ramani Ape Ale\n and \nSengi Sengi Atha Suraya Dilenna\n. Apart from Sinhala songs, she was also clever at Hindi and Urdu songs.\nIn 1946, she was invited to record playback singing for the film \nAshokamala\n. However, during that period, she lost her father and mother. Therefore, she was unable to move India for the recording and Indian playback singer Bhagyarathi sang the songs. After the death of mother, Rani was brought into the Radio Ceylon for an audition under P.L.A. Somapala.\nMeantime, she became an 'A Grade' artiste at the Radio Ceylon under Indian composer \nShrikrishna Narayan Ratanjankar\n. She worked as a Musical Program Producer at the Radio Ceylon from 1970 to 1977 and conducted popular music programs such as \"Jana Prasangani\", \"Geetha Tharangani\" and \"Prabuddha Gee\". During her seven years period, she introduced many popular singers to Sinhala music industry, including \nNanda Malini\n, H. R. Jothipala, \nEdward Jayakody\n, \nVictor Rathnayake\n, \nT.M. Jayarathne\n, \nPriya Suriyasena\n, \nMalani Bulathsinhala\n and Abeywardhana Balasooriya and successfully recorded over 7000 new Sinhala original songs. She also managed to attend a young Buddhist priest at the Radio Ceylon for a \nDhamma Chinthawak\n program. The program was highly popularized became the first Buddhist sermon on the radio. This young priest later ordained to Upasampadā and later known as Panadure Ariya Dhamma Thero.\nIn 1955, she got the opportunity to enter Sinhala cinema with playback singing to the film \nAsoka\n directed by \nSirisena Wimalaweera\n. In the film, Rani sang the song \nPem Pahan Nivi Pam Mala Paravi\n along with Mohideen Baig, which became highly popular. Then she sang the songs with Dharmadasa Walpola for the film \nSurangani\n.\nIn 1977, she was ostracized as a singer by the Sri Lanka Broadcasting Corporation for 15 years due to political conflicts with United National Party (UNP). In 1994, Rani was appointed as the Director of the Independent Television Network by the president \nChandrika Kumaratunga\n. She worked in that position until 2001. In February 2004, Rani celebrated 60 years of singing career with the concert \nParama Ramani\n held at BMICH. In March of the same year, she went London to participate in \"Swarna Gee concert\" organised by Hela Sarana Charity.\nDuring her visit to London, she sang a duet with Ishaq Baig, son of late Mohideen Baig. With that song, Rani became the only Sri Lankan female singer to sing with singers of two generations, father and son.\nActing careerShe started acting with some popular stage dramas including, J.D.A. Perera's \nWessanthara\n, Upali Wanasinghe's \nDaskon\n and then from \nRodi Kella\n. She was the \"Mandri Devi\" in \nWessanthara\n and \"Queen Premila\" in \nDaskon\n.\nShe has acted in few films in early Sinhala cinema. Her maiden appearance in cinema came through 1955 film \nSurangani\n as an \"aunt\". Then she acted in the film \nDuppathage Duka\n as a supervisor at a garment.\nShe won the Rana Thisara Award at 1995 Sarasaviya Film Festival, on behalf of her service to Sri Lankan cinema and music industry. She was also honored with Wishva Prasadini, Kalasoori awards.\n"}, {"name": "Mihira SA", "info": "Musician | Artist | Music Producer", "Intro": "Musician | Artist | Music Producer", "Known for": "Music Producer", "A.K.A.": "Mihira SA", "Is": "Artist\nMusician\nSinger\nMusic director\nMusic arranger", "From": "Sri Lanka", "Gender": "male", "Birth": "9 September 1999", "Age": "22 years", "Profiles": "", "description": "\"\nMihira Fernando\n is a \nSri Lankan\n \nRnB, EDM, Classic\n and \nPop\n \nMusic producer\n, better known as \nMihira SA\n. He first started producing in 2015, He release his first track \"Mage Palpathata\" featuring \"Ranjith Rohan\" in 2016. and he founded the label called \"FxMusix Productions\" in 2016 - 2021. and he download DAW called \"FL Studio 11\" in 2015. He has Audio Engineering Dip. And He learned producing from internet by him self.\""}, {"name": "Edward Jayakody", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "6 April 1952, Kegalle", "Age": "69 years", "description": "Edward Jayakody (Sinhala:එඩ්වඩ් ජයකොඩි) is a Sri Lankan musician, singer and composer. Jayakody has directed the music for hundreds of Sinhala films and television serials and has also composed many songs for children's programming (\"Koppara Koppara\").\nJayakody won the Swarna Sanka Award in 1987 for Best Male Singer for the film Gedara Budun Amma. He won Best Music Director in 1979 and 1980 for the plays Nidane and Aparadaya Saha Danduwama.Life and career\n \nEarly life\n \nJayakody was born Jayakody Arachchige Don Edward Timothy Jayakody, the sixth child of Don Raphial Jayakody and Victoria Jayakody on 6 April 1952 in Hettimulla, Kegalle, Sri Lanka. His family was Catholic. Jayakody received his early education at Bandaranaike Junior School, and received his secondary education at \nSt. Mary's College\n of Kegalle. He joined the church choir while attending Bandaranaike and learned music while at St. Mary's, under teacher H. Samarapala.\n \nWork in music\n \nDuring the period from 1968 to 1976, Jayakody participated in the Maliban Guwan Thotilla and in amateur music programmes. He entered the Government College of Music in 1976 (presently the Faculty of Aesthetic Education of Kelaniya University) and during that time took part in music programmes conducted by popular musicians. At that time he started releasing cassettes and his career took off.\n \nHe was the music teacher at Nalanda College Colombo in mid 1980s.\n \nJayakody's album \nDeduna Palama\n was released on April 6, 2003.\n "}, {"name": "Cliff Foenander", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer\nSongwriter", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Death": "21 November 2000", "description": "Cliff Foenander was a Sri Lankan musician (born in Colombo) who performed in South East Asia and Las Vegas. Cliff died 21 November 2000.Career\n \nCliff grew up in Colombo, and in the 1950s he started performing in clubs and dances around Ceylon.\n \nSouth Asia's oldest radio station, Radio Ceylon (now the Sri Lanka Broadcasting Corporation) gave Cliff his first exposure inside Ceylon and across South Asia, including India. Broadcasters Vernon Corea, Jimmy Bharucha and Tim Horshington played his songs and interviewed him on their radio shows.\n \nCliff later joined Hong Kong based group 'The Fabulous Echoes.' and they built a fan base in Hong Kong, the Philippines, Malaysia, Singapore, Indonesia and Japan. The Fabulous Echoes gained international exposure playing in Las Vegas in the United States of America, also performing with rat pack members Frank Sinatra, Dean Martin and Sammy Davis Jr, with Ella Fitzgerald and the great 'Satchmo,' Louis Armstrong. The Fabulous Echoes performed on The Ed Sullivan Show after Ed saw them in action in the Thunderbird Lounge.\n \nCliff Foenander continued his music career after The Fabulous Echoes. He settled in Melbourne, Australia. Foenander died in Australia on the 21 November 2000.\n \nIt was during his time in Australia that his voice really matured and he was a regular entertainer at many of entertainment spots in Melbourne and also elsewhere in Australia. He was the lead singer in a number of prominent Australian bands. At this time there were also a large number of Sri Lankan migrants in Australia and Cliff being a headliner was always in demand for any of the dinner dances and parties.\n Family\n \nCliff's nephew, Robin Foenander performs in Australia and has released several CDs and a country music song 'Further Down The Road' with the folk music artist Keith Potger, who was a founder member of the Seekers and the New Seekers.\n "}, {"name": "Mignonne Fernando", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "9 May 1943, Colombo", "Age": "78 years", "description": "Mignonne Fernando is a Sri Lankan singer, part of the popular group \"The Jetliners\".Early life\n \nAt the age of seven, Mignonne won Radio Ceylon's Talent Contest.\n \nHer interest in law was overtaken by her passion for music, received formal training in Western classical music, speech and drama. This proved to be her greatest strength and an excellent foundation to her musical career that was to follow.\n \n The Jetliners\n \nIn 1965, Mignonne along with her group The Jetliners became an instant success under the guidance of manager Tony Fernando who would later become her husband, and their popularity grew. Radio Ceylon, introduced her music not only to a local audience but right across South Asia. During the early years of the group the Jetliners enjoyed star billing at the Coconut Grove nightclub situated in the Galle Face Hotel in Colombo.\n \nIn 1969, she became the first Sri Lankan to be signed up by EMI Records UK, and Keith Prowse Music London. The Ceylonese song 'Wedding Song' (Mangala Mohotha) was her first song to be copyrighted by KPM.\n \nHer song \"Love Don't Let Me Down\" won the Embassy Award at the World Popular Song Festival. Another original composition \"Someday My Love\" won the Matsushita Award and Special Jury Award for Composer and Performer at the Festival of Song.\n \nA Sinhala composition \"Oba Nisa\" was selected for the Finals of the 5th Olympiad of Song in Athens, Greece where it won the Gold Medal. \"Coconut Man\" made the finals of the World Popular Song Festival in Tokyo, the first time a female singer/composer has done so.\n "}, {"name": "J. A. Milton Perera", "info": "Sri Lankan playback singer", "Intro": "Sri Lankan playback singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "9 May 1929", "Death": "24 October 1991\n(aged 62 years)", "description": "J. A. Milton Perera (1938– October 24, 1991) was a leading playback singer of Sri Lankan cinema during the 1960s and 1970s.\nMilton was born on May 5, 1938 the son of J. A. Edwin Perera, also known as Tabla Podi Appuhamy, an accomplished tabla player. Inspired by his father, Milton became proficient on the tabla at a young age.\nIn 1940, Milton sang his first song for Radio Ceylon, \"Alehi Bendi Jeewitha\". It was written by Aloy Gunawardena around a Mohamed Sally melody. He subsequently had several popular songs on the radio, \"Podi Kale Api Denna,\" \"Oba Wewa Wewa Pahana Mage\", \"Sikuru liya Komala liya\" and \"Kalyaniye.\"\nMilton debut to playback singing came with a song on Kurulu Bedda (1961). In his 30 year career in the field, he provided his voice to actors like Gamini Fonseka, Joe Abeywickrama, Tony Ranasinghe, Vijaya Kumaratunga, Ananda Jayaratne, D. R. Nanayakkara, Anthony C. Perera and Stanley Perera in such films as Adata Wediya Heta Hondai, Dheewarayo, Yatagiya Dawasa, Allapu Gedara, Bicycle Hora, Daru Duka, Sarawita, Ataweni Pudumaya, Chandiya and Deiyange Theenduwa.\nMilton died on October 24, 1991. In memory of Milton, Perera Priyankara Perera and Chalaka Chamupanthi Perera continue to perform J.A Milton Perera's songs."}, {"name": "Kasun Kalhara", "info": "Musician", "Intro": "Musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "3 November 1981, Rajagiriya", "Age": "40 years", "description": "Kasun Kalhara Jayawardhana (Sinhala: කසුන් කල්හාර ) (born 3 November 1981) is a Sri Lankan singer, musician and record producer. During his musical career, Kasun has released three albums, Haritha Nimnaye, Radical Premaya and Romantic Opera. He is one of the biggest and best-selling music artists in Sri Lanka.Biography\n \nKasun was born in Rajagiriya, Sri Lanka on 3 November 1981. His mother, the late Malani Bulathsinhala, was a veteran vocalist and his father H.M Jayawardena was also a musician.\n \nHis music career started with Indrachapa Liyanage and 2000 Ananda College Friends in year 2000. At this time his mother was a big supporter of his musical career and was very proud of every step her son had taken. Once a newspaper interviewer asked her \"what is the most memorable day in your life?\" then she answered \"The day Maestro Premasiri Khemadasa hugged and wished my son Kasun Kalhara, following his first musical concert (Waves of Introspection). That warm hug from Maestro Kemadasa guaranteed that Kasun had a genuine talent and a clear future\".\n \nKasun has held a number of solo concerts, collaborating with other artists such as \"Kasun Kalhara: Live in Concert\", \"Kasun Kalhara Unforgettable Live in Concert\", \"The Black Red White Concert\", \"Kasun Kalhara in Culture Shock\" and \"Love U: Live in Concert\".\n \nKasun Kalhara in Culture Shock (2013) and Kasun Kalhara LoveU (2016) The two concerts became one of the most attended musical shows in history of Sri Lanka with over 5,000 fans gathering around at the Nelum Pokuna Mahinda Rajapaksa Theatre for both events.\n Personal life\n \nKasun is married to Nadee Kammalweera and has a son (Danu Kalhara).\n  \nDiscography\n \nAlbums\n \n \nHaritha Nimnaye\n (2001)\n \nRadical Premaya\n (2005)\n \nRomantic Opera\n (2008)\n \n \nWith other artists\n \n \nAadara Mal Wala\n with Indrachapa Liyanage\n \nAathmaabhimaanayay\n with Indrachapa Liyanage\n \nAadaraneeya Wassaanaya (with Uresha Ravihari)\n \nPamaawee Pipuna (with Indika Upamali)\n \nRaaththriya Manaram (with Nirosha Virajini)\n \nSamagi Samaadana (with Malani Bulathsinghala)\n \nSanda Ahimi (with Pradeepa Dharmadasa)\n \nShuunya Wuu Nagaraye (with Samitha Mudunkotuwa)\n \nVeenaawee Urathalaye (with Indrachapa Liyanage)\n \nSanda Eliya (Moonlight) \n(with Indrachapa Liyanage)\n \nSihinayata Tharam \n(with Prathibha Prabha)\n \nMalakai Kiya \n(with Kushani Sandareka)\n \nSara Sande \n(with Kushani Sandareka)\n \nAdare (Adaraneeya Kathawak Movie Song) \n(With Kushani Sandareka)\n \nAhasin Eha (Adaraneeya Kathawak Movie Song) \n(Uresha Ravihari)\n \n \nSingles\n \n \nMage Diwi Pana Nala Rakinne (Sinhala Hymn)\n \nMa Balawath Karana Samide (Sinhala Hymn)\n \nSanda Mithuri (2009)\n \nMeedum Dumaraye (2009)\n \nMath Mal Sena (2011)\n \nMata Kiya Denna (2011)\n \nAdarema Geethayak (2013)\n \nKadadasi Oru (2015)\n \nLowa Dutuwe Amma (2015)\n \nLihiniye (2015)\n \nIthin Hadamu Api Aluth Ratak (\nLet's Make A New Country\n) - Produced with Rookantha Gunathilake for the victory of New Democratic Front (Sri Lanka) at the Sri Lankan presidential election, 2015\n \nSri Lanka Cricket Theme Song (2016)\n \nVaramale (2016)\n \nMe Obata Ahenawada (Adaraneeya Kathawak Movie Song 2016)\n \nVasilissa (2016)\n \nAlaye Ghatha (2016)\n \n \nLive Performances\n \n \n'Haritha Nimnaye' (2001)\n \n'Radical Premaya' (2005)\n \n'Romantic Opera' (2008)\n \n'Kasun Kalhara in Culture Shock with Indrapachapa & Naadro' (Date - September 7, 2013)\n \n'Suvi Sanda Re - Musical Show' (Date - September 9, 2014)\n \n'4U Concert with Indrachapa Liyanage, Nadeeka Guruge & Nadeeka Jayawardena' (Date - October 24, 2015)\n \n'Love U Concert (2016) with Rookantha Gunathilake, Indrachapa Liyanage, Nadeeka Jawardhana & Umaria sinhawansa' (Date - February 14, 2016)\n \n'Sandamadala - The Voice of Malani - Musical Show with Sandya Bulathsinhala' (Date - March 29, 2016)\n \n'Sarasavi Asapuwa with Nirosha Virajini' (Date - May 29, 2016)\n \n'Sandamadala 2 - The Voice of Malani - Musical Show with Sandya Bulathsinhala' (Date - June 11, 2016)\n \n'Epic Series with Rookantha Gunathilake' (Date - July 8, 2016)\n \n'Amarakasunambara with Amarasiri Pieris' (Date - July 10, 2016)\n \n'Sandamadala 3 - The Voice of Malani - Musical Show with Sandya Bulathsinhala' (Date - July 31, 2016)\n \n'4U Concert II: with Indrachapa Liyanage, Nadeeka Guruge & Nadeeka Jayawardena' (Date - September 24, 2016)\n \n'INK Concert with Indrachapa Liyanage' (Date - October 29, 2016)\n \n'Eccoustica Concert with Indrachapa Liyanage, Nadeeka Guruge & Nadeeka Jayawardena' (Date - December 3, 2016)\n \n'Samanal Sihinaya Concert with Indrachapa Liyanage' (Date - December 29, 2016)\n \n'Romanthika Handaawa with Nadeeka Guruge and Nadeeka Jayawardana' (Date - January 15, 2017)\n \n'Siyapath Swara with Nirosha Virajini and T.M. Jayarathne' (Date - January 21, 2017)\n \n "}, {"name": "Shihan Mihiranga Bennet", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Musician\nSinger\nComposer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "18 March 1985", "Age": "36 years", "Profiles": "", "description": "Shihan Mihiranga (Sinhalese: ශිහාන් මිහිරංග; born 18 March 1985), is a Sri Lankan singer, composer and songwriter. He was ranked fifth place in the first season of Sirasa Superstar, an idol program in Sri Lanka similar to American Idol. He released his first album Dreams of Shihan in 2006. Then in 2008 he released his second album, Dreamz 2 – My Life. Despite being in the 5th position in Sirasa Super Star, season 1, Shihan made a very good impression and is the most popular amongst all the young singers in Super Star arena and Shihan is called as Dream Boy of the youth in Sri Lanka.Early life and background\n \nShihan was born on 18 March 1985 to Tyronne Bennet and Nilu Mallika. His father, Tyronne Bennet is a Sound Engineer, previously worked at Bahrain. He has a sister, Shanika Mihiravi. He studied at De Mazenod College, Kandana.\n Marriage\n \nShihan married Gishni Clementa Silva on 25 January 2012. Their love story had reportedly started 9 years earlier and it had been a secret to the media until the wedding.\n \nThe wedding was held at St. Mary's church in Nayakakanda, Hendala. Reports say that the lovebirds were intent on keeping the event low scale and away from the attention of the media. Clementa is the daughter of Upali Silva, who is a PTI of Shihan's school. The wedding photography was done by Dayan Witharana.\n \nThe couple has two sons, the elder son is Shihan Kenneth Yarsh and the younger one is Shihan Glen Marsh. .\n Music videos and choreography\n \nShihan released his first music video \nAda Thaniyen maa\n which was a great hit in Sri Lanka. Later it won the most popular music video award at Derana Music Video Awards in 2007. He then released videos for several hit songs of his two albums. His music videos like \nSewwandiye\n, \nSulagak Wela\n, \nMata Nelaganna Bari\n, \nWassane\n, \nAe obama dai\n, \nMihiraviye\n and \nObage mathaken\n were among the most popular music videos in Sri Lanka.\n \nLater he went on to sing in several Sinhala movies. He was the main playback singer in the movie \nSuwanda Danuna Jeewithe\n. His songs from the movie became popular hits in Sri Lanka.Such as Perada mewu sina,Ron suwanda dena mal and Sith mal hegum popiyana yame. He did playback singing for the song, \nRaya Pibidee\n in the movie \"Super Six\".\n \nIn \nSirasa Superstar\n season 4 which was renamed \nGeneration 4\n, Shihan compered the program along with Nirosha Perera-\nYawwane Sihina Yata Daelwune\n \nHe also vocalised the theme song of Sirasa Superstar, Generation 4.\n \nHis album, Dreams of Shihan, won the Most Popular Album award in 2006.\n Brand ambassador\n \nHe currently acts as the Brand Ambassador for Mobitel Smart 5, and Tiara Rollo cake of Ceylon Biscuits Limited.\n Albums\n \n \n \nDreams of shihan\n \n2006\n \n \n \nDreamz 2 – My Life\n \n2008\n \n \n Track listing\n \n \n \nDreamz of Shihan album included songs\n \n \n \nNo.\n \nTitle\n \nLength\n \n \n \n1.\n \n\"A Sonduru Samanal Wiye\" \n(Album Version)\n \n04.48\n \n \n \n2.\n \n\"Ada thaniyen maa\" \n(Song video won the most popular video of the year in Derana music video awards 2009.)\n \n04.26\n \n \n \n3.\n \n\"Asa gatena\" \n(Album Version)\n \n04.16\n \n \n \n4.\n \n\"Hitha hadana welawe\" \n(Album Version)\n \n03.47\n \n \n \n5.\n \n\"Nethu Kadahalena Tharuwak Wage\" \n(Album Version)\n \n03.56\n \n \n \n6.\n \n\"Oba Dutuwa A dine\" \n(Album Version)\n \n \n \n \n \n7.\n \n\"Obe Senehe Dewatemin\" \n(Album Version)\n \n04.15\n \n \n \n8.\n \n\"Sithin Pathanna Maa\" \n(Album Version)\n \n03.45\n \n \n \n9.\n \n\"Sudo Sudu Aadare\" \n(Album Version)\n \n \n \n \n \n10.\n \n\"Sudu Rosa Mal Watila Thibuna\" \n(Album Version)\n \n \n \n \n Track listing\n \n \n \nDreamz 2-My Life album included songs\n \n \n \nNo.\n \nTitle\n \nLyrics\n \nMusic\n \nLength\n \n \n \n1.\n \n\"Aadara Hegumata Idadenna\" \n(Album Version. A commercial version was produced for Ceylon Biscuits Limited's chocolate brand.)\n \nNandana Wickramage\n \nRukshan Mark\n \n03.24\n \n \n \n2.\n \n\"Jeewithe Pura\"  \n \n \n \n \n \n \n \n \n \n3.\n \n\"Kiyannepa\" \n(Album Version)\n \n \n \n \n \n \n \n \n \n4.\n \n\"Mathakai Hitha Haduwa Edaa\" \n(Album Version)\n \n \n \n \n \n04.28\n \n \n \n5.\n \n\"Mathakai Obe Muwe Sina\" \n(Album Version)\n \n \n \n \n \n04.09\n \n \n \n6.\n \n\"Oba Giya\" \n(Shihan's first album contains a slow version of this song. Second album's song is of rock genre.)\n \n \n \n \n \n \n \n \n \n7.\n \n\"Mata nela ganna beri\" \n(Album Version)\n \nNandana Wickramage\n \nRukshan Mark\n \n03.34\n \n \n \n8.\n \n\"Obada Maa\" \n(Album Version)\n \n \n \n \n \n04.51\n \n \n \n9.\n \n\"Paaya Neela Ambare\" \n(Album Version)\n \nNandana Wickramage\n \nNalin Perera\n \n03.58\n \n \n \n10.\n \n\"Pini Bindu\" \n(Album Version)\n \nNandana Wickramage\n \nRookantha Gunathilake\n \n \n \n \n \n11.\n \n\"Pini Poda Watena Arunalle\" \n(Album Version)\n \n \n \n \n \n04.23\n \n \n \n12.\n \n\"Mihiraviye\" \n(Album Version)\n \nNandana Wickramage\n \nTheja Iddamalgoda\n \n04.00\n \n \n \n13.\n \n\"Sina Mal Kekulu Pubudaa\" \n(Album Version)\n \n \n \n \n \n04.28\n \n \n \n14.\n \n\"Sulangak Wela\" \n(Album Version)\n \nNandana Wickramage\n \nNalin Perera\n \n04.12\n \n \n Single song tracks released\n \n \n \nSolo Tracks\n \n \n \nNo.\n \nTitle\n \nLength\n \n \n \n1.\n \n\"Maa Dase Wedana ( Remake )\" \n(Solo Track Version)\n \n04.28\n \n \n \n2.\n \n\"Mage Hithata Eya Denuna\" \n(Solo Track Version)\n \n04.30\n \n \n \n3.\n \n\"Me As Diha Balan\" \n(Solo Track Version)\n \n03.24\n \n \n \n4.\n \n\"Perada Mawu Sina ( Film Song )\" \n(Solo Track Version)\n \n04.13\n \n \n \n5.\n \n\"Ron Suwada Dena ( Duet with female singer Uresha Ravihari as a Film Song )\" \n(Solo Track Version)\n \n04.00\n \n \n \n6.\n \n\"Ra Sihinen ( Remake of Original song of singer Namal Udugama )\" \n(Solo Track Version)\n \n03.45\n \n \n \n7.\n \n\"Wassane\" \n(Solo Track Version)\n \n03.40\n \n \n \n8.\n \n\"Hathara Kendare\" \n(Solo Track Version)\n \n03.30\n \n \n \n9.\n \n\"Raya Pibidee ( Film Song of Super Six)\" \n(Solo Track Version)\n \n03.31\n \n \n \n10.\n \n\"Oba Kauruda\" \n(Solo Track Version)\n \n04.39\n \n \n \n11.\n \n\"Thaniyen Ipadunu Nisa\" \n(Solo Track Version)\n \n03.26\n \n \n \n12.\n \n\"Ridawana Jeevithe\" \n(Solo Track Version)\n \n04.11\n \n \n \n13.\n \n\"Mage Wela Laga Unnu Oya\" \n(Solo Track Version)\n \n03.20\n \n \n \n14.\n \n\"Yawwane Sihina Yata Delwune\" \n(Solo Track Version ( Theme song of Sirasa Superstar – Generation 4 ))\n \n03.35\n \n \n \n15.\n \n\"Es Deka Piyana ( Remake of Rookantha Gunathilake song )\" \n(Solo Track Version)\n \n04.12\n \n \n \n16.\n \n\"Ahasama Ridawa ( Jodha Akbar Teledrama Theme song with Nirosha Virajini )\" \n(Solo Track Version)\n \n02.40\n \n \n \n17.\n \n\"Senehe Ammage ( Accompany with Kasun Kalhara, Nirosha Virajini and Umariya Sinhawansa )\" \n(Solo Track Version)\n \n04.04\n \n \n \n18.\n \n\"Daiwaya Ape\" \n(Solo Track Version)\n \n03.52\n \n \n \n19.\n \n\"Obage Mathaken\" \n(Solo Track Version)\n \n03.59\n \n \n \n20.\n \n\"Athi Mawa Rewatuwa\" \n(Solo Track Version)\n \n03.46\n \n \n \n21.\n \n\"Dinaka Mage\" \n(Solo Track Version)\n \n \n \n \n "}, {"name": "Anton Jones", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Death": "31 January 2016", "description": "Anton Jones (Sinhala: ඇන්ටන් ජෝන්ස්) is a Sri Lankan musician. He was a major figure in Sinhala baila and had several hits that include \"Mini Gawuma\" and \"Uyala Pihala.\" Jones had released 37 cassettes and eight CDs and often tackled contemporary events in his songs. His most recent album Sebe Siddhi discussed the effects of the tsunami that hit Sri Lanka.\nHe died on 21st of February 2016.Life and career\n \nOverview\n \nJones was born to Burgher family and grew up on St. Sebestian's Street in Hulftsdorp. He entered music under the guidance of Wally Bastian in the early 1950s. In 1958 he performed for the first time in front of a live audience for a Radio Ceylon event.\n \nFor the duration of his musical career, Jones also worked as an English stenographer for a state bank. He retired in 1997 completing 35 years of service.\n \nPersonal life\n \nJones is married to Iris Jones and has two sons and two daughters. His sons Tyronne and Jude lives in Paris, France.\n "}, {"name": "Rukmani Devi", "info": "Indian actress", "Intro": "Indian actress", "Was": "Singer\nActor", "From": "Sri Lanka", "Type": "Film, TV, Stage & Radio\nMusic", "Gender": "female", "Birth": "15 January 1923, Nuwara Eliya", "Death": "25 September 1978, Ja-Ela\n(aged 55 years)", "Family": "Spouse:\n\nEddie Jayamanne", "description": "Rukmani Devi (15 January 1923 – 28 October 1978) was a Sri Lankan singer and actress, who was often acclaimed as \"The Nightingale of Sri Lanka\". She made it to the silver screen via the stage and had acted in close to 100 films, at the time of her death. Having an equal passion for singing as well as a melodious voice, she was Sri Lanka's foremost female singer in the gramophone era. After her death, she was awarded the Sarasaviya 'Rana Thisara'- Life Time Achievement Award at the 1979 Sarasaviya Awards Festival.Background\n \nRukmani Devi, was born as Daisy Rasammah Daniels to a Tamil Colombo Chetty Christian family on 15 January 1923 at Ramboda in Nuwara Eliya, Sri Lanka. Second, in a family of five, her father, John Daniel worked on a plantation and her mother, Helen Rose was a teacher.\n \nShe grew up in Colombo and had her early education at St. Matthew's School and then moved on to St. Clare's School, Wellawatte.\n \nAs a little girl, Daniels showed an inborn talent to sing and dance. At the age of seven, she was picked to sing Christmas carols. Impressed with her ability to sing, dance, and also to act, she was selected to perform a main role in a Christmas play, 'The Shoemaker's Wife'.\n \nThe stage play was trained and presented by St. Clare's School, Wellawatte.\n \nWatching her play this role much enthusiastically, Walter Abeysinghe, a drama producer sought permission from her father, to invite her to play the lead role of 'Sita' in his drama 'Ramayanaya.' Thus, in 1935 at the age of just 12 years she performed in this stage play, presented by the 'Sinhala Natya Sabha'.\n \nShe was married to veteran dramatist, actor and singer, Eddie Jayamanne, whom she fell in love with as a result of her close association with him, when performing in dramas produced by \"Minerva Dramatic Club\" founded by B. A. W. Jayamanne. They lived at \"Jaya Ruk\", at Angurukaramulla, Negombo.\n Career\n \nThis marked the beginning of an illustrious career that would span over four decades. As her performances were highly appreciated by the packed audience, well-known dramatist Dick Dias chose her for two of his stage plays, \"Jana Kiharanaya\" and \"Mayawathie\". She was now flooded with stage dramas, as she became Mayawathi in Charles Dias' 'Mayawathi', Juliet in a Sinhala adaption of Romeo and Juliet, playing the lead female role in all of them.\n \nWith her first audio recording of the famous song \"Siri Buddhagaya Vihare\" with Master \n\"H. W. Rupasinghe\"\n.\n \n in 1938, she captured the hearts of the masses and she shaped her career from that of an actress to that of an actress turned singer. This song was recorded to 78 rpm (gramophone) record label HMV with the number N-9300 and issued in 1939 by the Cargills Ltd, local agents for HMV\n \nHer unique voice attracted many music directors, as her singing career moved from the stage to the silver screen.\n \nIt was also, around this time that her name underwent a change from Daisy Daniels to the well known 'Rukmani Devi'. There are two schools of thinking as to how the name \"Rukmani Devi\" originated. According to one school, the late H. W. Rupasinghe maestro created the name, while the other believe that Jayantha Weerasekara and Michael Sannas Liyanage who is in his 90s, created it.\n \nB. A. W. Jayamanne, founder of \"Minerva Dramatic Club\" of Negombo took Rukmani to perform remarkable roles in his interestingly featured dramas, such as 'Apparition', 'Broken Promise', 'Changing Fate, 'Defeated Aim', 'Evasive Denial', 'Fanatic Faith', 'Grisly Guardian', 'Hasty Decision' and lastly 'Irangani'. Above-mentioned plays followed the English alphabet.\n \nThe popular play 'Broken Promise' (Kadawunu Poronduwa), was adapted into a film by B. A. W. Jayamanne. This was the first Sinhala film – Kadawunu Poronduwa, screened on 21 January 1947. Rukmani Devi, who also began her film career through the role of 'Ranjani' in this film, also became the first local cinema actress. Her film career, which thus began spread over a period of more than three decades.\n \nAccording to \nSri Lankeya Cinema Vanshaya\n (pp 637 – 638) written by Nuwan Nayanajith Kumara, from \nKadawunu Poronduwa\n in 1947 to \nAra Soyza\n in 1984, Rukmani Devi had played different roles in 99 films, up to the time of her death.\n \nAn equally talented singer, some of the immortal songs she sang for films are \nSandyave Sriya\n for 'Kadawunu Poronduwa', \nPinsara Mage Soyura\n for 'Kapati Arakshakaya', \nGala Kandeni\n, and \nMoranawa Preme Hade\n for 'Weradun Kurumanama', \nNindede Rathri Yahane\n for 'Peralena Iranama', \nMavila Pena vi Rupe\n for 'Kela Handa', \nPem Sihina Loke Maya\n for 'Mathabhedaya', \nMelavi Yanna Hada Mage\n for 'Daiva Yogaya', \nSuva dena Sita Sanasum\n for 'Ladalu' and \nDoi Doi Puta\n for 'Ahasin Polavata'.\n \nIn 1975 Rukmani sing \"Pem Rajatahane\" with Miton Mallawarachchi.\n \nIn the mid sixties she joined the sinhala calypso musical group 'Los Cabelleros' led by late Neville Fernando. They recorderd ever popular sinhala songs such as 'Malbara Himidiriye','Menike Obe sinawe' & 'Sandak nage'.\n \nRukmani Devi was also featured prominently on the airwaves of Radio Ceylon, the oldest radio station in South Asia.\n Death\n \nRukmani Devi, died in a tragic motor accident near St. Mary's Church, Thudella on 28 October 1978. She was returning after a musical show in Uyanwatte, Matara. Her funeral ceremony was attended by a very large gathering; film makers and dramatists, friends, politicians, relatives and her beloved fans.\n \nShe was the most celebrated Sri Lankan artiste and a statue in memory of her was erected at the Kanuwana Junction, Ja-Ela, as she still lives in the hearts and minds of the Sri Lankan people. The road on which the Rukmani Devi Museum in Negombo is located was also renamed 'Rukmani Devi Mawatha' by President Ranasinghe Premadasa, on 28 October 1990.\n Awards\n \n \nBest background Singer for the song 'Doi doiya putha' in the film 'Ahasin Polawata' at the inaugural Presidential Awards Ceremony in 1976.\n \nBest actress Award for 'Kele Handa' at the 'Deepasika' awards ceremony conducted by 'Lankadipa' Newspaper in 1956.\n \nVoted Best Actress with a majority of 16,221 votes at the 'Reader's Contest' conducted by 'Dinamina' Newspaper in 1955.\n \n In popular culture\n \nShe was the one and only Sri Lankan actress on the cover page of popular Indian Film Magazine \"Filmfare\" and was also featured in \"My like and dislike\" in 1958 in the Filmfare. The Toyota Hi-ace First generation model is known in Sri Lanka as the 'Rukmani Model', because she was travelling in one when she had her fatal accident.\n Attack on Grave Site\n \nOn 12 August 2011, a former Mayor of Negombo and a Former Minister of the Parliament Mr. Ananda Munasinghe was allegedly charged and arrested by the Negombo Police for Dislodging the Statue of Rukmani Devi, erected on her grave by one of her fans Mrs. Sriyani Achala Dissanayake. Several popular media bloated this incident as an attack by an unidentified group of criminals to Rukmani Devi's grave and a protest rally to this incident was also organised in Negombo on 14 August 2011. However, later it was revealed that Mr. Ananda Munasinghe who is also the Son-in-Law of Bernard Aloysius Jayamanne (B. A. W. Jayamanne) is in fact the present owner of this grave and he has dislodged the statue to erect a proper statue of Rukmani Devi as the statue which was erected earlier was a disrespect to the beauty and looks of Rukmani Devi.\n \nThe grave Rukmani Devi is buried is the ancestral family plot of the Jayamanne family and all her in-laws are buried there. This can be seen on the tombstone erected and is evident on the deed title held by the family. The statue erected by \"Mrs. Sriyani Achala Dissanayake\" was a cheap publicity stunt to restore her lost fame to make a living. She did not take approval from the family nor informed the family. She fabricated this attack story by providing \"favours\" to the right people in law and publicity\n Other films\n \n \nAbudasse kale (1968)\n \n "}, {"name": "Nimal Mendis", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Singer\nMusician\nSongwriter", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "29 March 1934", "Death": "16 April 2015\n(aged 81 years)", "description": "Nimal Mendis\n (1934-2015) was a Sri Lankan singer and songwriter, and was one of a handful of Sri Lankan musicians to appear on the BBC television programme \nTop of the Pops\n (1968). Mendis was a longstanding member of the Performing Rights Society and the Mechanical Copyright Protection Society of Great Britain.Mendis was discovered in the late 1950s by Radio Ceylon, which dominated the airwaves in South Asia in the era. The station backed Mendis' songs from the outset, including \"Kandyan Express\", turning them into hits in South Asia: so much so that listeners from all over the Indian sub-continent wrote in to Radio Ceylon requesting his songs.Mendis had been involved with music from his early childhood, and has lived for many years in London travelling often to Sri Lanka. He has also lived at Le Paradis in the Charente, the South West of France, for five years with his wife Ranjani. Mendis was married to Ranjani for 33 years until her death in 2010, and has one son, Paulmarie, with whom Mendis ran Mediaeye Productions.The devastation of the 2004 tsunami moved Mendis, leading him to compose a song to aid the victims. This was recorded in Australia, Sri Lanka and the United Kingdom, and was commended by the British Parliament in early day motion 638, sponsored by MP Linda Perham.BiographyEarly years: 1950s–1960sMendis has 22 songs published in Britain and has written music for films in Sri Lanka. \"Kiss Kiss Kiss\" was Mendis's first song that was recorded in Britain and sung by Mary Marshall on the Columbia label. \"Kandyan Express\", \"Cherry Blossom Tree\", \"Oh My Lover\", \"Butterfly in the Rain\", \"Champagne Blues\", and \"Goodnight Kisses \"' were number-one hits in Sri Lanka in the late fifties.\"Kandyan Dance\", an instrumental, was his second piece in the West. Recorded by Friedel Berlipp and his Orchestra in Germany it went on to be number two on Radio Luxembourg. It was also released in the United States. \nBlack Pearls & Green Diamonds\n has eight of Mendis's songs on an LP for Decca by One Two and Three, a folk group in Britain. This album is now a collectors item.Mendis appeared on the popular BBC television music programme \nTop of the Pops\n with his singing partner Sandra Edema in 1968 as guest artists with his song \"Feel like a Clown\". The B-side of the record \"Rainbow Land\" was the A-side in the States and today (2013), it has become a collector's item in the Psychedelic Rock community in the west. They were also featured with the song on \nBeat Club\n in Germany that year. Eugene Wright, bass player with the original Dave Brubeck Quartet, arranged and recorded five of Mendis's songs with only him playing bass. He also arranged and produced one other song, \"Singing Fish\", with electric guitar, bass, and piano. They were sung by Sandra Edema.1970sMendis recorded a number of songs in London, mostly of a spiritual nature. He also made a twenty-minute audio documentary on the Way of the Cross called \nThe Passion Report\n; another audio documentary called \nFerryman\n focused on the tea estate-worker and the farmer in Sri Lanka, tracing their history from the British colonial period. He also wrote \nBread of Life\n for the Eucharistic Congress in Sri Lanka.Mendis has written several memorable songs for Sri Lankan films, most notably \"Master Sir\" for the film \nKalu Diya Dhahara\n (\"A column of black water\"), where Neela Wickramasinghe performed it over the title sequence. \"Master Sir\" is about colonial Sri Lanka, narrating a story about the dignity of labour- a story about social justice. The song was recorded both in English (by Mendis and Sandra Edema) and Sinhala (by Neville Fernando; lyrics translated to Sinhala by Karunaratne Abeysekera). The song has remained a hit in Sri Lanka for over thirty years, mostly as a result of Neela Wickramasinghe's popularized version based on the musical arrangement of the English version (time signature, riffs etc.).His composition \nGanga Addara\n (\"By the Banks of the River\"), translated into Sinhala by Augustus Vinayagaratnam, and sung by Vijaya Kumaranatunga, for the film of the same name (directed by Sumitra Peiris), is also popular. The hit \nRan Tikiri Sina\n was written for the same film and sung by Victor Silva and Nirasha Perera. In 2013 a new version of the song \"Ganga Addara\" was sung by Surendra Perera and used as the theme song for a teledrama series of the same name. \"Upul Nuwan\" was another classic composed for the 1978 Lester James Peiris film \nWhite Flowers for the Dead\n.1980sIn the 1980s, Mendis went into the production of documentary films with his wife- their son Paulmarie, deft with computers and editing visuals, assisted them. He was only seven years old when he accompanied his parents filming in the war zones of the North and East of Sri Lanka. Mendis also did a stageshow \nIt's What I Am\n with Sri Lankan musicians; the highlight was the song \"July '83\", based on the ethnic riots of that year. He also made two audio cassettes, one for Air Lanka- \nA Taste of Paradise\n, and the other for the Ceylon Tourist Board- \nPilgrim Places of Sri Lanka\n.1990s-2015The Mendis family formed their own enterprise, Mediaeye Music Lanka (PVT) Ltd., which released an audio documentary, \nWar is my Country\n, in 2000, tracing the ethnic conflict in Sri Lanka up to 1994. This CD contained archive material over a period of seventeen years with narration, interviews with political and other personalities, songs and poems.Together with his son, Paulmarie, Mendis continued to compile songs, audio documentaries and film material on CD and DVD. Through Mediaeye, they worked closely with various large organisations in Sri Lanka, working on projects such as Sirasa Superstar (Sri Lanka's equivalent of American Idol/Xfactor) and interacting with many young artists in the country. In 2009 they completed a ten-minute piece for Sri Lankan Airlines showcasing the company's new uniforms; this, as well as one of Mendis' songs \"And A Star\" by Generation 4 (four of the Sirasa Superstars), which was used by the airline as a boarding video in 2011 and again during Christmas 2013.Mendis wrote three songs for Sumitra Peries' film \"Vaishnavee\" as well as the background score, which was arranged and produced by Paulmarie.In 2013 he wrote the first ever Sinhala blues song, \"Girls\", which was sung by Amila Sandaruwan. It was translated into Sinhala by Duminda Allahendra who has also translated some of Mendis's new material. The music video for the song was produced by the students of the Digital Film Institute of Sri Lanka.Mendis died on 16 April 2015 at a private hospital in Malabe, Colombo, at the age of 81.Television documentariesDawn of Terror\n, Mendis' first documentary, focused on the country's ethnic conflict, and is regarded an anti-war film. It was made for the Centre for Society and Religion in Sri Lanka and despite being produced on VHS was taken for distribution by Concord Video and Film in the UK.Shattered Pearl\n spotlighted women affected by the war in Sri Lanka and the \"right to life\" was made for Channel 4 television in London. It was a major film by Sri Lankans on British TV at the time. It has been shown in many parts of the world.Three Women Speak Out\n was made for \"Article 19\" in Britain, on the freedom of opinion and expression. Mediaeye also edited \nZ for Zero Concern\n on homeless children in London for the Children's Society.Water Water Everywhere\n, filmed in Bangladesh, is on women and water-management, made for CAFOD.Blessed Are the Poor\n compares poverty in Britain and South India and the positive effort people make to change their lives. This documentary was made for the Methodist International.Mediaeye has also served as researchers for three major British TV productions. Three of their documentaries were at the Monticatini Film Festival in Italy: \nShattered Pearl\n, \nSeyllan to Paradise\n, and \nStop Killing Start Singing\n (which was based on three songs). It was the first time that Sinhala songs were featured as a documentary."}, {"name": "Kamal Addararachchi", "info": "Sri lankan singer", "Intro": "Sri lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "5 February 1962, Sri Lanka", "Age": "59 years", "description": "\nKamal Addararachchi\n - කමල් අද්දරආරච්චි (born Addararachchige Gunendra Kamal on 5 February 1962) is an award-winning Sri Lankan film and teledrama actor, singer and presenter. He made his debut as an actor in Gamini Fonseka's 1981 film \nSagarayak Meda\n, whilst he was a still a student at school. Since the late 1970s, he has appeared in a variety of roles in many films and teledramas.\nAddararachchi, has acted in over 40 films, 20 teledramas and 6 stage plays, and won the Sarasaviya Best Actor Award for his role of Sobana in \nAgnidahaya\n in 2002.He also made a mark as a singer in 1993 with \"Unmadawoo,\" a duet with Damayanthi Jayasooriya, which featured in the film \nSaptha Kanya\n. He was also the host of the first three seasons of \nSirasa Superstar\n, a reality show, and first season of \nHiru Mega Stars\n. He also had a great fall at the BMICH while singing “Mal Pibidena Eka Wasantha Samayaka” by H. R. Jothipala."}, {"name": "T. M. Jayaratne", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "13 April 1944", "Age": "77 years", "Star sign": "Aries", "Education": "Maliyadeva College", "Instruments:": "Voice", "description": "Tennakoon Mudiyanselage Jayaratne\n, also known as \nT.M. Jayaratne\n (Sinhala:ටි.එම්.ජයරත්න) (born 13 April 1944) in Dodangoda, Sri Lanka is a popular Sri Lankan vocalist and a violinist.\nHe has received the Presidential Award of Sri Lanka in 1978, 1979, 1980 and 1987. In 2006 Jayaratne was awarded the best male singer award at the Raigam Tele Award Festival.\nLife and careerOverviewJayaratne studied at Maliyadeva College in Kurunegala. He was drawn into singing by the head of the Folk and Research unit at the Broadcasting Corporation C.J.S. Kulathilaka who asked him to vocalise several Sinhala folk songs that included \"Gana Thel Sadun\" to be broadcast over the radio. He recorded his first song in 1970.\nJayaratne debuted as a playback singer with \"Lahiru Dahasak\" written by Sunil Ariyarathne and composed by \nPremasiri Khemadasa\n. In 1978 he released his first cassette \nTharanga Volume - 01\n. At present,he has given his golden voice to 79 films. Among these films, Bambaru Awith of \nDharmasena Pathiraja\n and Hansa vilak of \nDharmasiri Bandaranayake\n are considered as the best ever films in Sri Lankan history.\nIn 1980 Jayaratne dueted with Sunila Abeysekera on \"Hemin Sare Piya Vida\" for the movie \nHansa Vilak\n. The song was written by \nDharmasena Pathiraja\n with music by \nPremasiri Khemadasa\n and became a popular song in Sri Lanka. His duets with \nNeela Wickramasinghe\n also became hugely popular hits. Also he has composed music for some songs but he achieved fame as a talented vocalist.\nPersonal lifeJayaratne is married to Malini Jayaratne and has two children. His son Isuru jayarathne is also a singer.\n"}, {"name": "Gresha Schuilling", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "1983", "Age": "38 years", "Instruments:": "Voice", "description": "Gresha Schulling\n (born 1983, Colombo) is a Sri Lankan musician. She has been hailed as a rising star from the world of popular music in South Asia.\nShe comes from a distinguished musical family from Sri Lanka. Gresha was educated in Jeddah, Saudi Arabia at the Continental School, and in Sri Lanka. She took to music while she was in Saudi Arabia and even won a 'battle of the bands' contest in her school.\nWhen she returned to Sri Lanka she decided to follow her in popular music after she completed her GCE Advanced Levels.\nCold Cold Night Christmas SingleGresha has recorded her debut Christmas single 'Cold Cold Night.' The Christmas song was written by father and son duo, the distinguished Sri Lanka-born singer/songwriter \nNimal Mendis\n and his son Paul Marie Mendis. 'Cold Cold Night' was released by Media Eye Music in the United Kingdom in November 2007.\nThe BBC said Gresha Schuilling was attempting to reach the No.1 spot in the Christmas Charts of 2007.\nGresha Schuilling is recording her debut album in Colombo and it was scheduled to be released in the summer of 2008. Media Eye Music in London released her 'Cold Cold Night' Christmas single on download through the mediaeyeproductions website.\nShe has also recorded the Nimal Mendis classic from the iconic Sri Lankan film, 'Ganga Addara.' The original song was recorded by the Sri Lankan film star, the late \nVijaya Kumaratunga\n. 'Ganga Addara' will be released on her debut album.\nSri Lanka's Ambassador for AutismGresha Schuilling was appointed Sri Lanka's Ambassador for Autism by the Autism Awareness Campaign UK and Sri Lanka. She is determined to make a difference to the lives of all people with autism and Asperger syndrome in her island home. Gresha has been raising awareness of the condition - an estimated 39,000 children in Sri Lanka are on the autism spectrum.\nGresha said: “Autistic is the adjective of a development disorder of the brain, NOT a definition of who a person is! Educate yourselves and others on this disorder more common that Down Syndrome or cystic fibrosis. It is four times more common in boys than in girls and is said to be as common as one in every 250 children born in recent years. It is our duty as people who have been given the talent and opportunity to do everything we can to increase awareness of Autism. Ignorance in this case is as far from bliss as it can get.”\n"}, {"name": "M. S. Fernando", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "4 March 1936", "Death": "9 April 1994\n(aged 58 years)", "Star sign": "Pisces", "Instruments:": "Voice", "description": "Mahagamage Samson Fernando\n, most famous as \nM. S. Fernando\n (Sinhala: \nඑම්. එස්. ප්‍රනාන්දු\n, 4 March 1936 - 9 April 1994) was a Sri Lankan baila singer. He is a major player in the development of baila music and was widely popular among Sri Lankan audiences commonly referred to as the \"Baila Chakkrawarthi\" (baila emperor).\nFernando received many accolades in his long career including the Golden Lotus Award presented by Sri Lankan President \nWilliam Gopallawa\n in 1973 and over 159 silver trophies in various Baila contests he entered. He was able to sing in five languages and incorporated dancing into his act. Fernando performed in England, France, Australia, Canada, Singapore and Middle East to Sri Lankan audiences.\nBiographyOverviewFernando was born in 1936 in Moratuwa to Laron Fernando and Lilee Gomes on March 4. He attended St. Anthony's College, Mt. Lavinia and Christ Church, Dehiwela. Fernando studied under veteran musician J. A. Sathiadasan. He debuted as a singer with the duet, \"Malak Kada Konde Gasala,\" done with Pushparani Ariyaratne. It was written by Karunaratne Abeysekera.\nThe song became popular and allowed Fernando to become a playback singer. His first song in the field, \"Sili Siliye Nava Suvandak,\" was also a success. Fernando would eventually lend his voice to over 150 films. He also pursued an acting career appearing in over 25 films and several teledramas, most notably \nUdagira\n.\nPersonal lifeFernando was married to Tulin Fernando and has 7 Children (Susil Fernando, Telina Fernando, Shantha Fernando, Sarath Fernando, Sujitha Fernando, Sunimal Fernando, Sujeewa Fernando) and sixteen grandchildren (Ayesha Kalpani Fernando, Kaushalya Fernando, Santhushi Fernando, Fortune Francis, Chris Francis, Ranen Francis, Britney Francis, Mahika Fernando, Shanaka Fernando, Saumya Fernando, Sudesh Fernando, Rangi Fernando, Nilanka Fernando, Nayomi Fernando, Sumal Fernando,Sinavi Silmini Fernando)\n"}, {"name": "H. R. Jothipala", "info": "Sri lankan singer", "Intro": "Sri lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "12 February 1936, British Ceylon", "Death": "7 July 1987, Colombo, Colombo District, Western Province, Sri Lanka\n(aged 51 years)", "Star sign": "Aquarius", "description": "Hettiarachchige Reginald Jothipala (Sinhalese: එච්.අර්.ජොතිපාල; 12 February 1936 – 7 July 1987) was a prolific playback singer in the Sinhala cinema. He also worked as an opera singer. He died in July 1987 at the age of 51 years and 5 months. Jothipala lent his voice to all classes of actors ranging from Eddie Jayamanne, Ananda Jayaratne, Gamini Fonseka, Vijaya Kumaratunga, Sanath Gunathilaka, Tony Ranasinghe, Ravindra Randeniya and even several of the young generation of actors in Sri Lanka. \nBiography\n \nEarly life\n \nJothipala was the first child in a middle-class family from Southern,Matara Sri Lanka. He attended St. Lawrence College in Maradana and St. John's College in Dematagoda. Jothipala would visit tea kiosks to hear music as his family didn't own a radio. He married Vintor Blosem. They have 4 daughters.\n \nHe came to be known by his initials \"H. R.\", and was loved as \"Hadhavatha Raththaran Jothipala\", meaning \"kind-hearted Jothipala\", due to his kindness to people of all ages, communities and families.\n \nJothipala made his debut as a playback singer on Cyril P. Abeyratne's \nSurathalee\n, singing \"Siriyame Sara\", in 1956. Prior to that, he had recorded a song for the late Sirisena Wimalaweera's \nPodi Putha\n. The song didn't make the final cut, as the Indian film composer on the film didn't consider Jothipala's voice good enough.\n \nJothi has said that he contemplated taking his life when he went with his friends to watch \nPodi Putha\n and found out that his song was not included. Later when \nSurathalee\n producer Jabir A. Cader wanted to hear one of his songs to consider him for the film, Jothipala almost passed on the offer as he did not possess enough money to create a record. He was helped out by veteran musician Stanley Omar who financed him for the sum of 35 rupees – a large amount of money at the time. Jothipala's song on the film, \"Siriyame Sara,\" still remains popular in Sri Lanka, having recorded the popular number under the direction of T.R. Papa at Wahini Studio in India.\n \nJothipala has worked with many reputed directors of Sri Lanka. In the early stages of his prolific career, Jothipala got the chance to work with prolific film maker, Lester James Peries on the movie \nSandeshaya\n. Jothipala sang the song \"Puruthugeesikara\" for the film, which was composed by the legendary Sunil Santha and written by veteran lyricist Arisen Ahubudu.\n \nSuccess\n \nJothipala was the undisputed choice in films that were made in the late sixties and through the seventies, the period during which he also began to act. Though Jothi was criticised for singing to the tunes of popular Hindi songs, particularly of Mohammed Rafi, he also sang under the batons of Pandit W. D. Amaradeva, P.V. Nandasiri, Premasiri Khemadasa, Sarath Dassanayake and Milton Mallawarachchi.\n \nHe sang in hundreds of films including popular hits like \nKasthuri Suwanda\n, \nThushara\n, \nSweeep Ticket\n, \nHitha Honda Minihek\n, \nKawuda Raja\n, \nHondata Hondai\n, \nWasana\n, \nSangeetha\n and others. The award-winning singer also played some memorable roles in films including \nEthulweema Thahanam\n, \nSulalitha Sobani\n, \nSujeewa\n, \nSukiri Kella\n, \nAbirahasa\n, \nBonikka\n, \nShanthi\n and his own production \nSumithuro'and \"Obai Mamai\".\n \nJothipala died in the first week of July in 1987.\n \nUse of Hindi melodies in his songs\n \nAlthough Jothipala was very talented in his own respect, he was criticised for singing to the tunes of popular Hindi songs, particularly of Mohammed Rafi.\n \nDeath\n \nTwo days before his death, on 5 July 1987, he participated for \"Gam Udaawa\", patrionic project by late President Ranasinghe Premadasa, and sang on his final open stage. But while singing he felt pain, but finished the singing successfully. Next day he was admitted to the hospital. Jothipala died on 7 July 1987 at Ratnams Private Hospital. The cause of his death was said to be alcohol-induced Liver failure. \"He came to our hospital very regularly. He was a big drinker. We told him time after time not to drink anymore,\" Ramya Fleming, a nurse who worked at the hospital at the time, was quoted saying after his death. Ramya Fleming was in-charge of the ICU and was at home when she got the call to come in. Due to previous altercations with the hospital, she refused to come in, but later did. He was quoted as being a large man, taking up the entire bed and his stomach hard enlarged due to the large amount of alcohol he had consumed. He also had cankles. As soon as news spread of Jothipala's death, people surrounded Ratnams Private Hospital. All of Union Square was filled with fans, and some even jumped over the hospital's gate just to see a glimpse of Jothipala.\n \nNumerous activities are still under way throughout the country for his commemorations.\n "}, {"name": "Uresha Ravihari", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "26 July 1979, Nugegoda, Sri Lanka", "Age": "42 years", "Star sign": "Leo", "description": "\nUresha Ravihari Wickremasinghe\n, (born 26 July 1982; as උරේෂා රවිහාරී [Sinhala]), is a Sri Lankan songstress. Considered as one of the leading female playback singers in Sri Lankan Sinhala cinema, Ravihari has won numerous awards at local film and television festivals including Sarasaviya Awards for Best Vocalist in three consecutive years.\nPersonal lifeShe was born on 26 June 1982 in Nugegoda. Her father Dharmasri Wickremasinghe is a renowned announcer at Sri Lanka Broadcasting Corporation (SLBC). Her mother is Chandra Wickremasinghe. Ravihari has one brother, Navod who is two years younger. She completed education from Samudradevi Balika Vidyalaya, Nugegoda and then at St. Paul's Girls School, Milagiriya. She was also clever at music as well as dancing.\nShe is married to Ruchira Nadeera, who is a doctor at Panadura Hospital. Wedding was celebrated in January 2012 at Galle Face Hotel. The couple has one son, Sasen Pravivek. Ruchira is divorced and he has one son from his first marriage.\nCareerHer career begins at very little age where she used to listen music classes conducted by veteran singer Sujatha Attanayaka at a neighbor house. Then she started to learn music and vocal train by attending to her classes. At the age of 8, she made her maiden playback singing with the film \nShakthiya Obai Amme\n with her teacher Sujatha Attanayaka and Tony Hassan.\nAt the age of 9, she released her first album, titled \nSurathal Nangiye\n. She continued perform many occasion with both Sinhala and Hindi songs and released Hindi- Sinhala mix CD/cassette at the age of 13 as her second album. She got the opportunity to sing Hindi songs in a musical program telecast on ITN on every Tuesday. Her third album, \nKasun Tharaka\n was released when she was 16 years old.\nAt the age of 13, Ravihari made her debut acting in the film \nMalsara Doni\n produced by her father. In the film, her song \nUnna Eka Gangavaka\n became highly popularized. However she selected music industry as her pathway and completed 'Prathama' and the Diploma in Hindustani music under Sujatha Attanayaka and late Austin Munasinghe. She also completed 'Bharatha Natyam' under Preethi Ganegoda and Vasuki Shanmugampilla.\nIn 1996, Ravihari won the award for the best selling CD/cassette at Rasa Awards Festival for her album \nSithin Man Aaderai\n. Then in 1998 she won the award for the best singer at Sumathi Awards for the song in the television serial \nSasala Ruwa\n. In 2005, she won the best singer award at Raigam Tele'es for the song in serial \nIdorayaka Mal Pipila\n.\nApart from music and dancing, Ravihari completed a diploma in beauty culture under Suwineetha Kotalawala. In 2006, she won the Best singer award at both Signis OCIC Award Festival and Presidential Film Festival for the film \nAnjalika\n.\nAwardsPlayback singingPlayback film tracks"}, {"name": "Janith Weerasinghe", "info": "Sri Lankan musical artist ", "Intro": "Sri Lankan musical artist", "A.K.A.": "Janith Weerasinghe", "Is": "Singer\nActor\nEntrepreneur", "From": "Sri Lanka", "Gender": "male", "Birth": "28 February 2003, Colombo, Sri Lanka", "Age": "18 years", "Family": "Mother:\n\nChampika Sajeewani\n\n\n\nFather:\n\nSajith Weerasinghe", "Education": "Saranath National Collage Kuliyapitiya", "Profiles": "", "description": "Early Life :Janith Indusara Gimhan Weerasinghe\n better known as \nJanith Weerasinghe\n, He is a Sri Lankan musical artist, Entrepreneur, Digital Marketer, Graphic Designer & Internet Personality. Who has made a big name in the Graphic Design & Digital Marketing. Basically \nJanith Weerasinghe\n started his career as a Graphic Designer, but sometime he entered in the music field. \nJanith Weerasinghe\n was born on February 28, 2003 in Colombo, Sri Lanka.Career :He was introduced to the music industry launch his first soundtrack “Lock Down” on SoundCloud first. After some day He release his music on different music platforms like Spotify, Google Play Music, Apple Music, iTunes, Amazon Music, JioSaavan and many others international platforms like Deezer, Tidal and Napster. You get \nJanith Weerasinghe\n music on TikTok, Instagram or Facebook library also.Basically \nJanith Weerasinghe\n start his career first as a Graphics Designer or YouTuber. But, sometime later he enters in the music field. Now if you search about on Google the you will get all information about him. YouTube officially verified his YouTube channel as an official artist. YouTube him music verified badge on YouTube. Moreover Janith also verified person on Google, Yahoo and Bing.Founder and CEO At White Oats Records :He Founded Music Production Records White Oats Records Provide Music Beats, Instrumental Beats, Mix and Mastering We Provide Various Types Of Services To Our Client.Social Media :"}, {"name": "Jagath Wickramasinghe", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "1 January 1988", "Age": "33 years", "Profiles": "", "description": "Jagath Wickramasinghe\n (born 1966) is a Sri Lankan musician. His best-known songs are \"Saagara Tharangaa,\" \"Mage Nango,\" \"Pemvantayin Se,\" and \"Obe Sina Langa.\" He is one of the three judges on \nSirasa Superstar\n.Wickramasinghe pursued a career as an engineer, but later decided to become a musician like his parents. His career took off after his songs were played on stations owned by the Sri Lanka Broadcasting Corporation.Wickramasinghe signed on as a judge on Sirasa Superstar in 2005 motivated by the chance to help musicians achieve success.Personal lifeJagath Wickramasinghe is a composer, singer, teacher, music producer, actor, multi-instrumentalist and philanthropist.Loku Kodikara Jagath Wickramasinghe was born on 10 April 1966 in Kolonnawa, Sri Lanka to father of Loku Kodikara Jinadasa Wickramasinghe and mother of Aryawathi Chandralatha Wickramasinghe. Both of his parents are music teachers and they were very much involved with lots of musical programs in Sri Lankan music culture. Therefore, he used to practice sing and play whatever his parents did during their rehearsals. It is during those days his potential of singing and playing instruments were discovered by his parentsIn the year 2000, he got married with Gayani Prasangika Kohona and is father of one son and two daughters: Loku Kodikara Thidas Wickramasinghe, Sirini Suhansa wickramasinghe and Asini Ashcharya Wickramasinge.In 1972, he was studied at Ashoka Kanishta Vidyalaya, Maradana and after past the grade 5 scholarship, he attended Ananda College and studied there up to grade 10.Then he had to study at Anuradapura Central College as his parents had got an unexpected transfer to Anuradapura.The people and subcultural background of Anuradapura changed him a lot and opened his eyes to the reality of life. During this time period as a milestone of his life he used to love silence embarrassing rhythm of music.He was engineering oriented and studied mathematics for A/Ls. Later on he followed a civil engineering course and specialized in building construction.Therefore, being perfect amateur, Jagath Wickramasinghe fulfilled his music knowledge following Sangeeth Visharad Part 2 and Diploma in music (vocal), Bathkande institute of music, Lucknow, India. As well, he did Prathama Examination Music (Instrumental) Thabla, at Bathkande institute of music. He was student of western music Trinity College of London. Professional lifeDuring the first half of 1990s he forwarded an application to the music section of SLBC. He got selected as music producer and he played instruments for programs and composed his own music. He made many contributions to new creations and got much experience as a young musician. Then he worked as a visiting lecture of university of visual & performing and was a lecture in oriental and western music, in the music department of the youth service council Sri Lanka.From 1983 to 1985 he performed as a music consultant of Sarvodaya Organization and since 1982 to up to now he is performing as a teacher with having experience in music. Since 1991 up to now, he has been touring to around 40 countries performing there as a vocalist, instrumentalist and a director of music. As well, he takes special care to promote our music and culture in foreign countries.In the mid 1990s he attached program on TV such as Prathiba, Ridma Tharanga, Shantha me ra yame, Thani Tharuwe, and Nishanthaya. As well, he composed music for films and teledramas such as Sthyadewi, Re Ru, Bhawakarma, Thunpath Rela, Bopath Ella, Isuru Tharanaya, Pahe Kttiya, Keetaya and Awasan HoraawaIn 1991, he involved himself in tele dramas as an actor. He attached Kande gedara, Doodaruwo,Devi, Shoba saha Darshana, Piya Satahan, Awasan Horawa, Soorya Sihinaya, Athugala pamula, Shapa nokaraw daruwane, and Sasala ruwa proving that he has art in his soul.With his experience he held numerous shows both Sri Lanka and Abroad for local and foreign artists and he was assigned to direct the music for 40 Japanese children named Harajuku vocal orchestra. On the other hand, as a judge in Sirasa Super Star 2004, 2006, 2008, and Derana London Star 2008 – 2010, in Rupawahini Ranawiru Real Star 2011, in Thurunu Shakthi, Ceylonta, TNL Star, Rupawaahini Gee Muthu 2007 – 2012, ITN supiri Hapana 2013 he distributed his knowledge on behalf of next era. In edition as first music VCD ever in Sri Lanka Thani Tharuwa was issued by himself in 1998 presenting his music and songs issued on Cassettes and CDs.Awards, honours and recognitionIn 1990, he participated in an international singing competition and as a best singer of Sri Lanka he represented Abu Golden Kite World Song festival in MaleysiaIn 1994, 1995, 1996 he was awarded by Srasavi film festival and he invited to perform opera called Siddartha at the annual Sai Baba Festival in India representing Sri Lanka as its music composer, arranger, singer and performer In 1995 he was awarded presidential award as a most popular pop music artist (western). In 1998 Sumathi Television award as a best young music director and best tele drama singer. In 2005 Bunka Award from Japan and 2005 Sri Lankan western music award as a best DUO Performance and best instrumentalist. As well he awarded at Raigam tele award as a best singer of 2008."}, {"name": "Lionel Ranwala", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Musician\nSinger\nComposer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "27 November 1939, Sri Lanka", "Death": "13 November 2002, Thalawathugoda\n(aged 63 years)", "description": "Lionel Ranwala (27 November 1939 – 13 November 2002) was a musician and a singer in Sri Lanka.\nRanwala's main interest was Sinhala folk music of Sri Lankan. He successfully brought Sinhala folk tunes and melodies to popular Sri Lankan music, preserving their originality.He studied music at the Panjab University, Chandigarh, India and has a sour knowledge of the field.\nRanwala, who created a revolution in the local folk music scene along with his mentor W.D. Makuloluwa, started his teaching career at Arawwala MMV in 1959.He taught music at several leading schools including Ananda College, and Royal College, Colombo during a 38-year career. He popularised local music in schools and formed the first 'Hevisi' band in a school – at Pannipitiya Dharmapala Vidyalaya in 1964. Ranwala was also a versatile actor and dramatist. One of his most memorable roles was in the first Sinhala opera 'Depano' directed by Makuloluwa. He also wrote and directed several children's dramas. He acted in several teledramas.His last teledrama was \"Rangamadala Samugani\" which was telecasted in Swarnawahini.\nHe travelled all over the island collecting folk songs for posterity. A staunch defender of indigenous music, he released several cassettes containing experimental folk music, notably 'Ahase Innavalu' in 1999. He formed the 'Thaalama Foundation' for preserving folk music. \"Gama Ahulaggang\", \"May Awurudu kale\" and \"Wannam Sawudam\" are some of his most famous songs.\nHe has two sons, Chirantha and Sahan. The elder, Chirantha is a presenter and producer at Swarnavahini.Sahan is also working at the Swarnawahini, but after his father's sudden death, has now taken the initiative to preserve and make people aware of Sinhala Folk Music, in the same way his father did.\nRanwala died, following a sudden accident at the age of 63, in 2002 at Thalawathugoda. His wife too faced the accident and was seriously injured.Produced Stage Dramas\n \n \nEka gediyay pala gaththe\n \nBeeri Ali\n \nNogiya gamana\n \n Songs\n \n \nAhase Innawalu\n \nAhuwama Kan Pirena\n \nAkulagena Sonda\n \nKelipodda Baledi\n \nMe Awurudu Kale\n \nMithuru Sarouhura\n \nPankiriththi\n \nPasunu Karal\n \nSanda Saawee Ma\n \nSawanath Kinihara\n \nSoya\n \nWannam Sawudam\n \nYuddetath Awith\n \n "}, {"name": "Clarence Wijewardena", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "3 August 1943, Haputale", "Death": "13 December 1996\n(aged 53 years)", "description": "Vithana Kuruppu-Arachchilage Clarence Arthur Somasinghe Wijewardena (popularly and commonly known as Clarence Wijewardena;Sinhalese: ක්ලැරන්ස් විජේවර්ධන; August 3, 1943 – December 13, 1996) was one of the most respected musicians in Sri Lanka, as per his popularity and contribution to revolutionize the Srilankan Sinhala Pop Music Industry who pioneered the use of electric guitar in Sinhala music. This was in the 1960s and is often named as the god-father of Sri Lankan pop music - having influenced performers in ranging from W. D. Amaradeva, Premasiri Khemadasa to Athula Adhikari. His music is often characterized by simple melodies built around a melody that features the electric guitar - this style may be best illustrated by the song Malata Bambaraku Se.Early life\n \nClarence Wijewardena was born on 3 August 1943, in Haputale, Sri Lanka, to an estate medical practitioner. His family moved to Batugedara, Ratnapura, and Clarence abandoned a career as a budding planter to pursue music full-time. He married Sheela Ramadasa and they had one daughter, Amila Priyadarshani.\n Moonstones\n \nWijewardena formed the Moonstones at the age of 21 with Annesley Malewana as lead vocalist. Managed by an advertising icon, Sri Sangabo Corea, the group recorded several songs to be aired on the Saturday Star program in 1966. The young musicians were mentored by Sri Sangabo Corea together with veteran Radio Ceylon/SLBC broadcasters Vernon Corea and Vijaya Corea. Their 1968 debut EP \nMango Nanda\n was released on the JVPC007 Philips label selling up to 5,000 copies. It included the songs \"Mango Nanda,\" \"Ruwan Puraya,\" \"Seetha Ude\" and \"Menike.\" The sophomore release \nMore Hits by the Moonstones\n came out November that year on the Sooriya label and included the hits \"Kalu Mama\", \"Rosa male\", \"Ramani\" and \"Goyam Kapanawa.\" \"Mango Nanda\" was selected the best Sinhala song by the Hit Parade program on Radio Ceylon. In 1969, the Moonstones welcomed female vocalist Indrani Perera who sang lead on the best selling \"Dilhani.\" Wijewardena himself only sang lead on \"Dileepa Podi Puthu,\" an adaptation of a poem written by Karunarathne Abesekara to his son.\n \nDuring the 'Moonstones' era, Wijewardena, who performed as a composer and music director, became a singer. Wijewardena took the initiative to start a three-member band, he was a self taughtself-taught guitarist. However, later the 'Moonstones' were formed with Annesley Malawana playing the key role as lead singer. Since then this exceptional man and his music dominated the Sinhala pop music industry. He is regarded by many as a pioneering Sri Lankan musician in the realms of Sinhala popular music.\n \nAfter he left the Moonstones in 1970, he held a musical show in Moratuwa with Shanaka Perera and Wijith Peiris and the show was named as \"Breakaways from the Moonstones\". The late Mike Goonesekera took over the reigns of the Moonstones after the departure of Clarence.\n Golden Chimes\n \nWijewardena departed the Moonstones and formed a new music group called the Golden Chimes, with ex-Moonstones bassist Chanaka Perera and Lankika Perera in January 1971. Their first release included \"Kimade Nawe\", \"Mage pelpathe\", \"Sihin Sinawai\" and \"Samanalayo.\" Subsequently English language vocalist Anil Bharati joined. The second EP on Philips label contained \"Malai Velai\", \"Sihil Nuwan\", \"Surangana Vesvala\" and \"Mage Viyowen\" and third EP contained \"Iru Dina\", \"Sandai Tharui\", \"Muhudu Rella\" and \"Thakkita Tharikita.\"\n \nAt this time Wijewardena found a professional lead guitarist Dixon Gunaratne at a wedding.\n \nAfter evaluating Bharati's performance for one year, Wijewardena decided to enter him into the Sinhala pop music scene. Wijewardena composed \"Ada Wei Iru Dina\" for Bharati which became an all time hit followed by the lovely Christmas song \"Bethlehempure\" and \"Maa Adarai Nangiye\". Clarence offered him another all time hit \"Tikirimalee\" with \"Ma Mulin Liyu Pem Pathe\", \"Desa Vidala\", \"Bambaraku Aduna\", \"Sarojini\" and \"Iru Dina Pamanak\".\n \nIn 1972, Wijewardena and Gunaratne left the Golden Chimes and they both formed a new band known as Super Golden Chimes also with the support of Annesley Malawana in 1973.\n The Super Golden Chimes\n \n \n \n \n \n \n \n \n \n \nThe Super Golden Chimes.\n \n \n \nWijewardena formed the \"Super Golden Chimes\" back in the company of his lifelong friend Annesley Malawana. It was one of the most productive music groups in Sri Lanka and together they hit the number one slot in the Sri Lankan music charts on both the Sinhala and English Services of Radio Ceylon and subsequently the Sri Lanka Broadcasting Corporation. For many years they enjoyed the reputation as Sri Lanka's number one group in the 1970s and 1980s. After three years Wijewardena decided to go solo when Annesley Malewana announced his plans for marriage.\n Experiments in Music\n \nWijewardena, like the Beatles, experimented with sitar music and introduced the sitar to some of the songs of the 'Moonstones.' Wijewardena was a musician's musician. He had the ability to grasp new trends in modern popular music. For the first time (for a recording) he used a guitar wah wah pedal for the song 'Pemkathwawa.' Also the song 'Sigiriya' was the first Bossa nova beat song in Sri Lanka and later he used this beat for the songs Piyaneni, Mage Palpathe, Muhudu Rella, Renin Piyabanna, Maliniye, Ramya (Previously sung by Wijewardena in 4/4 beat), Ran Monarun (Winslow Six), Lalitha Kala (Chithra Somapala) etc. Also he used two guitar players to play lead parts and counterparts of songs such as Sumudu Mal Pipinu, Dileepa Podi Puthu etc. For the first time in Sri Lanka he used the blocked guitar tone for the song 'Kusumalatha'. Wijewardena introduced some of the guitar techniques through his songs via a single guitar harmony style in the introduction of \"Dellepa podi puthu\" and arpeggio styles in \"Sihina Lowak\" and \"Malata Bambareku Se\".\n \nWijewardena composed a song Ma langin that was in the 1960s \"Twist\" style and released the song in \"Ugayen ugayata\" cassette in 1989.\n \nFor \"Dineka me nadee thira\" he used mute guitar technique for the introduction. Some of the guitar techniques Clarence used in his songs are alternate picking, Chicken picking, Carter Family picking, Cross picking, Flat picking, Golpe, Hammer-on, legato, Pick tapping, Pinch harmonic, Pull-off, Slide guitar, Sweep picking and tap harmonic.\n Tribute songs\n \nWijewardena has composed and directed music for a number of songs for the daughters and sons of his friends and relatives. He composed 'Piyaneni' in memory of the late Reverend Canon Ivan Corea who was the father of Radio Ceylon broadcaster, Vernon Corea. Wijewardena had met Corea in Maha Nuge Gardens in the 1960s during his visits to meet with Vernon Corea. The song became an instant hit in South Asia and to this day it is sung by Annesley Malewana on his world tours.\n \nWijewardena composed a song for the son of Vijaya Corea and it was titled as \"Viran Bilindhu Puthe\" After that Wijewardena changed the chorus part of the song and sang that song as Kiri Muhuda Kalabala. Also Wijewardena composed a song for the son of Chanaka and Lankika Perera and it was titled as \"Sihina Pathum Wimane\" Also the song \"Bethlehempure\" which was written by Sri Lanka's famed lyricist, Mr Karunaratne Abeysekera, became an instant hit on the island. It was one of many songs capturing the Christmas spirit and the birth of Jesus. Wijewardena also composed 'Naththal Seeya' in the early 1970s.\n \nWijewardena's first solo is 'Dileepa podi puthu' was written by Radio Ceylon broadcaster, Karunaratne Abeysekera for his own son. Wijewardena appreciated the work of Karu and wrote an instant song Seetha Pawan to express his gratitude on the day of the funeral of Karunaratne Abeysekera.\n Film music\n \nWijewardena entered the film music industry at that time. The first film with music directed by Wijewardena was 'Sikuruliya' and the sound track was supplied by the Golden Chimes - the film includes a scene where Wijewardena and the Golden Chimes perform at a party. Also for the music of the songs of Sikuruliya film, Wijewardena used western musical instruments as well as eastern musical instruments. The song 'Wasanthaye Mal Kekulay' which was composed by Wijewardena was the first song that consists of five lines in the chorus part of the song. He directed music for the films in a different and unique style of his own.And also he composed music for \"Apeksha\" directed by H.D.Premarathne.\n Outstanding skills\n \n \n \n \n Super Golden Chimes LP.\n \n \n \n \n \n \n Clarence in early 1980s.\n \n \n \nWijewardena showed his outstanding music skills during this time. He composed and directed music a song named as \"Maha Balwathune\" for the conference of the Non-Aligned Movement held in 1975 in Sri Lanka. He composed and directed music a song for the SAARC Conference as well. At the same time he sang the song \"Duwani Sirima\" when Hon. Former Prime Minister Mrs Sirimavo Bandaranaike arrived as the chief guest for the opening ceremony of Ceramic Corporation. Also Super Golden Chimes supplied music for that opening ceremony. Wijewardane certificated as the most popular composer in Sri Lanka for the years 1974 and 1976 by a pop poll conducted by Pop and Teen Fanfare. The song \"Kataragama\" which was composed by Wijewardane also certificated as the best song in Sri Lanka for the year 1974 by a pop poll conducted by Pop and Teen Fanfare. Wijewardena composed most number of songs for God Kataragama.\n \nIn the early 1970s, Wijewardena invited Radio Ceylon broadcaster, Vernon Corea who had mentored him from the start to write the notes on a Lotus LP sleeve. Vernon Corea wrote: \"We have all shared the treat of your lovely Lyrics, your tuneful compositions, your friendly presentation and your spontaneous sense of sharing with your followers, your treasury of talent. Keep going, keep growing, keep glowing\". In 1976, when Vernon Corea was invited to present the first Asian radio programme in English on BBC Radio London called 'London Sounds Eastern' he played the music of Wijewardena and Annesley Malewana, introducing them to a whole new audience in London.\n \nWijewardena started to sing for the Sinhala films under other music directors. Subsequently a cassette tape known as \"Any Time Any Where\" was released in Colombo. In 1979, Wijewardena left the Super Golden Chimes and started a solo career.\n Cricket fan\n \nWhen the Sri Lankan cricket team entered the world of test cricket in 1982, Wijewardena produced an album called \nTest Cricket Souvenir\n, comenerating the country achieving test cricket status. \"Thana Nilla Dige\" performed by Saman De Silva became a hit during the season of test matches and every big match in Colombo.there after. Other contributiors to the album included Nihal Nelson, Mariazelle Goonetilleke and Freddie Silva.\n \nWijewardena was concerned and made a statement to \nSathsara\n (an art magazine in Sri Lanka) regarding the song \"Thana Nilla Dige\" and how it's singer Saman De Silva was not given due credit for the song and published a full page article about the song in a newspaper around the time of the release of the song and cassette but did not mention the name of the composer\n New career\n \n \n \n \n Clarence with Vernon Perera, H.D.Premaratne & Hemasiri Halpita.\n \n \n \nWijewardena joined Sing Lanka Ltd. and acted as the General Manager. Sing Lanka recording studio was the first recording studio in Sri Lanka with multi tracks and Wijewardena was the pioneer to introduce this recording studio. During that time he directed music for a number of artists in Sri Lanka. He also produced a cassette tape named \"Clarence with the Rising Stars\".\n Directing music for tele dramas\n \nWijewardena directed music for the tele dramas Susima and Nidikumba Mal. He was the composer and the music director for all the six songs of Susima tele drama. During this time he got a special chance. That he was able to compose and direct music for Pandit Amaradewa. That song was Sasara Gewa Yana Diwi Gamane which contained in tele drama Nidikumba Mal. Also he composed and music directed a song which says about child abuse and other prohibited things happen in present society. That song was \"Daesawan Dase\" which contained in the Sihiwatana II Cassette Tape. When the royal tusker of the Temple of Tooth Relic died, Wijewardena composed and music directed a song about the royal tusker and it was named as \"Kandu Sikarin Wata Senkadagala Pura\". It was vocalized by the Ananda Perera who was the leader of the Siha Shakthi music band.\n Melodies for jingles\n \nWijewardena became famous for his melodious and catchy jingles aired over the Sri Lanka Broadcasting Corporation. These jingles were Elasto, Bata, Astra Margarine, Bristol Cigarettes, Arpico, Dot Toffee, Singer, Edna Chocolate, Thultex, Ice-Cream Soda, Development Lottery, Dasuna Cartoon Paper, Atlas pens, Orex pens, Building Materials Co-operation (in Sinhala and English), Keels and Health Joy Soap etc. The song \"Sigiri Ru Ladun Paradai\" which he composed for the beauty queen contest became an instant hit.\n Discovering new Sri Lankan music talent\n \nHe formed the Sri Lankan band \"Madhara\" in 1985 with Rookantha Gunatilake (keyboards), Mariazelle Goonetilleke (keyboards/female vocals), Raju Bandara (lead guitar), Keneth De Silva (bass guitar), Ajantha Dodampegama (drums) and rest of the other members of the group. During the 1980s, he composed and directed music for a number of songs and performed with well-known music directors in Sri Lanka.\n \nAll of Wijewardena's compositions have been recorded at some of the island's best recording studios and under the best producing labels in Sri Lanka. Some of the early 1960s recordings were at Augie Ranaweera's studio in Bambalapitiya.\n Later career\n \n \n \n \n Clarence with 3 Sisters.\n \n \n \nWijewardena organised three musical shows with his lifelong friend Annesley Malewana and Indrani Perera at BMICH in Colombo.\n \nWijewardena proved to be quite a hit in London when broadcaster Vernon Corea broadcast his music on BBC Radio London 206 on his popular radio programme, \nLondon Sounds Eastern\n. Wijewardena and Annesley frequently toured the United Kingdom in the 1980s playing to huge audiences in London.\n Controversy\n \nHowever, due to the popularity of his songs (which has grown since his death), they have also become the subject of a lawsuit over illegally recorded renditions sampled by other Sri Lankan artists. Wijewardena's widow Sheela Wijewardana in 2001 filed suit against Rajiv Sebastian, hoping to recover a portion of the income earned through the use of her late husband's work. An action doomed to failure due to the non availability of evidence on the part of the complainant. Since the lawsuit against Rajiv and Sarath Kothalawela, Sheela filed a wrongful lawsuit against Clarences long time friend and musical partner Annesley Malawana and lost it with no recourse. To this date, she has been unable to establish her rightful claims as the legitimate or legal heir to his intellectual property.\n Music\n \nSri Lanka's musician, Clarence Wijewardena, composed and sang over 1000 of songs but 40% of them were not released because the master recordings were under the custody of record producers. Some of the songs were released to the market without any authorized label after his death. They did not get the attention of his fans because they were considered to be illegal and most of the FM broadcasting channels in Sri Lanka were not aware of them. It is unfortunate that most of these songs are not released officially and Wijewardena did not get the due credit for them.\n \nWijewardena spent more of his composing time for his fellow singers and he had never been offered the credit for them.\n \nIn the course of his career, Wijewardena wrote several songs that became classics in his own time - among these; \nGamen Liyumak\n (Translated: A Letter From the Village), \nHiruge Lowedi\n (Translated: In the World of the Sun), \nKanda Surinduni\n (\"O Lord God of the Mountain\"),\nPiyaneni\n (\"Father\"), and \nMalata Bambaraku Se\n (Translated: Like a Bee To a Flower)\n Death\n \n \n \n \n Stone memorial (Tomb) of Clarance Wijewardana at Borella cemetery.\n \n \n \nWijewardena died on 13 December 1996, at the age of 53, in Sri Lanka after a long struggle against ruptured gastric ulcers and gangrene due to accute Diabetes.\n Legacy\n \nMany of his songs are considered classics, and continue to enjoy ample airtime on Sri Lankan television and radio broadcasts and on some overseas radio stations. The songs such as Rasa Pirunu Katha, Geeyakin Kese, Eatha Ran Wiman Yowun Sihina Loke, etc are very popular among present generation which again demonstrated his talent in composing music (also as a lyricist) for the future.\n "}, {"name": "Freddie Silva", "info": "Sri Lankan actor-singer", "Intro": "Sri Lankan actor-singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "18 May 1938, Moratuwa", "Death": "29 October 2001\n(aged 63 years)", "description": "Halpeliyanage Morris Joseph de Silva, popularly as Freddy Silva (Sinhala: ෆෙ‍්‍රඩී සිල්වා) (1938–2001), was a Sri Lankan film actor, and a playback singer, who appeared from 1973 until 2002. Freddie is known as the most popular Sri Lankan comedian of the 1960s, 1970s and 1980s. He appeared in over 450 films of which 300 were screened at the celebration of fifty years in Sinhala Cinema). \nBiography\n \nEarly life\n \nSilva was born Halpeliyanage Morris Joseph de Silva in Puvakaramba, Moratuwa an only child. Silva's father was an overseer for the Moratuwa Urban Council and his mother was a member of Salvation Army. Growing up he was fascinated with singing and dancing.\n \nMusician\n \nIn the 1950s Silva performed the Alanson Mendis composition \"Bar Bar Bar\" in front of Sir John Kotelawala and was warmly received. He used this opportunity to get a letter of recommendation from Kotelawala which he presented to Livy Wijemanne of Radio Ceylon to secure a job as a radio artist.\n \nSilva's first recording was \"Mottapala.\" He followed the song with \"Bar Bar Bar\" now updated with music by P. L. A. Somapala. It was a success. Subsequent efforts teamed Silva with the late Premakirthi de Alwis. Their work include comedic songs like \"Aron Mama\", \"Pankiritta\", \"Nedeyo\", \"Handa Mama\", \"Kekille Rajjuruwo\" and \"Parana Coat\" (from \nLokuma Hinawa\n). Silva's crowning achievement is considered the tune \"Kundumani.\"\n \nActor\n \nSilva got his first screen role through a chance meeting with K. A. W. Perera in 1963. At that time he was living with H. R. Jothipala and Roy de Silva and frequented parties as a guest entertainer. Perera cast Silva in \nSuhada Sohoyuro\n alongside L. S. Ramachandran and Vijitha Mallika. He appeared at a dance on the beach singing \"Diya rella verale hapi hapi\" and went on to be cast in mainly comedic roles.\n \nThe serious side of Silva was seen in \nSekaya\n (1965), \nLasanda\n (1974) and \nSukiri kella\n (1975). In the 1975 film he played a mentally handicapped character and in preparation for the role lived with a real handicapped boy in Koralawella.\n \nBy the 1980s, producers were reluctant to make a film without Silva fearing that the movie would flop. He was then living an extravagant life and saved little. In 1989 Silva was awarded the Ranathisara award by leading film weekly Sarasaviya. A turning moment came when his friend Vijaya Kumaratunga (who he appeared alongside in ten films the last being \nYukthiyada Shakthiyada\n) was murdered. He cites this event as leading to the downfall of cinema. Still Silva stayed busy appearing in 15 of the 26 films made in 1992.\n \nBy the late-'90s Silva received no work and lived in poverty with a pension of 2000 rupees from the Sri Lankan Film Corporation. He called his home a broken down garage that served as bed room, living room and kitchen on Emmanuel Church Road, Rawatawatte. Silva died on 29 October 2001.\n Family\n \nFreddie Silva was a father of two children, his son Janesh Silva, was also an actor and a singer. He died on June 10, 2012 while he was taking medical treatments for cancer. Janesh Silva is known as a comedian that acted in 10+ films. Freddie's daughter Chandani Silva is a singer and actress. She is currently working to keep his father and brother's legacy.\n Filmography\n \n \n \nYear\n \nFilm\n \nRole\n \n \n \n1963\n \nSuhada Sohoyuro\n \n \n \n \n1965\n \nSepatha Soya\n \n \n \n \n1966\n \nSeethala Wathura\n \n \n \n \n1966\n \nMahadena Muththa\n \n \n \n \n1969\n \nPaara Walalu\n \n \n \n \n1970\n \nOhoma Hodada\n \n \n \n \n1971\n \nSamanala Kumariyo samaga Api Kawadath Soorayo\n \n \n \n \n1972\n \nSujeewa\n \n \n \n \n1973\n \nHaddinnath Tharu\n \nAsoka's friend\n \n \n \n1973\n \nSunethra\n \nGeetharatne\n \n \n \n1973\n \nDahakin Ekak\n \n \n \n \n1973\n \nHondata Hondai\n \nKomalawathie\n \n \n \n1974\n \nLasanda\n \nVijay\n \n \n \n1974\n \nDuleeka\n \n \n \n \n1974\n \nKasthuri Suwanda\n \nKamal's friend\n \n \n \n1974\n \nDinum Kanuwa\n \n \n \n \n1974\n \nSheela\n \nPoster affixer / Guru\n \n \n \n1974\n \nSihasuna\n \n \n \n \n1974\n \nShanthi\n \n \n \n \n1974\n \nJeewana Ganga\n \n \n \n \n1974\n \nUnnath Daahai Malath Daahai\n \n \n \n \n1975\n \nObai Mamai\n \nSirisena\n \n \n \n1975\n \nSukiri Kella\n \nPushpananda / Robert Louis Nanapala\n \n \n \n1975\n \nSadhana\n \n \n \n \n1975\n \nMage Nandi Shyama\n \n \n \n \n1976\n \nHariyata Hari\n \nChauffeur 'Somapala'\n \n \n \n1976\n \nRajagedara Paraviyo\n \n \n \n \n1976\n \nKolamba Sanniya\n \nTarzan\n \n \n \n1976\n \nHaaratha Hathara\n \n \n \n \n1976\n \nAasha\n \n \n \n \n1976\n \nWasana\n \nMartin\n \n \n \n1976\n \nRan Thilakaa\n \n \n \n \n1976\n \nKauda Raja\n \nPeacock (\"Dine Lanka\")\n \n \n \n1976\n \nAdarei Man Adarei\n \n \n \n \n1977\n \nMaruwan Samaga Waase\n \nMudalali store frequenter\n \n \n \n1977\n \nTom Pachayaa\n \n \n \n \n1977\n \nHithuwakkarayo\n \n \n \n \n1977\n \nSiri Madaara\n \n \n \n \n1977\n \nHariyanakota Ohoma Thamai\n \n \n \n \n1977\n \nNiluka\n \n \n \n \n1977\n \nChin Chin Nona\n \n \n \n \n1977\n \nSaja\n \n \n \n \n1977\n \nSithaka Suwanda\n \nTintin\n \n \n \n1978\n \nSasara\n \n \n \n \n1978\n \nMaduwanthi\n \nFreddie\n \n \n \n1978\n \nSiripathula\n \n \n \n \n1978\n \nApsara\n \n \n \n \n1978\n \nDeepanjali\n \n \n \n \n1979\n \nSamanmalee\n \n \n \n \n1979\n \nMinisun Athara Minisek\n \n \n \n \n1979\n \nMuwan Pelessa\n \nPina\n \n \n \n1979\n \nRose Mal Thunak\n \nFlutist\n \n \n \n1979\n \nAkke Mata Awasara\n \n \n \n \n1979\n \nSubhani\n \n \n \n \n1979\n \nNuwan Renu\n \nPabilis\n \n \n \n1979\n \nWisihathara Peya\n \n \n \n \n1979\n \nHari Pudumai\n \n \n \n \n1980\n \nSilva\n \n \n \n \n1980\n \nMuwan Pelessa 2\n \nPina\n \n \n \n1980\n \nAdara Rathne\n \nStudent leader\n \n \n \n1981\n \nKolam Karayo\n \nAhanga Lal Sulojana\n \n \n \n1981\n \nGeethika\n \nSilva 'Mahathaya'\n \n \n \n1981\n \nAnjaana\n \n \n \n \n1981\n \nEk Dawasak Ra\n \nPhotographer\n \n \n \n1981\n \nAmme Mata Samawenna\n \nFreddie\n \n \n \n1982\n \nMiss Mallika 1982\n \n \n \n \n1982\n \nWathura Karaththaya\n \nReporter\n \n \n \n1982\n \nKadawunu Poronduwa New\n \nSewaris 'Unnah'\n \n \n \n1983\n \nSumithuro\n \n \n \n \n1983\n \nChandi Siriya\n \n \n \n \n1983\n \nSister Mary\n \nFriend\n \n \n \n1983\n \nHasthi Viyaruwa\n \nVelu\n \n \n \n1984\n \nAra Soyza\n \nSoyza\n \n \n \n1984\n \nKakiley Rajjuruwo\n \nAndare\n \n \n \n1985\n \nAraliya Mal\n \nBanda\n \n \n \n1986\n \nDinuma\n \nUstad\n \n \n \n1987\n \nYugayen Yugayata\n \n \n \n \n1987\n \nThaththi Man Adarei\n \n \n \n \n1987\n \nYukthiyada Shakthiyada\n \n \n \n \n1987\n \nRaja Wedakarayo\n \nUpul 'Music Master'\n \n \n \n1987\n \nRan Dam Wel\n \n \n \n \n1987\n \nObatai Priye Adare\n \n \n \n \n1987\n \nAhinsa\n \n \n \n \n1987\n \nHitha Honda Chandiya\n \nSerpino\n \n \n \n1989\n \nMamai Raja\n \n \n \n \n1988\n \nNewa Gilunath Bandchun\n \nGira\n \n \n \n1988\n \nRasa Rahasak\n \n \n \n \n1988\n \nGedara Budun Amma\n \nMinister\n \n \n \n1988\n \nAmme Oba Nisa\n \n \n \n \n1988\n \nAngulimaala\n \n \n \n \n1988\n \nDurga\n \n \n \n \n1988\n \nSatana\n \n \n \n \n1988\n \nNewatha Api Ekwemu\n \n \n \n \n1988\n \nChandingeth Chandiya\n \n \n \n \n1989\n \nBadulu Kochchiya\n \n \n \n \n1989\n \nMamai Raja\n \nRanjith's Advisor's son\n \n \n \n1989\n \nNommara 17\n \nPotato 'Nommara 13'\n \n \n \n1989\n \nObata Rahasak Kiyannam\n \n \n \n \n1989\n \nRandenigala Sinhaya\n \nSunny 'Aiyya'\n \n \n \n1990\n \nSambudu Mahima\n \n \n \n \n1990\n \nDese Mal Pipila\n \n \nBandu\n \n \n \n \n1990\n \nThanha Aasha\n \n \n \n \n1990\n \nDedunnen Samanaliyak\n \n \n \n \n1990\n \nWalavuve Haamu\n \n \n \n \n1990\n \nPem Raja Dahana\n \n \n \n \n1991\n \nPaaraadeesaya\n \n \n \n \n1991\n \nBambara Kalape\n \n \n \n \n1991\n \nLove In Bangkok\n \n \n \n \n1991\n \nCheriyo Doctor\n \nDoctor Koko\n \n \n \n1992\n \nSathya\n \n \n \n \n1992\n \nJaya Siri We Kumariya\n \n \n \n \n1992\n \nKadiraa\n \n \n \n \n1992\n \nKiyala Wadak Na\n \nJackie\n \n \n \n1992\n \nSinhayageth Sinhaya\n \nSergeant Jayapala\n \n \n \n1993\n \nJooriya Mamai\n \n \n \n \n1993\n \nSarjant Nallathambi\n \n \n \n \n1993\n \nSurayan Athara Veeraya\n \nSunil\n \n \n \n1993\n \nSura Veera Chandiyo\n \nCID Silva\n \n \n \n1993\n \nMewila Penevi Roope\n \n \n \n \n1994\n \nOkkoma Hodatai\n \nHimself\n \n \n \n1994\n \nRaja Wansen Ekek\n \nSunny\n \n \n \n1994\n \nVijaya Geetha\n \nDougie \"Payan' Jayasuriya\n \n \n \n1995\n \nInspector Geetha\n \n \n \n \n1995\n \nPudumai Eth Aththai\n \n \n \n \n1995\n \nVairayen Vairaya\n \n \n \n \n1995\n \nCheriyo Captain\n \nPing Pong\n \n \n \n1996\n \nSura Daruwo\n \n \n \n \n1996\n \nManamohini\n \nDougie\n \n \n \n1996\n \nSihina Vimane Rajakumari\n \n \n \n \n1996\n \nCheriyo Darling\n \n \n \n \n1997\n \nRaagaye Unusuma\n \n \n \n \n1997\n \nSoorayo Wedakaarayo\n \n \n \n \n1999\n \nKolompoor\n \n \n \n \n2001\n \nJolly Halo\n \n \n \n \n2001\n \nOba Kohida Priye\n \n \n \n \n2001\n \nPissu Pooso\n \nPachavansa\n \n \n \n2002\n \nParliament Jokes\n \n \n \n \n2002\n \nPissu Double\n \n \n \n \n \nAs Producer\n \n \n \nYear\n \nFilm\n \nDirector\n \n \n \n1994\n \nOkkomta Hodatai\n \n \n \n \n Songs\n \n \nAachchi Podi Wedawarjanayak\n \nAappa Weladaamey Umba\n - with Kalawathee\n \nAaraadhitha Amuththek (Vikata Rasaanga)\n - with Gemunu Wijesuriya\n \nAaron Maama\n \nAaronge Malli Baaron\n \nAawaa Mey Mama\n - with Anjaleen Gunathilake\n \nAhanna Balanna\n \nAladinge Puduma Pahana\n - with Nihal Nelson\n \nAllapu Gedarin\n \nAluth Kathawak\n \nAluth Kalaawak\n \nAmuthu Adum ada\n \nAnangaya Anangaya\n - with Anjaleen Gunathilake\n \nAmuthu Sathaa\n \nAndare\n \nAndare Mehe Waren\n - with Desmond De Silva\n \nAnna Hande Haawa\n \nApi Kaatada Baya\n - with H.R. Jothipala\n \nArabiye Thele\n \nArulu Burulu\n \nAta Sakilla Waage\n \nAthaka Selawena\n \nAthadunna Hithawanthi\n \nAththa Yukthiyata\n \nAu Au Au Au Mage Sawarina\n \nAyiya Saami\n - with Kalawathee\n \nBaanumathi\n \nBachna Bachana\n \nBalla Balla\n \nBallan Biruwata\n \nBam Manna\n \nBar Eken Beela\n \nBara Karaththe\n \nBatakola Wattiyakata\n - with Kalawathiee\n \nBeela Beela\n \nBlade Thaley\n \nBombay Sundaree\n \nBola Kadala Seeni Kadala\n - with Kalawathee\n \nBoru Manasgaatha Noweyi\n \nBulath Wadiyak\n \nBuruthu Buruthu Mal\n \nBuuru Naamba\n \nChandrase Kelum\n \nCheriyo Kiyala Me\n - with Gration Ananda\n \nCheene Indalaa Aawe\n - with Kalawathee\n \nChi Chi Chi\n \nChimpanci Putha\n \nChin Chin Nona\n - with H. R. Jothipala and Milton Perera\n \nDannawu Rata Pawathenna Wu\n \nDawasak Daa Kakuluwekuta\n \nDeweta Dige Man Awa\n \nDil Thadap Thadap (Illagena Kana Parippu)\n \nDiya Yata Wiskam\n \nEkamath Eka Rataka Ea Kale\n \nEnakota Enawa Hina Wevi (Nadayo)\n \nEnna Enna Wadiwenna\n \nGaha Kola Mal\n - with H.R Jothipala\n \nGaja Labai Nona Mahathune (Pacha)\n \nGalkisse Muhudu Werale\n \nGalu Muwadora Pitiye (Dahas Gananakin)\n \nGanu Parane Mawwe Deyyo\n \nGigiri Jagari Handawana\n \nGiri Goris\n \nHanda Mama Udin\n \nIndi Gaha Yata Wadiwela\n \nIpadunu Rata Daya\n \nIrida Pole Domba Gaha Yata\n \nJack Saha Jil\n \nKamatha Gawa'\n - with Nirosha Virajini\n \nKaputulanthe Wasiyo\n \nKawadawath Na Mehema Deyak\n \nKawuda Gona (Oon Maru Hathara Hina)\n \nKawuda Me Ane\n - with Kalawathee\n \nKewilige Patiya (Kaputige Kooduwe)\n \nLagadi Papai Nondi Jimai\n \nLokaya Namathi Game\n \nMaduruwathi (Keen Koon Hangi Hangi)\n \nMaha Kaleka Benayaka (Naga Rajaya)\n \nMaha Kelaye Nuga Sewane (Bakamuna)\n \nMamai Motta Pala\n \nMame Me Bakamuna\n - with H.R Jothipala\n \nMangala Athupita Sarasi\n \nMayam Mawala Pala\n \nMe Danno Danithi\n \nMini Gejji Handana\n \nMy Name Is Saiman Silva\n \nNaga Rajaya (Maha Kalayaka Benayaka)\n \nNandamma Na Nedo\n - with Srilal Abeykoon\n \nNikamma Inna Wadata Adanna (Pin Batha)\n \nNitharama Biruwata Ballek\n \nOba Raja Weela\n - with Kalawathee\n \nOnna Babo Billo Enawa\n \nOr Mister\n \nPana Palayan Labana Sumane\n \nPankiriththa\n \nParana Coat\n \nParawiya Wage Raja Malige\n \nPata Sarungal Wagei\n - with Vijaya Kumaranatunga\n \nPrincy Darling My Sweety\n \nRaigamayanani Gampolayanani\n \nRaja Umbane Gona\n \nRakinna Kiyala Aran Thibba\n \nRan Thatiyaka Kiri Pani Purawala\n \nRupiyal Lakshayak Thagi\n \nSalli Labenakota\n \nSando Gundo (Kalayakin Nowa Munagahune)\n \nSopinath Ekka Man\n \nSurangani Surangani\n \nThamath Innawa (Vijaya Kuwenila)\n \nThangamani\n - with Kalawathee\n \nThea Kude Pite Badan\n \nTikiri Kirilliyo\n \nTopsina Premi Mage\n \nUpan Dine Langa Ena Hinda\n \nVikara Loke Loka Vikare\n \nWadath Agei Hadath Penei\n - with Gration Ananda\n \nWeda Mahaththaya\n \nWella Simbimin Rali Perale\n \nYakada Kate\n - with Anjaleen Gunathilaka\n \nYantham Athi\n \nYantham English Dana Gaththa\n \n "}, {"name": "Vivienne de Silva Boralessa", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "Birth": "24 September 1930", "Death": "2 April 2017\n(aged 86 years)", "description": "Vivienne de Silva Boralessa\n (Sinhalese: \nවිවියන් ද සිල්වා බොරලැස්ස\n; 24 September 1930 - 2 April 2017) was a Sri Lankan singer known particularly for her Buddhist devotional music. Her fame peaked in the 1950s, in what is known as Sri Lanka's 'gramophone era'."}, {"name": "Vijaya Kumaranatunga", "info": "Actor", "Intro": "Actor", "Was": "Singer\nActor", "From": "Sri Lanka", "Type": "Film, TV, Stage & Radio\nMusic", "Gender": "male", "Birth": "9 October 1945, Sri Lanka", "Death": "16 February 1988\n(aged 42 years)", "Star sign": "Libra", "Politics": "Lanka Sama Samaja Party", "Family": "Spouse:\n\nChandrika Kumaratunga", "description": "Kovilage Anton Vijaya Kumaranatunga (Sinhalese: කොවිලගේ ඇන්ටන් විජය කුමාරණතුංග Tamil: விஜய_குமாரணதுங்க ; 9 October 1945 – 16 February 1988), also known as Vijaya Kumaranatunga, was a popular Sri Lankan film actor and politician, married to former Sri Lankan president Chandrika Kumaranatunga from 1978 to his assassination in 1988.Family life\n \nIn 1978, Kumaranatunga married Chandrika Bandaranaike, daughter of the Sri Lankan Prime Minister S. W. R. D. Bandaranaike and Prime Minister Sirimavo Bandaranaike. Vijaya Kumaranatunga and Chandrika Bandaranaike had two children, Yasodhara Kumaranatunga Walker, a UK-based physician, and Vimukthi Kumaranatunga, a vet.\n Cinema career\n \nKumaranatunga's first film was \nHanthane Kathawa\n, in which he played the lead role. Since then, in a career that spanned nearly two decades, he acted in 114 films including \nEya Den Loku Lamayek\n (1975), \nPonmani\n (1977), \nBambaru Avith\n (1977), \nGanga Addara\n (1980), \nBaddegama\n (1980), Paradige (1980), Maha Gedara (1980), Kedapathaka Chaya (1989) and Kristhu Charithaya (1990). He also won several awards. He won the most popular actors award in Sri Lanka from 1983 to 1988. That was a record in the history of Sri Lankan cinema. He was posthumously awarded as the best actor for the role he played in \nKedapathaka Chaya\n. He performed as a playback singer as well in several films and won the Best Playback Singer Award for two times (For \"Saharawe Sihinya\" Movie - \"Walakulak Gena Muwa Karamu Hiru.....\" & \"Dolosmahe Pahana\" Movie- \"Sara Guwana Wida Neguna.....\"). Also, he sang more than 100 songs by releasing nearly 10 cassettes (Ganga Addara, Kawluwa Atharin, Vedana, Dinakara Paya, Vijaya Gee, Seetha Reyedi, Mangala Nekatha, Sudu Duwa, Roossa Gaha Langa). He sang all his songs without taking any money. During his career, Vijaya performed in one English film, \nThe God King\n, and one Tamil film, \nNanguran\n. The only film he produced was \nWaradata Danduwam\n, which was screened after his death.\n Political career\n \nHe was also a politician, who started his political life in the Lanka Sama Samaja Party. He later joined the Sri Lanka Freedom Party and was SLFP's 1st National Organizer and unsuccessfully contested the Katana seat in 1977. He was active in the presidential campaign of Hector Kobbekaduwa in 1982. After the election, he was jailed under the emergency regulations by J.R Jayawardena for allegedly being a \"Naxalite\" (a political creed hitherto and henceforth unknown in Sri Lanka), but he was never charged. He contested Mahara by-election under SLFP candidature in 1983 and was maltreated by UNP supporters. An attempt was made on his life and one of his friends was killed. Vijaya won the first round of counting and a second round was ordered. At that point an infamous blackout occurred at the counting centre. By the time electricity was restored, the UNP candidate had recorded a victory by a few votes. The opposition insisted that someone had literally \"eaten some of Vijaya's votes to ensure UNP victory\".\n \nHe founded the Sri Lanka Mahajana Party (SLMP). He and his party argued for peace in the then ongoing civil war in Sri Lanka. He contested the Minneriya by-election under the newly elected SLMP and recorded the second place in the competition that was won by the UNP candidate however sending his old party SLFP to a humiliating third position. His party then contested at several by-elections including Kundasale and Habaraduwa but did not live up to expectations. In his final public address Kumaratunga who had a political mission - one that transcended political barriers expressed his unconcealed dislike for feudalistic politics of the Sri Lanka Freedom Party (SLFP), a party that failed to sustain his interest due to its sheer lack of liberal thinking. Addressing the mammoth public rally held at Campbell Park on January 28, 1988, Kumaratunga lashed out at the UNP, SLFP and the JVP for failing to address the need of the hour. Interestingly, Kumaratunga also voiced his concerns about the SLFP's links with the JVP. In 1988 his party came to a concillation with several other left wing parties including LSSP, NSSP, Sri Lanka Communist Party and EPRLF to form a new alliance-United Socialist alliance(USA). A few days prior to the establishment of the new alliance,Vijaya was assassinated. The agreement for USA was signed by the party leaders at his funeral ceremony.USA won a large number of seats in the newly erected provincial councils in an election that was boycotted by the main opposition SLFP. Later USA forwarded Ossie Abeygoonasekera as its presidential candidate and he would record the last place at the presidential elections in 1988. USA contested at the 1989 Parliamentary Elections and won three seats including one from the national list however all the winners represented member parties of USA other than SLMP.\n 1986 Jaffna Visit\n \nin 1986, Vijaya Kumaranatunga visited Jaffna which was under LTTE Control. A rare video shows that he visited Nallur Murugan Temple and met the local Tamil civilians. He met several Youth LTTE Leaders before returning to Lankan Military Camp.\n Death and legacy\n \nKumaranatunga was shot in the head with a Type 56 assault rifle outside his residence in the outskirts of Colombo on 16 February 1988 at 12.20pm by Lionel Ranasinghe alias Gamini, who later confessed to the murder upon being questioned by the Criminal Investigation Department (CID). Ranasinghe, in a 141-page statement, confessed that he was merely carrying out orders given to him by the Deshapremi Janatha Viyaparaya (DJV)/Patriotic People's Movement, the military arm of the Janatha Vimukthi Peramuna (People's Liberation Front), a Marxist organization which is responsible for assassinations during the late 1980s. However, the Presidential Commission report had concluded that President Ranasinghe Premadasa, Gamini Lokuge and the Deputy Minister of Defence Ranjan Wijeratne of the United National Party had been behind the Vijaya Kumaratunga assassination. Kumaratunga's widow Chandrika Bandaranaike Kumaratunga also holds this view. Kumaratunga's funeral had attracted the most number of people for a funeral in Sri Lanka. Vijaya's coffin was only partly opened (the head part was closed due to damage sustained during the assassination). The funeral was held at the Independence Square in Colombo on 21 February 1988 as a state funeral, though he represented the opposition arena against the UNP government. It was the first ever funeral ceremony to be telecast live on a Sri Lankan TV Channel (by Sri Lanka Rupavahini Corporation). Twelve people reportedly committed suicide after hearing of his death. His assassination day (16 February 1988) is widely known as the \"The Horrible Tuesday\" or \"The Darkest Tuesday in Sri Lankan History\". Kumaranatunga's death is still mourned by many people in Sri Lanka.\n Filmography\n \n \n \nYear\n \nFilm\n \nRole\n \nNotes\n \n \n \n1967\n \nManamalayo\n \n \nActing debut\n \n \n \n1969\n \nRomio Juliet Kathawak\n \n \n \n \n \nHanthane Kathawa\n \n \n \n \n \n1970\n \nPriyanga\n \n \n \n \n \n1971\n \nRan Onchilla\n \n \n \n \n \nAbirahasa\n \n \n \n \n \nKesara Sinhayo\n \n \n \n \n \nHatharadenama Soorayo\n \n \n \n \n \nSamanala Kumariyo Samaga Api Kawadath Soorayo\n \n \n \n \n \nBindunu Hadawath\n \n \nAlso film's producer\n \n \n \n1977\n \nMe Desa Kumatada\n \n \n \n \n \nEdath Sooraya Adath Sooraya\n \n \n \n \n \nVana Raja\n \n \n \n \n \nAdare Hithenawa Dakkama\n \n \n \n \n \nThushara\n \nSampath\n \n \n \n \nHaddinnath Tharu\n \n \n \n \n \nDahakin Ekek\n \n \n \n \n \nHondama Welawa\n \n \n \n \n \n1974\n \nSusi\n \n \n \n \n \nAhas Gauwa\n \n \n \n \n \nDuleeka\n \n \n \n \n \nSanakeliya\n \n \n \n \n \nThe God King\n \nLalith\n \nEnglish Film\n \n \n \n1975\n \nPem Kurullo\n \n \n \n \n \nSikuruliya\n \n \n \n \n \nLassana Dawasak\n \n \n \n \n \nSangeetha\n \n \n \n \n \n1976\n \nPradeepe Ma Weva\n \n \n \n \n \nVasana\n \n \n \n \n \nDiyamanthi\n \n \n \n \n \nUnnath Dahai Malath Dahai\n \n \n \n \n \nAdarei Man Adarei\n \n \n \n \n \n1977\n \nSakunthala\n \n \n \n \n \nHithuvoth Hithuvamai\n \n \n \n \n \nMaruwa Samaga Wase\n \nMaru Sira\n \n \n \n \nHariyanakota Ohoma Thamai\n \n \n \n \n \nEya Den Loku Lamayek\n \n \n \n \n \nPembara Madhu\n \n \n \n \n \n1978\n \nVishmaya\n \n \n \n \n \nKundala Keshi\n \n \n \n \n \nSandawata Ran Tharu\n \n \n \n \n \nAnupama\n \n \n \n \n \nSelinge Walawuwa\n \n \n \n \n \nBambaru Awith\n \nVictor\n \n \n \n \nSally\n \n \n \n \n \nKumara Kumariyo\n \n \n \n \n \nAhasin Polowata\n \n \n \n \n \n1979\n \nGahaniyak\n \n \n \n \n \nPodi Malli\n \n \n \n \n \nHingana Kolla\n \n \n \n \n \nMonarathenna\n \n \n \n \n \nEka Hitha\n \n \n \n \n \nAkke Mata Awasara\n \n \n \n \n \n1980\n \nRaja Dawasak\n \n \n \n \n \nGanga Addara\n \nDr. Sarath Pathirana\n \n \n \n \nKarumakkarayo\n \n \n \n \n \nKinduru Kumari\n \n \n \n \n \nPara Dige\n \nChandre\n \n \n \n \nTak Tik Tuk\n \n \n \n \n \nKanchana\n \n \n \n \n \n1981\n \nBeddegama\n \nBabun\n \nBased on Leonard Wolf's \"Baddegama\"\n \n \n \nGithika\n \n \n \n \n \nAnjana\n \n \n \n \n \nSuriyakantha\n \n \n \n \n \nValampuri\n \n \n \n \n \n1982\n \nYasa Isuru\n \n \n \n \n \nMihidum Sihina\n \n \n \n \n \nRahasak Nathi Rahasak\n \n \n \n \n \nMaha Gedara\n \n \n \n \n \nKadawunu Poronduwa (New)\n \nSamson\n \n \n \n \nNewatha Hamuwemu\n \n \n \n \n \nParamitha\n \n \n \n \n \n1983\n \nSamanala Sihina\n \n \n \n \n \nSivu Rangasena\n \n \n \n \n \nPasta Mithuro\n \n \n \n \n \nSandamali\n \n \n \n \n \n1984\n \nKokila\n \n \n \n \n \nJaya Sikurui\n \n \n \n \n \nBinaree Saha Audu Banda\n \n \n \n \n \nWelle Thenu Maliga\n \n \n \n \n \n1986\n \nDevuduwa\n \n \n \n \n \nPeralikarayo\n \nVijay/Samson\n \nDual Role\n \n \n \nJaya Apitai\n \n \n \n \n \nGimhane Gee Naade\n \n \n \n \n \n1987\n \nYugayen Yugayata\n \n \n \n \n \nYukthiyada Sakthiyada\n \n \n \n \n \nKavuluva\n \n \n \n \n \nRaja Wedakarayo\n \n \n \n \n \nRandamwel\n \n \n \n \n \nObatai Priye Adare\n \n \nRavi\n \n \n \n \n \nAhinsa\n \n \n \n \n \n1989\n \nMamai Raja\n \n \n \n \n \nKadapathaka Chaya\n \n \n \n \n \nBadulu Kochchiya\n \n \n \n \n \nNommara 17\n \nVijaya\n \n \n \n \nVaradata Danduvam\n \n \nAlso film's producer\n \n \n \nRandenigala Sinhaya\n \n \n \n \n \n1990\n \nDese Mal Pipila\n \n \nVijey\n \n \n \n \n \nThanha Asha\n \n \n \n \n \nVeera Udara\n \n \nGuest Appearance\n \n \n \nChristhu Charithaya\n \nJesus\n \n \n \n \nSaharawe Sihinaya\n \n \nSarasaviya Awards for \nBest Playback Singer'\n \n \n \n1991\n \nMadhusamaya\n \n \n \n \n \n1993\n \nSoorayan Athara Veeraya\n \n \n \n \n \n1995\n \nHitha Honda Soorayo\n \n \n \n \n \n1998\n \nAya Obata Barai\n \n \n \n \n "}, {"name": "Mariazelle Goonetilleke", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "female", "description": "Mariazelle Goonetilleke is a leading Sri Lankan singer and music star. She has performed to capacity filled auditoriums not only in Sri Lanka but also as far afield as the United Kingdom, United States, United Arab Emirates, Singapore and Australia.Early years\n \nMariazelle Goonetilleke was born in Nugegoda in Colombo, Sri Lanka. She began her music career at the age of 7 years. At the age of 10 Mariazelle won the Junior Section of the Ceylon Observer All Island Talent Competition – it opened the door for her to join a pre-teen group of young musicians called the 'Junior Rhythmiers', a music group that was popular in Sri Lanka. The group were thrown into the spotlight when they were featured in the 1960s over the airwaves of Radio Ceylon, the oldest radio station in South Asia. The radio station 'ruled the airwaves' in the 1950s and 1960s so any exposure on Radio Ceylon was a huge boost to young artistes on the island. Mariazelle's music career spiralled upwards.\n \nShe studied classical guitar tutored by the renowned classical guitarist, the late Winston Jayawardene and vocal music from Mrs. Estelle de Niese. Mariazelle Goonetilleke attended St. Joseph's Convent School, Nugegoda.\n Kandy Lamissi\n \nWinning the Ceylon Observer Talent Contest was a huge boost for Mariazelle. According to the Sunday Observer of Colombo: ' This gave her more courage to play with bands like \"The Emeralds\" and the \"Midnight Mist\". Recording \"Kandy Lamissi\" in 1977 was the virtual turning point in her career. The song was an instant hit and Mariazelle came to be known by that name.\n \nThis new \"Kandy Lamissi\" had to move from place to place not only here, but also in top hotels like Soaltee Oberoi in Kathmandu, Nepal to perform. In the same year she met with an accident in Nuwara Eliya in which she sustained serious injuries to her spine and collar bone. Helped by her dear classmate, Christine Nadarajah at that time, her belief in God and community prayers saw her out from that dark period, Mariazelle claimed. Out from hospital Mariazelle had the privilege of getting the helping hands of legends like Clarence Wijewardene, the Emperor of Baila, M. S. Fernando, Stanley Peiris, Ajantha Ranasinghe, Chandral Fonseka and Sunil/Piyal of the \"Gypsies\". The compositions of Clarence and others provided her a different style and rendition that attracted music lovers. Ajantha's composition \"Sihina Nelum Mal\" was dedicated to her son, Teshan now studying in England.'\n Music Genre\n \nMariazelle has been involved with a range of music genre – from western pop music to Sri Lankan baila. She is now well known as a leading baila singer, performing her massive hit 'Kandy Lamissi,' all over the world. American Fulbright Scholar, Vasana Kelum de Mel, from the University of California, Los Angeles (UCLA) observed: 'Since I feel it is an essential issue to study the 'gender Baila' as well, the work of the female Baila singers like Mariazelle Goonetilleke and Corinne Almeida should also be appreciated,' she said.\n \nShe has also collaborated with some of Sri Lanka's top musicians, among them Sunil Perera of the Gypsies, M.S. Fernando, Dalreen Suby, Clarence Wijewardena, Annesley Malewana, Damian Wickramatilleke, Maxi Rozairo, Shanelle Fernando, Umara Sinhawansa, Ashanthi De Alwis and Raj Seneviratne.\n \nSri Lanka's superstar spoke about her own struggles and her rise to fame in 2003 in an interview with the Sunday Observer, Sri Lanka: 'To have remained as I am in the music scene for 35 years, retaining and who and what I am is a most difficult thing. It's a feeling of elation because of the struggles I have faced to come out on top.'\n \nThe Island newspaper in Colombo noted that, 'Kandy Lamissi hitmaker Mariazelle Goonetilleke, is another local artiste who is very much in demand with Sri Lankans, domiciled abroad.She is regularly seen in Melbourne, London, the Middle East, Canada and most foreign cities where Sri Lankan Associations exist. Her popularity abroad could be attributed to her versatility, she could handle most songs with ease – be it Sinhala, English, Hindi or Tamil.Mariazelle also has the ability to communicate with her audience in a friendly manner. And most people like her style.'\n Christian Faith\n \nMariazelle became a committed Christian in 2009. According to the Island newspaper:'Mariazelle is very much into religion and has taken God as her friend and saviour.' She joined the People's Church in Colombo. Mariazelle said: 'I have sung all my life but now there is singing in my heart. The greatest song I sing is with God as my audience.'\n \nIn 2010, Mariazelle Goonetilleke celebrated 42 years, in the world of entertainment, in South Asia.\n "}, {"name": "Sunil Santha", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "14 April 1915", "Death": "11 April 1981\n(aged 66 years)", "description": "Sunil Santha (Sinhala:සුනිල් සාන්ත; 14 April 1915 – 11 April 1981) was a renowned and influential Sri Lankan composer, singer and lyricist. He was pivotal in the development of Sinhala music and folk songs in the mid to late 1940s and early 1950s. He composed the beloved soundtracks to Lester James Peries' Rekava and Sandesaya in 1956 and 1960. In a later comeback, he produced several experimental works. \nLife and career\n \nEarly life (1915–1945)\n \nSunil Santha was born on 14 April 1915 on the Sinhalese New Year's Day in Dehiyagatha, Jaela. Both his parents died before he was two years old, and Santha was raised by his grandmother. At an early age he came to the limelight when he played king Dutugamunu in a village play. One villager adorned him with a battery-powered lighted necklace. He had his education at prestigious St. Aloysius College, Galle .\n \nSantha passed the school leaving certificate examination as the first in the island, with the highest marks in his class as a young adult and was awarded the Weeraratne award. In 1933 he completed the Teachers Final Examination and began work as a teacher at the Mt. Calvary School. While tenured there, Santha led the school to three consecutive victories at the Southern Schools Music Competition. In 1939 he passed the Intermediate Gandarva Examination and received a certificate in physical training. He also learned to play the piano and guitar at that time. He acted and produced several dramas including \"Hamlet\" during this period.\n \nIn 1940 Santha gave up teaching and travelled to Shantiniketan to study music. The following year Santha enrolled at the Bhatkhande Music Institute and worked to get his Visharadha Degree in 1944. He passed the final exam as the first in the first division in Sitar and Vocals, the first non-Indian Asian to do so. He then adopted the name \"Sunil Santha\". During his studies in India he regularly contributed to Sri Lankan newspapers.\n \nRadio Ceylon (1946–1952)\n \nOn 2 March 1946 Santha held a recital for the Kumaratunga Commemoration ceremony and was asked to record for Radio Ceylon. Over the next six years, he would have a string of popular songs including \"Olu Pipila\" (the first song to be recorded at then Radion Ceylon), \"Handapane\", \"Ho Ga Rella Negay\", \"Bowitiya Dan Palukan Vare\", \"Suwada Rosa Mal Nela\", \"Kokilayange\", and \"Mihikathanalawala.\" Santha stressed his Sinhala heritage in his songs opting to sing in Sinhala rather than English and not copy Hindustani and Tamil songs of India. A diligent songwriter himself, Santha sang songs written by lyricists like Huberth Dissanayake, Munidasa Cumaratunga, Raipiel Tennakoon, Arisen Ahubudu and Fr. Marcelline Jayakody.\n \nIn 1952 Santha was banned from Radio Ceylon after refusing to audition for Indian musician Ratanjankar, whom the corporation had brought from South India to oversee the direction of music on their stations. That year he married school teacher Bernadet Leelawathi Jayasekara.\n \nLater life\n \nSantha experienced monetary problems after being terminated from Radio Ceylon. His songbooks were plagiarised, his songs were sold without consent or royalties by copyright violators. He tried his hand at various trades like photography, selling clothes and electronics over the next few years.\n \nIn 1953 Santha started a small school at the Maradana Newton building, vowing to teach 10 pupils for free. He often helped fellow artists and promising talent. He wrote to newspapers about the plight of Ananda Samarakoon and tried to bring attention to the composer of the national anthem. At a time when Albert Perera (later known as W.D. Amaradeva) who used to play violin at Sunil's performances, was in need of help, Sunil gave him two of his music classes at Panadura to teach and make a living. Sunil also helped collect money to send Amaradewa for further studies in India.\n \nIn 1955 journalist DB Dhanapala started a campaign to expose Santha's plight and raised some money through his column on \nLankadeepa\n.\n \nIn 1967 Director General Mr. Neville Jayaweera asked Santha to come back to the national radio service. Santha worked with W.D. Amaradeva and H.W. Rupasinghe to audition the artists.\n \nSantha moved into his uncle's house in 1970 as he was evicted from the rental house he lived in.\n \nIn 1977 a record titled \nSunil Gee\n was produced. n 1980 a record titled \nSeegiril Gee\n was produced. This contained a set of songs written and composed by Sunil with melodies using only four notes. The lyrics were based on Sigiri Kurutu Gee (sigiri graffiti). The songs are remarkable in that they used traditional Sri Lankan drums and other instruments to create a unique sound.\n \nSantha died on 11 April 1981 from a heart attack shortly after his son Jagath drowned under mysterious circumstances in a swimming pool.\n "}, {"name": "Mohideen Baig", "info": "Sri Lankan singer", "Intro": "Sri Lankan singer", "Was": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "5 December 1919", "Death": "4 November 1991\n(aged 71 years)", "Star sign": "Sagittarius", "Instruments:": "Voice", "description": "\nMohideen Baig\n (1919–1991) was a notable Sri Lankan musician known particularly for his Buddhist devotional music, which enjoy popularity to this day. A Muslim who moved to Sri Lanka from Salem in Tamil Nadu, but of a Hydrabadi Muslim origin. he was considered as a highly influential multicultural/multi-religious figure in the country's arts history. Baig was followed into the music industry by his son Ishak, who also achieved considerable success, although not as well recognized as his father. Baig has dueted with \nH. R. Jothipala\n, G.S.B. Rani Perera, Latha Walpola, Sujatha Attanayake and Jamuna Rani among others. He was also the only Sri Lankan to duet with \nLata Mangeshkar\n.\nMohideen Baig's most famous and most loved duets were sung with Sri Lankan movie legend, actress and songstress \nRukmani Devi\n.\nLife and careerBaig was born in Tamil Nadu, India and migrated to Sri Lanka in 1932, recording his first song Karuna Muhude Namu Gileela in a duet with K. K. Rajaluckshmi in 1934. He debuted as a playback singer in 1947 in the second Sinhalese film Ashokamala.\nBaig achieved fame with songs such as Buddhang Saranang, Maya, Girihel Mudune, Adara Nadiya Gala, Pem Mal Mala, Wella Simbina Rella, Anna Sudo, Thaniwai Upanne, and Loke Sihinayak Wageya. This popularity led to appearances at distinguished events such as the country's first Independence Day Ceremony and the 1974 Non-Aligned Summit. In 1956, Prime Minister \nS.W.R.D. Bandaranaike\n awarded Baig with a Distinguished Citizenship.\nBaig won the Kalashoori Award in 1983 and again in 1987.\nDeathBaig died from an unexpected infection during cataract removal surgery. Following Islamic traditions, his funeral was organized within a day.\n"}, {"name": "Tariq Hisny", "info": "Sri Lankan composer and singer", "Intro": "Sri Lankan composer and singer", "Is": "Musician\nComposer\nRecord producer\nSinger", "From": "Sri Lanka", "Type": "Business\nMusic", "Gender": "male", "Birth": "29 August 1990, Puttalam, Puttalam District, North Western Province, Sri Lanka", "Age": "31 years", "Star sign": "Virgo", "Instruments:": "Piano\n\n\nElectronic keyboard\n\n\nVoice", "Profiles": "", "description": "\nTariq Hisny\n, simply known and credited as \nTariq\n, is a Sri Lankan composer and singer, working mainly for the Indian music industry.\nEarly life and educationTariq was born in Puttalam, North Western Province of Sri Lanka. From a young age, he had shown promise as a singer. During his early days, he used to sing songs as a karaoke artist. He also developed an interest in composing music. He has acknowledged \nYuvan Shankar Raja\n, \nAR Rahman\n and \nKarthik\n as his inspirations.\nTariq learned Carnatic music, western music theory and piano.\nCareerIn 2016, Tariq began composing music. The same year, he released his first album titled, \nIzhaar-e-Ishq\n, in Hindi language. He collaborated with playback singers \nYazin Nizar\n and Srisha for a song “Bin Tere” in this album. This song has been featured in Indian subcontinent and Middle East countries among the youth soon after the release. Also the songs of the album have been recorded in various locations including Chennai, Bangalore and Riyadh.\nIn 2017, Tariq released his first Tamil song “Hey Penne” in collaboration with Sathyaprakash. In 2019, Tariq began working for soundtracks and background scores as he focuses more on composing.\nDiscographyAs composerAs singer"}, {"name": "Lahiru Perera", "info": "Sri Lankan singer, musician and music producer", "Intro": "Sri Lankan singer, musician and music producer", "A.K.A.": "La Signore", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Birth": "18 April 1984, Sri Lanka, Sri Lanka", "Age": "37 years", "Star sign": "Aries", "Profiles": "", "description": "\nLahiru Perera\n (Sinhala: \nලහිරු පෙරේරා\n ; born 18 April 1984) also known by his stage name \nLa Signore\n is a Sri Lankan singer, musician and music producer who came to limelight with his 2008 breakthrough Hit single \"Rambari\". He was born and raised in Kehelbaddara, Udugampola.\nSingle song tracks released"}, {"name": "Annesley Malewana", "info": "Sri Lankan musician", "Intro": "Sri Lankan musician", "Is": "Singer", "From": "Sri Lanka", "Type": "Music", "Gender": "male", "Instruments:": "Voice", "description": "Annesley Malawana\n or \nMalewana\n (\n[ˈænəsli ˈmaːləvənə]\n) (Sinhala: ඇනස්ලි මාලේවන) started his musical journey from Ratnapura (his hometown) with Clarence Wijewardene. In 1966, they formed a group called the Moonstones. Annesley Malawana is an influential Sri Lankan musician.\nLife and careerMalewana was born in Ratnapura (a city in south-central Sri Lanka) and attended St. Joseph’s College in the capital city of Colombo. Upon leaving school, he met \nClarence Wijewardena\n, and the two formed the group Moonstones. In the early 1960s, the Moonstones began performing songs composed by Wijewardena and sung by Malewana (their first hit was \nMango Nanda\n - a song written about the maid who once worked at the home of Clarence's wife in the early days of their relationship).\nMoonstonesPrimarily due to Wijewardena's unique compositions, the Moonstones continued to dominate popular Sri Lankan music for nearly a decade before ultimately breaking up in the late 1960s. The Moonstones were managed by the advertising man Sri Sangabo Corea and were mentored by the legendary Radio Ceylon broadcaster \nVernon Corea\n and his cousin \nVijaya Corea\n. Their music was featured for the very first time on the English Services of Radio Ceylon and subsequently the Sri Lanka Broadcasting Corporation. They became household names as a result of the airplay on Radio Ceylon throughout the 1960s. Annesley Malewana was well known for being a master of contemporary baila.\nDuring the 1960s, 1970s, and 1980s, the songs of the 'Moonstones' and the 'Super Golden Chimes' were on the lips of so many music lovers in Sri Lanka - the musicians were at their peak and Annesley had reached the heights of popularity in the world of music on the island.\nSuper Golden ChimesMalewana and Wijewardena remained friends and reunited in the 1970s to form a group dubbed the \nSuper Golden Chimes\n - this group would, similarly, produce a string of popular songs that included \nUdarata Niliya\n (\nUp-Country Dancer\n), \nSihina Pathum\n (\nIn Dreams\n), \nWana Bambaro\n (\nJungle/Wild Bee\n), and \nSathuta Senasuma\n (\nHappy Feelings\n).\nThe Super Golden Chimes performed for another eight years until, in 1978, Malewana married, and announced his retirement from music. Despite his retirement, Malewana returned in 1988 as a solo artist, and continued to record songs particularly for CDs released in Sri Lanka.\nSuper ChimesMalewana came out of retirement to get back into the music world. In 2005 he formed the band \nAnnesley & The Super Chimes\n.\nAccording to Malewana: \"It was a long felt need in the music scene especially after the Super Golden Chimes Reunion Concert which was held last year. I was under tremendous pressure from my fans and well-wishers to continue with the Super Golden Chimes, but since some of the members are abroad and some others are playing in different groups, I did not want to use the name Super Golden Chimes.\"\nThe songs performed by Malewana and Clarence over their three decade careers have recently been credited, by the group Pahan Silu, as having served to influence them in crafting their unique musical style. Annesley Malewana has reached the pinnacle of fame as a highly respected recording artiste and as an accomplished musician. Together with his close friend, the late Clarence Wijewardena, they were at the very top of music world in South Asia. Wijeywardena and Malewana were two of the most sought after musicians in Sri Lanka.\nTheir songs topped the charts on both the English Service and the Sinhala Service on Radio Ceylon/Sri Lanka Broadcasting Corporation for decades. Annesley Malewana has also made countless appearances on television.\nHis voice has been heard by Londoners over BBC Radio London 206 on the 'London Sounds Eastern' radio programme and on community radio in the United States and in Australia.\nListen to Annesley Malewana on YouTube:\n"}, {"name": "Tharaka Mahesh", "info": "Sri Lankan designer", "Intro": "Sri Lankan designer", "Known for": "Artist of the Albums: zuoiouz, Forneybybeek, Fire Nations, Sensa 2020, Neegalle", "A.K.A.": "Wekwella Gamage Tharaka Mahesh Piyarathna, Tharaka Mahesh Piyarathna, ...", "Is": "Designer\nArtist\nAuthor\nMusician\nSinger\nActor\nYouTuber\nLyricist", "From": "Sri Lanka", "Gender": "male", "Birth": "20 February 1997, Nawagamuwa", "Age": "24 years", "Residence": "Kaduwela", "Family": "Mother:\n\nThilaka Jayangani\n\n\n\nFather:\n\nPiyarathna", "Stats": "Height:\n\n175 cm", "Education": "Dharmapala Vidyalaya Pannipitiya\nG6-A/L\n2008-2016\n\n\nPrimary School Bomiriya\nG1-5\n2003-2007", "Notable Works": "zuoiouz\n2020\n\n\nForneybybeek\n2020\n\n\nFire Nations\n2020\n\n\nSensa 2020\n2020\n\n\nNeegalle\n2020\n\n\nHow to Get a Sri Lankan Driver's License\n2021", "Profiles": "", "description": "Tharaka Mahesh\n is a freelancer graphic designer in Sri Lanka, with experience of designing and advertising music.Tharaka Mahesh\n was born on 20th February 1997 at Nawagamuwa, Sri Lanka.Wekwella Gamage \nTharaka Mahesh\n Piyarathna commonly \nTharaka Mahesh\n, (Sinhala: තාරක මහේෂ්, Tamil: தாரக மகேஷ்) is a Sri Lankan author, designer, artist, creator, philanthropist, social media personality and internet entrepreneur. Tharaka completed education from Dharmapala Vidyalaya Pannipitiya and studied A/L from commerce stream with business statistics. (Grade 1-5 at Ihala Bomiriya Primary School)Tharaka Mahesh\n is best known as the Founder/Director at \nTM TSOFT\n (products & services offering startup company since 2011) and one of the founders of \nTeamGplus\n (social club doing team activities since 2014). He does computing, troubleshooting, helping, player, student, management, designer, social networking, gamer, information technology and social workings.Tharaka Mahesh\n has an official verified artist channels on \nYouTube\n, \nYouTube Music\n, \nSpotify\n, \nDeezer\n, \niTunes\n, \nPandora\n, \nMusixmatch\n & \nAmazon\n.Finally, \nTharaka\n is working with some projects in groups, startup companies and business with giving consulting knowledge and ideas & problem solving. As \nhis role he\n does define, discover, design & deliver on time.Sometimes \nTharaka\n helps others with his Mathematics, Business Statistics & Information and Technological knowledge. In school life since grade 7 he was so talented in Mathematics and teaching about difficult academic questions since the end of the year 2016. And also he is trying to learn something new like about how to learn things and use them with efficiency in the industry."}]